andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>ANAMISC</name>
	<version>1.0</version>
	<description>ANAMISC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001b00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>104</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>ANA_TEST_REG</name>
	<description>Analog test registers</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ACORE_TESTBUS_EN</name>
	<description>TBD</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TEST_STRUCTURE</name>
	<description>4 bits to select which test-structure is mapped on P1[7]
0 : open
1 : VDD (1.2V)
2 : 10uA into 66k = 5/3 x 40k (W/L=0.45/22.33)
3 : 1uA into 700k = 18.5 x 40k (W/L=0.45/22.33)
4 : 1uA(same as going into 700k)
5 : AVS (0V)
6 : 5uA into nMOST (svt) 2x1u/110n
7 : 5uA into nMOST (hvt) 2x1u/110n
8 : 5uA into nMOST (UD18) 2x1u/260n
9 : 5uA into nMOST (OD33) 2x1u/500n
a : 7.5uA into nMOST (na25) 4x1u/1.2u
b : 5uA into nMOST (0vt) 4x1u/300n
c : VDD - 5uA from pMOST (svt) 2x1u/110n
d : VDD - 5uA from pMOST (hvt) 2x1u/110n
e : VDD - 5uA from pMOST (OD33) 2x1u/400n
f : VDD - 5uA from pMOST (UD18) 2x1u/260n </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_CTRL1_REG</name>
	<description>Charger control register 1</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DIE_TEMP_DISABLE</name>
	<description>0: Die temperature protection enabled: charger will be disabled when die temp exceeds value set in DIE_TEMP_SET
1: Die temperature protection disabled: testmode, use only in agreement with Dialog</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DIE_TEMP_SET</name>
	<description>Die temperature protection level.
Charging will be automatically disabled if set level is exceeded and resumed when temperature has dropped few degrees below set level.
00: 0oC (do not use, for test only)
01: 50oC (do not use, for test only)
10: 80oC (default)
11: 100oC</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>CHARGE_CUR</name>
	<description>Constant Current levels (typical values)
0000: 5 mA
0001: 10 mA
0010: 30 mA
0011: 45 mA
0100: 60 mA
0101: 90 mA
0110: 120 mA
0111: 150 mA
1000: 180 mA
1001: 210 mA
1010: 270 mA
1011: 300 mA
1100: 350 mA
1101: 400 mA </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>NTC_LOW_DISABLE</name>
	<description>0: Normal operation: voltage level higher than 7/8 VDD_USB will disable the charger
1: NTC low temp limit disabled: use if trickle charging below the minimum temperature is required </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>NTC_DISABLE</name>
	<description>0: Charger NTC protection enabled
1: Charger NTC protection disable</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>CHARGE_ON</name>
	<description>0: Charger in powerdown
1: Charger enabled </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>CHARGE_LEVEL</name>
	<description>Constant Voltage Levels
00000: 3.00V (reset)
00001: 3.40V (e.g. 2xNiMH)
00010: 3.50V
00011: 3.60V (e.g. Li-phosphate)
00100: 3.74V
00101: 3.86V
00110: 4.00V
00111: 4.05V
01000: 4.10V
01001: 4.15V
01010: 4.20V (e.g. Li-Co, Li-Mn, NMC)
01011: 4.25V
01100: 4.30V
01101: 4.35V
01110: 4.40V
01111: 4.50V
10000: 4.60V
10001: 4.90V e.g. 3xNiMH
10010: 5.00V</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_CTRL2_REG</name>
	<description>Charger control register 2</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000f07</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CHARGER_TEST</name>
	<description>Signals are mapped on SPDIF pin.
Also set ANA_TEST_REG[ANA_TESTBUS_TO_ADCPIN] = 1

000: normal mode (no test selected)
001: Vptat (temperature sensor) [1.4V max]
010: Vbat_sense after divider [1.2V]
011: Current loop output [0 to vsupply]
100: Voltage loop output [0 to vsupply]
101: Imeas or Iref/10
110: Icharge reduced by 26.6
111: reserved</description>
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>CURRENT_OFFSET_TRIM</name>
	<description>do not change, for test purpose only</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	
</field><field>
	<name>CHARGER_VFLOAT_ADJ</name>
	<description>Independent adjustment for the charge level. Adjust range is +/- 1.8%. The 4 bits adjustment is in two's complement.</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>CURRENT_GAIN_TRIM</name>
	<description>do not change, for test purpose only</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_STATUS_REG</name>
	<description>Charger status and trimming register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ff7f</resetMask>
	<fields>
	<field>
	<name>CHARGER_TMODE_PROT</name>
	<description>0: Dietemp below DIE_TEMP_SET level. Normal operation
1: Dietemp above DIE_TEMP_SET level. Charging is disabled</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>CHARGER_BATTEMP_HIGH</name>
	<description>0: Battery pack temperature 'ok' or 'too low' (voltage level on NTC pin above 1/2 VDD_USB)
1: Battery pack temperature 'too high' (voltage level on NTC pin below 1/2 VDD_USB)</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>CHARGER_BATTEMP_OK</name>
	<description>0: Battery pack temperature 'too low' or 'too high' (voltage level on NTC pin below 1/2 or above 7/8 VDD_USB)
1: Battery pack temperature 'ok' (voltage level on NTC pin between 1/2 and 7/8 VDD_USB)</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>CHARGER_BATTEMP_LOW</name>
	<description>0: Battery pack temperature 'ok' or 'too high' (voltage level on NTC pin below 7/8 VDD_USB)
1: Battery pack temperature 'too low' (voltage level on NTC pin above than 7/8 VDD_USB)</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>END_OF_CHARGE</name>
	<description>0: Actual charge current is between 10...100% of set CHARGE_CUR (or CHARGE_ON=0)
1: Actual charge current &lt;10% of set CHARGE_CUR</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CHARGER_CV_MODE</name>
	<description>0: voltage loop not in regulation (or charger is off)
1: constant voltage mode active, voltage loop in regulation. </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>CHARGER_CC_MODE</name>
	<description>0: current loop not in regulation (or charger is off)
1: constant current mode active, current loop in regulation. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
