andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>CLK_REF_CNT_REG</name>
	<description>Count value for oscillator calibration</description>
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>REF_CNT_VAL</name>
	<description>Indicates the calibration time, with a decrement counter to 1. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_REF_SEL_REG</name>
	<description>Select clock for oscillator calibration</description>
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>REF_CAL_START</name>
	<description>Writing a '1' starts a calibration. This bit is cleared when calibration is finished, and CLK_REF_VAL is ready. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>REF_CLK_SEL</name>
	<description>Select clock input for calibration:
0x0 : RC32K oscillator
0x1 : RC16M oscillator
0x2 : XTAL32K oscillator
0x3 : RCX oscillator</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_REF_VAL_H_REG</name>
	<description>DIVN reference cycles, upper 16 bits</description>
	<addressOffset>0x00000066</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>XTAL_CNT_VAL</name>
	<description>Returns the upper 16 bits of DIVN clock cycles counted during the calibration time, defined with REF_CNT_VAL </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_REF_VAL_L_REG</name>
	<description>DIVN reference cycles, lower 16 bits</description>
	<addressOffset>0x00000064</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>XTAL_CNT_VAL</name>
	<description>Returns the lower 16 bits of DIVN clock cycles counted during the calibration time, defined with REF_CNT_VAL </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_ADD2CH_REG</name>
	<description>Fuel Gauge manually add extra charge to SOC_CHARGE_CNTRx_REG</description>
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SOC_ADD2CH</name>
	<description>Extra charge to be added to the SOC_CHARGE_CNTRx_REG per sample period (9-bit + sign + 6 fractional bits </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_CHARGE_AVG_REG</name>
	<description>Fuel Gauge Average charge counter</description>
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CHARGE_AVG</name>
	<description>Average of 'charge' current (9-bit + sign and 6 fractional bits </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_CHARGE_CNTR1_REG</name>
	<description>Fuel Gauge Charge counter bits 15-0</description>
	<addressOffset>0x00000048</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CHARGE_CNT1</name>
	<description>Sum of the charge-values per sampling period; (bits15:0)
The absolute full-scale charge value is 6-bits, At full scale charge current it takes 2^26 sampling periods until overflow of the charge_cnt register after a reset_charge event.
At fs=144kHz (=default) this will happen after 33 hours
At fs=1.152MHz After 10 hours </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_CHARGE_CNTR2_REG</name>
	<description>Fuel Gauge Charge counter bits 31-16</description>
	<addressOffset>0x0000004a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CHARGE_CNT2</name>
	<description>Sum of the charge-values per sampling period; (bits23:16) </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_CHARGE_CNTR3_REG</name>
	<description>Fuel Gauge Charge counter bits 39-32</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CHARGE_CNT3</name>
	<description>Sum of the charge-values per sampling period; (bits39:24) </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_CTRL1_REG</name>
	<description>Fuel Gauge Control register 1</description>
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000d880</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SOC_CINT</name>
	<description>Integrator capacitor scaler
0: Cint = 1 pF
1: Cint = 2 pF
2: Cint = 4 pF
3: Cint = 8 pF (=default) </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>SOC_BIAS</name>
	<description>Current DAC scaler
0: Ibias = 2 uA
1: Ibias = 1 uA (=default)
2: Ibias = 0.5 uA
3: Ibias = 0.25 uA </description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>SOC_CLK</name>
	<description>SOC Sample frequency
0: automatic mode (tbd)
1: fs = 18 kHz
2: fs = 36 kHz
3: fs = 72 kHz
4: fs = 144 kHz (=default)
5: fs = 288 kHz
6: fs = 576 kHz
7: fs = 1152 kHz </description>
	<access>read-write</access>
	<bitRange>[11:9]</bitRange>
	
</field><field>
	<name>SOC_LPF</name>
	<description>0: low-pass filter at integrator inputs disabled
1: Enables a low-pass filter at the integrator inputs </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SOC_IDAC</name>
	<description>Scales the current DAC (Ibias: default=1uA)
0: Idac=0.25*Ibias
1: Idac=0.5*Ibias
2: Idac=Ibias (=default)
3: Idac=2*Ibias</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>SOC_SIGN</name>
	<description>Defines the sign of the charge converter input and output to perform a chopper function to eliminate offset voltage (see also SOC_CHOP and 'sign' on output pin)
0: non-inverted inputs and outputs
1: inverted inputs and outputs</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SOC_GPIO</name>
	<description>Reserved (not yet implemented): switches the SOC-inputs to the GPIO pins</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SOC_MUTE</name>
	<description>0: Normal operation
1: Connect the input voltage to 0V </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SOC_RESET_AVG</name>
	<description>1: Reset the SOC_CHARGE_AVG_REG to the last value of SOC_CHARGE_CNTRx_REG </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SOC_RESET_CHARGE</name>
	<description>1: Reset CHARGE_CNTR_REG </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SOC_ENABLE</name>
	<description>0: SOC analog circuits off. CHARGE_CNTRx_REG can still be written for a manual update.
See SOC_ADD2CH_REG
1: SOC analog circuits enabled </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
