andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>SOC_CTRL2_REG</name>
	<description>Fuel Gauge Control register 2</description>
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000776a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SOC_DYNAVG</name>
	<description>if HIGH then 'weight' of Moving Average is forced to 1 if the converter detects significant input change
(if dcharge &gt; 4*delta_c, or high_limit, or low_limit) </description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>SOC_MAW</name>
	<description>Moving Average Weight factor
charge_avg(n) =
(weight*charge_avg(n-1) + charge(n) ) / (weight+1) where:weight = 2^(soc_maw) </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>SOC_CMIREG_ENABLE</name>
	<description>SOC_CMIREG enable</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>SOC_CHOP</name>
	<description>Chopping control
0: 'external' chopping control with 'soc_sign'-input
1: chop each 2^1*scycle fs-periods
2: chop each 2^2*scycle fs-periods
..
7: chop each 2^7*scycle fs-periods. </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>SOC_ICM</name>
	<description>adds a common-mode current to Idac to increase the common-mode input-level of the integrator.
The common-mode input level is equal to (Idac+Icm)*Rvi;
0: Icm=0;
1: Icm=1*Ibias (=default);
2: Icm=2*Ibias;
3: Icm=4*Ibias</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>SOC_DCYCLE</name>
	<description>Cycle the current divider segments of Idac
0: no cycling
1: cycle each scycle fs-periods </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SOC_SCYCLE</name>
	<description>Cycle current segments (8 segments) of Idac
0: no cycling
1: cycle each fs-period
2: cycle each 2 fs-periods
..
7: cycle each 7 fs-periods </description>
	<access>read-write</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>SOC_RVI</name>
	<description>Voltage-to-current resistor scaler
0: Rvi = 25 k
1: Rvi = 50 k
2: Rvi = 100 k (= default)
3: Rvi = 200 k </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_CTRL3_REG</name>
	<description>Fuel Gauge Control register 3</description>
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000011</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SOC_VCMI</name>
	<description>Common Input Voltage target of regulator (see SOC_CMIREG_ENABLE)
0: 50 mV
1: 100 mV
2: 150 mV
3: 200 mV</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>SOC_DYNHYS</name>
	<description>Reserved. (To be implemented)
Hysteresis of the comparator which detects if the integrator voltage is rising or falling </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SOC_DYNTARG</name>
	<description>Reserved. (To be implemented)
0: Vint_target = 0V
1: Vint_target tracks the 2 MSB's of the charge register) </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SOC_VSAT</name>
	<description>Trigger level of the high-limit and low-limit comparators.
0: low_limit = -50mV; high_limit = +50mV
1: low_limit = -100mV; high_limit = +100mV (=default)
2: low_limit = -200mV; high_limit = +200mV
3: low_limit = -400mV; high_limit = +400mV</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_EXT_IN_REG</name>
	<description>Fuel Gauge input test register</description>
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SOC_EXT_IDAC_EN</name>
	<description>1: Enable 'external' control of Idac</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>SOC_EXT_SCYCLE_EN</name>
	<description>1: Enable 'external' control of scycle</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>SOC_NR_SCYCLE</name>
	<description>Number of the scycle </description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>SOC_RDAC_DIS</name>
	<description>0: Disables the resistor divider DAC. The Idac has 6-bits (plus sign)
1: Enables the resistor divider DAC. The Idac has 9-bits (plus sign)</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SOC_IDAC_SIGN</name>
	<description>0: SOC_IDAC_VAL is positive
1: SOC_IDAC_VAL is negative</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SOC_IDAC_VAL</name>
	<description>Controls the current for the DAC.
0: 0/512*SOC_IDAC
N: N/512*SOC_IDAC</description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SOC_EXT_OUT_REG</name>
	<description>Fuel Gauge output test register</description>
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SOC_CTRL_EVENT</name>
	<description>Controller event </description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SOC_STATE</name>
	<description>Controller state </description>
	<access>read-only</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>SOC_RISING_COMP</name>
	<description>Rising comparator output </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SOC_POS_COMP</name>
	<description>Positive comparator output </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SOC_LOWLIM_COMP</name>
	<description>Low_limit comparator output </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SOC_HIGH_LIM</name>
	<description>High_limit comparator output </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
