andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>SRC1_IN1_REG</name>
	<description>SRC1 data in 1</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_IN</name>
	<description>SRC1_IN1 </description>
	<access>read-write</access>
	<bitRange>[31:8]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_IN2_REG</name>
	<description>SRC1 data in 2</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_IN</name>
	<description>SRC1_IN2 </description>
	<access>read-write</access>
	<bitRange>[31:8]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_IN_FS_REG</name>
	<description>SRC1 Sample input rate</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_IN_FS</name>
	<description>SRC_IN Sample rate
SRC_IN_FS = 8192*Sample_rate/100
Sample_rate upper limit is 192kHz. For 96kHz and 192kHz SRC_CTRLx_REG[SRC_IN_DS] must be set as shown below:

Sample_rate SRC_IN_FS SRC_IN_DS Audio bandwidth
8000 Hz 0xA0000 0 4000 Hz
11025 Hz 0x0DC800 0 5512 Hz
16000 Hz 0x140000 0 8000 Hz
22050 Hz 0x1B9000 0 11025 Hz
32000 Hz 0x280000 0 16000 Hz
44100 Hz 0x372000 0 22050 Hz
48000 Hz 0x3C0000 0 24000 Hz
96000 Hz 0x3C0000 1 24000 Hz
192000 Hz 0x3C0000 3 24000 Hz

In manual SRC mode, SRC_IN_FS can be set and adjusted to the desired sample rate at any time.
In automatic mode the SRC returns the final sample rate as soon as SRC_IN_OK. Note that SRC_DS is not calculated in automatic mode and must be set manually automatic mode with Sample_rate of 96 and 192kHz.</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_OUT1_REG</name>
	<description>SRC1 data out 1</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_OUT</name>
	<description>SRC1_OUT1 </description>
	<access>read-only</access>
	<bitRange>[31:8]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_OUT2_REG</name>
	<description>SRC1 data out 2</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_OUT</name>
	<description>SRC1_OUT2 </description>
	<access>read-only</access>
	<bitRange>[31:8]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_OUT_FS_REG</name>
	<description>SRC1 Sample output rate</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_OUT_FS</name>
	<description>SRC_OUT Sample rate
SRC_OUT_FS = 8192*Sample_rate/100
Sample_rate upper limit is 192kHz. For 96kHz and 192kHz SRC_CTRLx_REG[SRC_DS] must be set as shown below:

Sample_rate SRC_OUT_FS  SRC_OUT_DS Audio bandwidth
8000 Hz     0xA0000     0          4000 Hz
11025 Hz    0x0DC800    0          5512 Hz
16000 Hz    0x140000    0          8000 Hz
22050 Hz    0x1B9000    0          11025 Hz
32000 Hz    0x280000    0          16000 Hz
44100 Hz    0x372000    0          22050 Hz
48000 Hz    0x3C0000    0          24000 Hz
96000 Hz    0x3C0000    1          24000 Hz
192000 Hz   0x3C0000    3          24000 Hz

In manual SRC mode, SRC_OUT_FS can be set and adjusted to the desired sample rate at any time.
In automatic mode the SRC returns the final sample rate as soon as SRC_OUT_OK. Note that SRC_DS is not calculated in automatic mode and must be set manually automatic mode with Sample_rate of 96 and 192kHz.</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>BLE</name>
	<version>1.0</version>
	<description>BLE registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40000000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>532</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>BLE_ACTSCANSTAT_REG</name>
	<description>Active scan register</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00010001</resetValue>
	<resetMask>0x01ff01ff</resetMask>
	<fields>
	<field>
	<name>BACKOFF</name>
	<description>Active scan mode back-off counter initialization value. </description>
	<access>read-only</access>
	<bitRange>[24:16]</bitRange>
	
</field><field>
	<name>UPPERLIMIT</name>
	<description>Active scan mode upper limit counter value. </description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_ADVCHMAP_REG</name>
	<description>Advertising Channel Map</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000007</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>ADVCHMAP</name>
	<description>Advertising Channel Map, defined as per the advertising connection settings. Contains advertising channels index 37 to 39. If ADVCHMAP[i] equals:
0: Do not use data channel i+37.
1: Use data channel i+37. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_ADVTIM_REG</name>
	<description>Advertising Packet Interval</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>ADVINT</name>
	<description>Advertising Packet Interval defines the time interval in between two ADV_xxx packet sent. Value is in us.
Value to program depends on the used Advertising Packet type and the device filtering policy. </description>
	<access>read-write</access>
	<bitRange>[13:0]</bitRange>
	
