andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>BLE_BLEMPRIO1_REG</name>
	<description>Coexistence interface Priority 1 Register</description>
	<addressOffset>0x0000010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x30000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BLEMDEFAULT</name>
	<description>Set default priority value for other BLE message than those defined above </description>
	<access>read-write</access>
	<bitRange>[31:28]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_CNTL2_REG</name>
	<description>BLE Control Register 2</description>
	<addressOffset>0x00000200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BLE_TRANSACTION_START</name>
	<description>The value will be compared with the FINECNT in order to assert the BLE_TRANSACTION signal towards the COEX block. The deassertion of BLE_TRANSACTION is triggered by the deassertion of BLE_EVENT_IN_PROCESS. Refer also to BLE_TRANSACTION_MODE, BLE_TRANSACTION_SRC and BLE_PTI_SOURCE_SEL bitfields.
If the desired distance from TX_EN/RX_EN is RADIO_PWRDN and TXRXPWRUP=max(TXPWRUP, RXPWRUP), then this bitfield must be set to (RADIO_PWRDN + TXRXPWRUP-1) if CS.FCNTOFFSET is "0", otherwise it must be set to (RADIO_PWRDN + TXRXPWRUP-1 - CS.FCNTOFFSET-1). 
Remark: BLE_EVENT_IN_PROCESS is controlled by the BLE_TIMGENCNTL_REG.PREFETCH_TIME, so the BLE_TRANSACTION_START should be less than the PREFETCH_TIME.</description>
	<access>read-write</access>
	<bitRange>[31:22]</bitRange>
	
</field><field>
	<name>BLE_RSSI_SEL</name>
	<description>0: Select Peak-hold RSSI value (default).
1: Select current Average RSSI value. </description>
	<access>read-write</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>WAKEUPLPSTAT</name>
	<description>The status of the BLE_WAKEUP_LP_IRQ. The Interrupt Service Routine of BLE_WAKEUP_LP_IRQ should return only when the WAKEUPLPSTAT is cleared.
Note that BLE_WAKEUP_LP_IRQ is automatically acknowledged after the power up of the Radio Subsystem, plus one Low Power Clock period. </description>
	<access>read-only</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>SW_RPL_SPI</name>
	<description>Keep to 0. </description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>BB_ONLY</name>
	<description>Keep to 0.</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>BLE_PTI_SOURCE_SEL</name>
	<description>0: Provide to COEX block the PTI value indicated by the Control Structure. Recommended value is "0".
1: Provide to COEX block the PTI value generated dynamically by the BLE core, which is based on the PTI of the Control Structure.</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>BLE_TRANSACTION_MODE</name>
	<description>0: Keep the BLE_TRANSACTION constant during the process of the current event, regadless of the state of PTI value. Recommended value is "0".
1: Create a one clock cycle of low period at the BLE_TRANSACTION whenever a change in the PTI value is detected.
(refer also to BLE_PTI_SOURCE_SEL)</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>BLE_TRANSACTION_SRC</name>
	<description>0: Assert the BLE_TRANSACTION at the moment indicated by the BLE_TRANSACTION_START only if the PTI value is available at that moment, otherwise assert BLE_TRANSACTION at the next positive edge of TX_EN ot RX_EN. Recommended value is "0".
1: Assert the BLE_TRANSACTION at the moment indicated by the BLE_TRANSACTION_START, if during this moment the BLE_EVENT_IN_PROCESS is asserted, otherwise assert BLE_TRANSACTION at the next positive edge of TX_EN ot RX_EN. Useful when COEX_CTRL_REG[SEL_BLE_PTI]=0.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>BLE_CLK_SEL</name>
	<description>BLE Clock Select.
Specifies the BLE master clock absolute frequency in MHz.
Typical values are 16 and 8.
Value depends on the selected XTAL frequency and the value of CLK_RADIO_REG[BLE_DIV] bitfield. For example, if XTAL oscillates at 16MHz and CLK_RADIO_REG[BLE_DIV] = 1 (divide by 2), then BLE master clock frequency is 8MHz and BLE_CLK_SEL should be set to value 8.
The selected BLE master clock frequency (affected by BLE_DIV and BLE_CLK_SEL) must be modified and set only during the initialization time, i.e. before setting BLE_RWBTLECNTL_REG[RWBLE_EN] to 1.
Refer also to BLE_RWBTLECONF_REG[CLK_SEL].</description>
	<access>read-write</access>
	<bitRange>[14:9]</bitRange>
	
</field><field>
	<name>RADIO_PWRDN_ALLOW</name>
	<description>This active high signal indicates when it is allowed for the BLE core (embedded in the Radio sub-System power domain) to be powered down.
After the assertion of the BLE_DEEPSLCNTL_REG[DEEP_SLEEP_ON] a hardware sequence based on the Low Power clock will cause the assertion of RADIO_PWRDN_ALLOW. The RADIO_PWRDN_ALLOW will be cleared to "0" when the BLE core exits from the sleep state, i.e. when the BLE_SLP_IRQ will be asserted.</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>MON_LP_CLK</name>
	<description>The SW can only write a "0" to this bit.
Whenever a positive edge of the low power clock used by the BLE Timers is detected, then the HW will automatically set this bit to "1". This functionality will not work if BLE Timer is in reset state (refer to CLK_RADIO_REG[BLE_LP_RESET]).
This bit can be used for SW synchronization, to debug the low power clock, etc.</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>BLE_CLK_STAT</name>
	<description>0: BLE uses low power clock
1: BLE uses master clock </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>BLE_DIAG_OVR_SEL</name>
	<description>Effective only when BLE_CNTL2_REG[ BLE_DIAG_OVR ] is set to '1', providing the values of P1[0] and P1[2] diagnostic signals:
P1[0] will provide the logical OR of all Cortex M0 IRQ lines, regadless of the BLE_DIAG_OVR_SEL value.
P1[2] will provide the value according to the BLE_DIAG_OVR_SEL value:
00: "low_power_clk" free running clock.
01: "running_at_32k" status.
10: "cortex_deepsleep" status.
11: "deep_sleep_stat_32k" BLE core in sleep mode.</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>BLE_DIAG_OVR</name>
	<description>1: Overrule the P1[0] and P1[2] control signals PAD_LATCH_EN to always "1" and the direction to always "output". It can be used in combination with the BLE_CNTL2_REG[ BLE_DIAG_OVR_SEL ] to provide diagnostic signals on P1[0] and P1[2] even while the system is in power down state.
0: The PAD_LATCH_EN and direction of P1[0] and P1[2] pins are not overruled.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>EMACCERRMSK</name>
	<description>Exchange Memory Access Error Mask:
When cleared to "0" the EM_ACC_ERR will not cause an BLE_ERROR_IRQ interrupt.
When set to "1" an BLE_ERROR_IRQ will be generated as long as EM_ACC_ERR is "1". </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>EMACCERRACK</name>
	<description>Exchange Memory Access Error Acknowledge.
When the SW writes a "1" to this bit then the EMACCERRSTAT bit will be cleared.
When the SW writes "0" it will have no affect.
The read value is always "0". </description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>EMACCERRSTAT</name>
	<description>Exchange Memory Access Error Status:
The bit is read-only and can be cleared only by writing a "1" at EMACCERRACK bitfield.
This bit will be set to "1" by the hardware when the controller will access an EM page that is not mapped according to the EM_MAPPING value.
When this bit is "1" then the BLE_ERROR_IRQ will be asserted as long as EMACCERRMSK is "1". </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
