andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>BLE_DEEPSLCNTL_REG</name>
	<description>Deep-Sleep control register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>EXTWKUPDSB</name>
	<description>External Wake-Up disable
0: RW-BLE Core can be woken by external wake-up
1: RW-BLE Core cannot be woken up by external wake-up </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>DEEP_SLEEP_STAT</name>
	<description>Indicator of current Deep Sleep clock mux status:
0: RW-BLE Core is not yet in Deep Sleep Mode
1: RW-BLE Core is in Deep Sleep Mode (only low_power_clk is running) </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>SOFT_WAKEUP_REQ</name>
	<description>Wake Up Request from RW-BLE Software. Applies when system is in Deep Sleep Mode. It wakes up the RW-BLE Core when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DEEP_SLEEP_CORR_EN</name>
	<description>625us base time reference integer and fractional part correction. Applies when system has been woken-up from Deep Sleep Mode. It enables Fine Counter and Base Time counter when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DEEP_SLEEP_ON</name>
	<description>0: RW-BLE Core in normal active mode
1: Request RW-BLE Core to switch in deep sleep mode.
This bit is reset on DEEP_SLEEP_STAT falling edge. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DEEP_SLEEP_IRQ_EN</name>
	<description>Always set to "3" when DEEP_SLEEP_ON is set to "1".
It controls the generation of BLE_WAKEUP_LP_IRQ. </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_DEEPSLSTAT_REG</name>
	<description>Duration of the last deep sleep phase register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DEEPSLDUR</name>
	<description>Actual duration of the last deep sleep phase measured in low_power_clk clock cycle. DEEPSLDUR is set to zero at the beginning of the deep sleep phase, and is incremented at each low_power_clk clock cycle until the end of the deep sleep phase. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_DEEPSLWKUP_REG</name>
	<description>Time (measured in Low Power clock cycles) in Deep Sleep Mode before waking-up the device</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DEEPSLTIME</name>
	<description>Determines the time in low_power_clk clock cycles to spend in Deep Sleep Mode before waking-up the device. This ensures a maximum of 37 hours and 16mn sleep mode capabilities at 32kHz. This ensures a maximum of 36 hours and 16mn sleep mode capabilities at 32.768kHz </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_DIAGCNTL2_REG</name>
	<description>Debug use only</description>
	<addressOffset>0x0000020c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DIAG7_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output.</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>DIAG7</name>
	<description>Only relevant when DIAG7_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG7. </description>
	<access>read-write</access>
	<bitRange>[29:24]</bitRange>
	
</field><field>
	<name>DIAG6_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output.</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>DIAG6</name>
	<description>Only relevant when DIAG6_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG6. </description>
	<access>read-write</access>
	<bitRange>[21:16]</bitRange>
	
</field><field>
	<name>DIAG5_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DIAG5</name>
	<description>Only relevant when DIAG5_EN= 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG5.</description>
	<access>read-write</access>
	<bitRange>[13:8]</bitRange>
	
</field><field>
	<name>DIAG4_EN</name>
	<description>0: Disable diagnostic port 0 output. All outputs are set to 0x0.
1: Enable diagnostic port 0 output.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DIAG4</name>
	<description>Only relevant when DIAG4_EN = 1.
Selection of the outputs that must be driven to the diagnostic port BLE_DIAG4.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_DIAGCNTL3_REG</name>
	<description>Debug use only</description>
	<addressOffset>0x00000210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DIAG7_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>DIAG7_BIT</name>
	<description>Selects which bit from the DIAG7 word will be forwarded to bit 7 of the BLE DIagnostic Port.</description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	
</field><field>
	<name>DIAG6_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>DIAG6_BIT</name>
	<description>Selects which bit from the DIAG6 word will be forwarded to bit 6 of the BLE DIagnostic Port.</description>
	<access>read-write</access>
	<bitRange>[26:24]</bitRange>
	
</field><field>
	<name>DIAG5_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>DIAG5_BIT</name>
	<description>Selects which bit from the DIAG5 word will be forwarded to bit 5 of the BLE DIagnostic Port.</description>
	<access>read-write</access>
	<bitRange>[22:20]</bitRange>
	
</field><field>
	<name>DIAG4_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>DIAG4_BIT</name>
	<description>Selects which bit from the DIAG4 word will be forwarded to bit 4 of the BLE DIagnostic Port.</description>
	<access>read-write</access>
	<bitRange>[18:16]</bitRange>
	
</field><field>
	<name>DIAG3_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DIAG3_BIT</name>
	<description>Selects which bit from the DIAG3 word will be forwarded to bit 3 of the BLE DIagnostic Port.</description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>DIAG2_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DIAG2_BIT</name>
	<description>Selects which bit from the DIAG2 word will be forwarded to bit 2 of the BLE DIagnostic Port.</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>DIAG1_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DIAG1_BIT</name>
	<description>Selects which bit from the DIAG1 word will be forwarded to bit 1 of the BLE DIagnostic Port.</description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>DIAG0_INV</name>
	<description>If set, then the specific diagnostic bit will be inverted.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DIAG0_BIT</name>
	<description>Selects which bit from the DIAG0 word will be forwarded to bit 0 of the BLE DIagnostic Port.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
