andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>BLE_RADIOCNTL2_REG</name>
	<description>Radio interface control register</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	</fields>
</register><register>
	<name>BLE_RADIOCNTL3_REG</name>
	<description>Radio interface control register</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000040</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	</fields>
</register><register>
	<name>BLE_RADIOPWRUPDN_REG</name>
	<description>RX/TX power up/down phase register</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00d203d2</resetValue>
	<resetMask>0x7fff0fff</resetMask>
	<fields>
	<field>
	<name>RTRIP_DELAY</name>
	<description>Defines round trip delay value. This value correspond to the addition of data latency in Tx and data latency in Rx. Value is in us </description>
	<access>read-write</access>
	<bitRange>[30:24]</bitRange>
	
</field><field>
	<name>RXPWRUP</name>
	<description>This register holds the length in s of the RX power up phase for the current radio device. Default value is 210us (reset value). Operating range depends on the selected radio. </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>TXPWRDN</name>
	<description>This register extends the length in s of the TX power down phase for the current radio device. Default value is 3us (reset value). Operating range depends on the selected radio. </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>TXPWRUP</name>
	<description>This register holds the length in s of the TX power up phase for the current radio device. Default value is 210us (reset value). Operating range depends on the selected radio. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_RFTESTCNTL_REG</name>
	<description>RF Testing Register</description>
	<addressOffset>0x000000e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>INFINITERX</name>
	<description>Applicable in RF Test Mode only
0: Normal mode of operation
1: Infinite Rx window </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>RXPKTCNTEN</name>
	<description>Applicable in RF Test Mode only
0: Rx packet count disabled
1: Rx packet count enabled, and reported in CS-RXCCMPKTCNT and RFTESTRXSTAT-RXPKTCNT on RF abort command </description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>INFINITETX</name>
	<description>Applicable in RF Test Mode only
0: Normal mode of operation.
1: Infinite Tx packet / Normal start of a packet but endless payload </description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>TXLENGTHSRC</name>
	<description>Applicable only in Tx/Rx RF Test mode
0: Normal mode of operation: TxDESC-TXADVLEN controls the Tx packet payload size
1: Uses RFTESTCNTL-TXLENGTH packet length (can support up to 512 bytes transmit) </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>PRBSTYPE</name>
	<description>Applicable only in Tx/Rx RF Test mode
0: Tx Packet Payload are PRBS9 type
1: Tx Packet Payload are PRBS15 type </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>TXPLDSRC</name>
	<description>Applicable only in Tx/Rx RF Test mode
0: Tx Packet Payload source is the Control Structure
1: Tx Packet Payload are PRBS generator </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>TXPKTCNTEN</name>
	<description>Applicable in RF Test Mode only
0: Tx packet count disabled
1: Tx packet count enabled, and reported in CS-TXCCMPKTCNT and RFTESTTXSTAT-TXPKTCNT on RF abort command </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TXLENGTH</name>
	<description>Applicable only for Tx/Rx RF Test mode, and valid when RFTESTCNTL-TXLENGTHSRC = 1
Tx packet length in number of byte </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_RFTESTRXSTAT_REG</name>
	<description>RF Testing Register</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RXPKTCNT</name>
	<description>Reports number of correctly received packet during Test Modes (no sync error, no CRC error).
Value is valid if RFTESTCNTL-RXPKTCNTEN is set</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_RFTESTTXSTAT_REG</name>
	<description>RF Testing Register</description>
	<addressOffset>0x000000e4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TXPKTCNT</name>
	<description>Reports number of transmitted packet during Test Modes.
Value is valid if RFTESTCNTL-TXPKTCNTEN is set</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_RWBLECNTL_REG</name>
	<description>BLE Control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MASTER_SOFT_RST</name>
	<description>Reset the complete BLE Core except registers and timing generator, when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0.</description>
	<access>write-only</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>MASTER_TGSOFT_RST</name>
	<description>Reset the timing generator, when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0.</description>
	<access>write-only</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>REG_SOFT_RST</name>
	<description>Reset the complete register block, when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0.
Note that INT STAT will not be cleared, so the user should also write to BLE_INTACK_REG after the SW Reset</description>
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>SWINT_REQ</name>
	<description>Forces the generation of ble_sw_irq when written with a 1, and proper masking is set. Resets at 0 when action is performed. No action happens if it is written with 0.</description>
	<access>write-only</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>RFTEST_ABORT</name>
	<description>Abort the current RF Testing defined as per CS-FORMAT when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0.
Note that when RFTEST_ABORT is requested:
1) In case of infinite Tx, the Packet Controller FSM stops at the end of the current byte in process, and processes accordingly the packet CRC.
2) In case of Infinite Rx, the Packet Controller FSM either stops as the end of the current Packet reception (if Access address has been detected), or simply stop the processing switching off the RF.</description>
	<access>write-only</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>ADVERT_ABORT</name>
	<description>Abort the current Advertising event when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0.</description>
	<access>write-only</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>SCAN_ABORT</name>
	<description>Abort the current scan window when written with a 1. Resets at 0 when action is performed. No action happens if it is written with 0.</description>
	<access>write-only</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>MD_DSB</name>
	<description>0: Normal operation of MD bits management
1: Allow a single Tx/Rx exchange whatever the MD bits are.
value forced by SW from Tx Descriptorvalue just saved in Rx Descriptor during reception</description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>SN_DSB</name>
	<description>0: Normal operation of Sequence number
1: Sequence Number Management disabled:
value forced by SW from Tx Descriptorvalue ignored in Rx, where no SN error reported.</description>
	<access>read-write</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>NESN_DSB</name>
	<description>0: Normal operation of Acknowledge
1: Acknowledge scheme disabled:
value forced by SW from Tx Descriptorvalue ignored in Rx, where no NESN error reported.</description>
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>CRYPT_DSB</name>
	<description>0: Normal operation. Encryption / Decryption enabled.
1: Encryption / Decryption disabled.
Note that if CS-CRYPT_EN is set, then MIC is generated, and only data encryption is disabled, meaning data sent are plain data.</description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>WHIT_DSB</name>
	<description>0: Normal operation. Whitening enabled.
1: Whitening disabled.</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>CRC_DSB</name>
	<description>0: Normal operation. CRC removed from data stream.
1: CRC stripping disabled on Rx packets, CRC replaced by 0x000 in Tx.</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>HOP_REMAP_DSB</name>
	<description>0: Normal operation. Frequency Hopping Remapping algorithm enabled.
1: Frequency Hopping Remapping algorithm disabled</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>CORR_MODE</name>
	<description>Defines correlation mode
00: Correlates onto Access Address
01: Correlates onto half preamble and Access Address
10: Correlates onto full preamble and Access Address
11: n/a</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>ADVERTFILT_EN</name>
	<description>Advertising Channels Error Filtering Enable control
0: RW-BLE Core reports all errors to RW-BLE Software
1: RW-BLE Core reports only correctly received packet, without error to RW-BLE Software</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>RWBLE_EN</name>
	<description>0: Disable RW-BLE Core Exchange Table pre-fetch mechanism.
1: Enable RW-BLE Core Exchange table pre-fetch mechanism.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>RXWINSZDEF</name>
	<description>Default Rx Window size in us. Used when device:

is master connectedperforms its second receipt.0 is not a valid value. Recommended value is 10 (in decimal).</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>SYNCERR</name>
	<description>Indicates the maximum number of errors allowed to recognize the synchronization word.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
