andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>BLE_RWBLECONF_REG</name>
	<description>Configuration register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1002001f</resetValue>
	<resetMask>0x3f7f3f7f</resetMask>
	<fields>
	<field>
	<name>ADD_WIDTH</name>
	<description>Value of the RW_BLE_ADDRESS_WIDTH parameter concerted into binary.</description>
	<access>read-only</access>
	<bitRange>[29:24]</bitRange>
	
</field><field>
	<name>RFIF</name>
	<description>Radio Interface ID </description>
	<access>read-only</access>
	<bitRange>[22:16]</bitRange>
	
</field><field>
	<name>CLK_SEL</name>
	<description>Operating Frequency (in MHz) </description>
	<access>read-only</access>
	<bitRange>[13:8]</bitRange>
	
</field><field>
	<name>DECIPHER</name>
	<description>0: AES deciphering not present</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DMMODE</name>
	<description>0: RW-BLE Core is used as a standalone BLE device </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>INTMODE</name>
	<description>1: Interrupts are trigger level generated, i.e. stays active at 1 till acknowledgement </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>COEX</name>
	<description>1: WLAN Coexistence mechanism present </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>USEDBG</name>
	<description>1: Diagnostic port instantiated </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>USECRYPT</name>
	<description>1: AES-CCM Encryption block present </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>BUSWIDTH</name>
	<description>Processor bus width:
1: 32 bits </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_RXMICVAL_REG</name>
	<description>AES / CCM plain MIC value</description>
	<addressOffset>0x000000dc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RXMICVAL</name>
	<description>AES-CCM plain MIC value. Valid on once MIC has been extracted from Rx packet. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_SAMPLECLK_REG</name>
	<description>Samples the Base Time Counter</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SAMP</name>
	<description>Writing a 1 samples the Base Time Counter value in BASETIMECNT register. Resets at 0 when action is performed. </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_SWPROFILING_REG</name>
	<description>Software Profiling register</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SWPROFVAL</name>
	<description>Software Profiling register: used by RW-BLE Software for profiling purpose: this value is copied on Diagnostic port </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_TIMGENCNTL_REG</name>
	<description>Timing Generator Register</description>
	<addressOffset>0x000000f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>APFM_EN</name>
	<description>Controls the Anticipated pre-Fetch Abort mechanism
0: Disabled
1: Enabled </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>PREFETCHABORT_TIME</name>
	<description>Defines the instant in s at which immediate abort is required after anticipated pre-fetch abort </description>
	<access>read-write</access>
	<bitRange>[25:16]</bitRange>
	
</field><field>
	<name>PREFETCH_TIME</name>
	<description>Defines Exchange Table pre-fetch instant in us </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_TXMICVAL_REG</name>
	<description>AES / CCM plain MIC value</description>
	<addressOffset>0x000000d8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TXMICVAL</name>
	<description>AES-CCM plain MIC value. Valid on when MIC has been calculated (in Tx) </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_VERSION_REG</name>
	<description>Version register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07010000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TYP</name>
	<description>BLE Core Type</description>
	<access>read-only</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>REL</name>
	<description>BLE Core version Major release number.</description>
	<access>read-only</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>UPG</name>
	<description>BLE Core upgrade Upgrade number.</description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>BUILD</name>
	<description>BLE Core Build Build number.</description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_WLNBDEV_REG</name>
	<description>Devices in white list</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>NBPRIVDEV</name>
	<description>Number of private devices in the white list.</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>NBPUBDEV</name>
	<description>Number of public devices in the white list. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
