andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>BLE_WLPRIVADDPTR_REG</name>
	<description>Start address of private devices list</description>
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>WLPRIVADDPTR</name>
	<description>Start address pointer of the private devices white list. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BLE_WLPUBADDPTR_REG</name>
	<description>Start address of public devices list</description>
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>WLPUBADDPTR</name>
	<description>Start address pointer of the public devices white list. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CACHE</name>
	<version>1.0</version>
	<description>CACHE registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x400c3000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>84</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CACHE_ASSOCCFG_REG</name>
	<description>Cache associativity configuration register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_ASSOC</name>
	<description>Cache associativity:
0: 1-way (direct mapped)
1: 2-way
2: 4-way
3: reserved.
Note: Flush the cache controller before dynamically decreasing the associativity.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_CTRL1_REG</name>
	<description>Cache control register 1</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_RES1</name>
	<description>Reserved. Always keep 0.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>CACHE_FLUSH</name>
	<description>Writing a '1' into this bit, flushes the contents of the tag memories which invalidates the content of the cache memory.
The read of this bit is always '0'.
Note: The flushing of the cache TAG memory takes 0x100 or 0x200 HCLK cycles for a Cache Data RAM size of 8 KB resp. 16 KB.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_CTRL2_REG</name>
	<description>Cache control register 2</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>ENABLE_ALSO_QSPIFLASH_CACHED</name>
	<description>Enable also the QSPI FLASH cacheability when remapped to OTP (cached).
See also the notes at "CACHE_LEN".</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>ENABLE_ALSO_OTP_CACHED</name>
	<description>Enable also the OTP cacheability when remapped to QSPI FLASH (cached).
See also the notes at "CACHE_LEN".</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>CACHE_CGEN</name>
	<description>0: Cache controller clock gating is not enabled.
1: Cache controller clock gating is enabled (enabling power saving).
Note: This bit must be set to '0' (default) when setting the CACHE_FLUSH bit while executing from other than QSPI FLASH cached or OTP cached, e.g. from Booter or SYSRAM.</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>CACHE_WEN</name>
	<description>0: Cache Data and TAG memory read only.
1: Cache Data and TAG memory read/write.
The TAG and Data memory are only updated by the cache controller.
There is no HW protection to prevent unauthorized access by the ARM.
Note: When accessing the memory mapped Cache Data and TAG memory (for debugging purposes) only 32 bits access is allowed to the Cache Data memory and only 16 bits access is allowed to the Cache TAG memory.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>CACHE_LEN</name>
	<description>Length of QSPI FLASH cacheable memory.
(N+1)*64kbyte. N=1 to 512 (Max of 32 Mbyte).
Setting CACHE_LEN=0 disables the cache.
Note 1: The OTP memory is completely cacheable (when enabled).
Note 2: The max. size/length of QSPI FLASH cacheable memory is 16 Mbyte when also OTP is cached.</description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_CTRL3_REG</name>
	<description>Cache control register 3 (for the Cache Controller configuration reset values)</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000022</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_CONTROLLER_RESET</name>
	<description>0: De-activate the Reset of the Cache Controller.
1: Reset the Cache Controller and take the new configuration reset values (when the reset is released again by changing this bit from '1' to '0').
Note: All CACHE_MRM_* registers are also reset.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>CACHE_RAM_SIZE_RESET_VALUE</name>
	<description>Cache DATA RAM size reset value:
0: reserved,
1: 8 KB,
2: 16 KB,
3-7: reserved.</description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>CACHE_LINE_SIZE_RESET_VALUE</name>
	<description>Cache line size reset value:
0: 8 bytes,
1: 16 bytes,
2: 32 bytes,
3: reserved.</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>CACHE_ASSOCIATIVITY_RESET_VALUE</name>
	<description>Cache associativity reset value:
0: 1-way (direct mapped)
1: 2-way
2: 4-way
3: reserved.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
