andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>CHIP_CONFIG2_REG</name>
	<description>Chip configuration register 2.</description>
	<addressOffset>0x00000006</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x0000004d</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>CHIP_CONFIG2</name>
	<description>Second character of Chip Configuration "0M2" in ASCII. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_CONFIG3_REG</name>
	<description>Chip configuration register 3.</description>
	<addressOffset>0x00000007</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000032</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>CHIP_CONFIG3</name>
	<description>Third character of Chip Configuration "0M2" in ASCII. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_ID1_REG</name>
	<description>Chip identification register 1.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000036</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>CHIP_ID1</name>
	<description>First character of device type "680" in ASCII. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_ID2_REG</name>
	<description>Chip identification register 2.</description>
	<addressOffset>0x00000001</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000038</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>CHIP_ID2</name>
	<description>Second character of device type "680" in ASCII. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_ID3_REG</name>
	<description>Chip identification register 3.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000030</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>CHIP_ID3</name>
	<description>Third character of device type "680" in ASCII. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_REVISION_REG</name>
	<description>Chip revision register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>REVISION_ID</name>
	<description>Chip version, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_SWC_REG</name>
	<description>Software compatibility register.</description>
	<addressOffset>0x00000003</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>CHIP_SWC</name>
	<description>SoftWare Compatibility code.
Integer (default = 0) which is incremented if a silicon change has impact on the CPU Firmware.
Can be used by software developers to write silicon revision dependent code. </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_TEST1_REG</name>
	<description>Chip test register 1.</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	</fields>
</register><register>
	<name>CHIP_TEST2_REG</name>
	<description>Chip test register 2.</description>
	<addressOffset>0x0000000b</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000021</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	</fields>
</register><register>
	<name>CHIP_TEST3_REG</name>
	<description>Chip test register 3.</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	</fields>
</register></registers>
</peripheral><peripheral>
	<name>COEX</name>
	<version>1.0</version>
	<description>COEX registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002f00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>48</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>COEX_BLE_PTI_REG</name>
	<description>COEX BLE PTI Control Register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_BLE_PTI</name>
	<description>This value specifies the PTI value that characterizes the next BLE transaction that will be initiated on the following "ble_active" positive edge. The value should remain constant during the high period of the "ble_active" signal.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_CTRL_REG</name>
	<description>COEX Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IGNORE_BLE</name>
	<description>If set to "1" then all BLE requests are ignored by masking the internal "ble_active" signal. Refer also to IGNORE_BLE_STAT.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>IGNORE_FTDF</name>
	<description>If set to "1" then all FTDF requests are ignored by masking the internal "ftdf_active" signal. Refer also to IGNORE_FTDF_STAT.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>IGNORE_EXT</name>
	<description>If set to "1" then all EXT requests are ignored by masking the internal "ext_act" signal ("ext_act" is the logical OR of "ext_act0" and "ext_act1"). Refer also to IGNORE_EXT_STAT.</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>SEL_BLE_RADIO_BUSY</name>
	<description>Select the logic driving the BLE core input "ble.radio_busy":
0: (decision==BLE) AND rfcu.radio_busy.
1: Hold to "0".
2: (decision==FTDF) OR (decision==EXT) OR rfcu.radio_busy.
3: (decision==FTDF) OR (decision==EXT).
Selection "0" is the default, while selection "2" is the recommended value if the BLE SW supports it.</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>SEL_BLE_WLAN_TX_RX</name>
	<description>If set to "1" then the COEX block will drive the WLAN_TX and WLAN_RX inputs of the BLE core. Otherwise both BLE inputs will be forced to "0".</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SEL_BLE_PTI</name>
	<description>It controls the source of the BLE PTI value that the COEX Arbiter will use.
If "0" then use the COEX_BLE_PTI_REG.
If "1" then use the PTI value provided by the BLE core.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SEL_FTDF_PTI</name>
	<description>It controls the source of the FTDF PTI value that the COEX Arbiter will use.
If "0" then use the COEX_FTDF_PTI_REG.
If "1" then use the PTI value provided by the FTDF core.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SEL_FTDF_CCA</name>
	<description>If set to "1" and the COEX decision is different than "FTDF", then the CCA_STAT signal going to FTDF (generated from the radio) will be forced to "1"; otherwise the FTDF.CCA_STAT will be driven with the signal generated from the radio.
Recommended value for SEL_FTDF_CCA is "1".</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SEL_COEX_DIAG</name>
	<description>The COEX block can provide internal diagnostic signals by overwriting the BLE diagnostic bus, which is forwarded to GPIO multiplexing. There is no need to program the BLE registers, but only this field and the GPIO PID fields.
0: No COEX diagnostics, only BLE.
1: BLE_DIAG[4:3]=decision[1:0]; BLE_DIAG[5]=closing.
2: BLE_DIAG[4:3]=decision[1:0]; BLE_DIAG[5]=closing; BLE_DIAG[6]=OR( ftdf/ble2coex_tx/rx_en )
3: BLE_DIAG[2]=closing OR radio_busy; BLE_DIAG[6:3]=decision_ptr[3:0]; BLE_DIAG[7]=0.</description>
	<access>read-write</access>
	<bitRange>[6:5]</bitRange>
	
</field><field>
	<name>SMART_ACT_IMPL</name>
	<description>Controls the behavior of the SMART_ACT (and SMART_PRI as a consequence).
If SMART_ACT_IMPL="0" then if any BLE or FTDF MAC request is active then SMART_ACT will be asserted. SMART_ACT will actually be the logical OR of "ble_active" and "ftdf_active" internal signals. SMART_ACT will be asserted regardless the decision of the Arbiter to allow or disallow the access to the on-chip radio from the active MAC(s).
if SMART_ACT_IMPL="1" then if the Arbiter's decision is to allow EXTernal MAC, then keep SMART_ACT to "0", otherwise follow the implementation of SMART_ACT_IMPL="0".</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TXRX_MON_BLE_ALL</name>
	<description>It controls the behavior of the Monitoring bitfields COEX_INT_STAT_REG[ *TXRX_MON* ]
If "0" then update the Monitoring bitfields with BLE Rx/Tx that has been masked.
If "1" then update for every BLE Rx/Tx, either masked or not.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>TXRX_MON_FTDF_ALL</name>
	<description>It controls the behavior of the Monitoring bitfields COEX_INT_STAT_REG[ *TXRX_MON* ]
If "0" then update the Monitoring bitfields with FTDF Rx/Tx that has been masked.
If "1" then update for every FTDF Rx/Tx, either masked or not.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DECISION_SW_ALL</name>
	<description>Refer to COEX_INT_STAT_REG[ IRQ_DECISION_SW ] bitfield description.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PRGING_ARBITER</name>
	<description>If set to "1" then the current transaction (Tx or Rx) will complete normally and after that no further decision will be taken by the arbiter. Will be set to "1" automatically by the HW as soon as a write operation will be detected to the COEX_PRIx_REG registers. As soon as the update on the priorities will be completed, the SW should clear this bit. The SW can set or clear this bit.
Note: Depending on the relationship between the PCLK and COEX_CLK periods a write operation to this bitfield may be effective in more than one PCLK clock cycles.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
