andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>COEX_FTDF_PTI_REG</name>
	<description>COEX FTDF PTI Control Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_FTDF_PTI</name>
	<description>This value specifies the PTI value that characterizes the next FTDF transaction that will be initiated on the following "ftdf_active" positive edge. The value should remain constant during the high period of the "ftdf_active" signal. Refer also to bitfield COEX_CTRL_REG.SEL_FTDF_PTI.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_INT_MASK_REG</name>
	<description>COEX Interrupt Mask Register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IRQ_DECISION_SW</name>
	<description>If "1" then a "1" on COEX_INT_STAT_REG[IRQ_DECISION_SW] will generate an IRQ to CPU.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>IRQ_TXRX_MON</name>
	<description>If "1" then a "1" on COEX_INT_STAT_REG[IRQ_TXRX_MON] will generate an IRQ to CPU.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_INT_STAT_REG</name>
	<description>COEX Interrupt Status Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IRQ_DECISION_SW</name>
	<description>IRQ event when the DECISION switches to another value.
If DECISION_SW_ALL=1, then it reports any change of DECISION value.
If DECISION_SW_ALL=0, then it reports only the switches to another MAC, ignoring also the intermediate transitions to DECISION==NONE.
For example the sequence FTDF-NONE-FTDF-NONE-BLE-NONE-BLE will report only the first switch from NONE to BLE.
Note that after a Radio Power domain reset, the first transition of the DECISION to any non-NONE value will also trigger this event.</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>IRQ_TXRX_MON</name>
	<description>Tx/Rx Monitor event pending. When this bitfield is set, then there is a valid entry at the bitfields TXRX_MON_PTR, TXRX_MON_TX, TXRX_MON_PASSED and TXRX_MON_OVWR. </description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TXRX_MON_OVWR</name>
	<description>Tx/Rx Monitor entry Overwritten.
if "1" then TXRX_MON_PTR loaded a new value without being cleared first by the software. Provides an indication that the software does not fetch the TXRX_MON_PTR fast enough.</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TXRX_MON_PASSED</name>
	<description>This bit indicates if the corresponding TXRX_MON_PTR pointer indicates a Tx/Rx that has been masked or not by the COEX block.
If "0" then the Tx/Rx has been masked.
If "1" then the Tx/Rx has not been masked.
The bitfield is valid only when TXRX_MON_PTR is not zero.</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TXRX_MON_TX</name>
	<description>If "0" then the corresponding TXRX_MON_PTR corresponds to an Rx.
If "1" then the corresponding TXRX_MON_PTR corresponds to an Tx.
The bitfield is valid only when TXRX_MON_PTR is not zero.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TXRX_MON_PTR</name>
	<description>Tx/Rx Monitor Pointer.
If not zero then it provides a pointer to the Priority registers indicating the completion of an Tx or Rx (deassertion of TX_EN or RX_EN) that corresponds to this Priority register. Refer also to the COEX_CTRL_REG[ TXRX_MON_ALL ] control bit.
If the PTI that corresponds to the deasserted TX_EN/RX_EN is not in the Priority Register list, then this event will be ignored and will not be reported by the TXRX Monitoring bitfields.
Reading the register will clear the bitfield.</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI10_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI11_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI12_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
