andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>COEX_PRI13_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI14_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI15_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI1_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000018</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Specifies the MAC that has been assigned with the specific priority level. The MAC encoding follows the COEX_DECISION bitfield encoding.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>The priority level specified by the name of this register will be applied to the packets coming from the MAC specified by the COEX_PRI_MAC bitfield and characterized with the PTI value specified by the COEX_PRI_PTI bitfield.
The effective PTI value of the packets coming from BLE and FTDF is controlled by the register bitfields SEL_BLE_PTI and SEL_FTDF_PTI, while for the External MAC (EXT) the PTI is considered always as "0".</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI2_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI3_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI4_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI5_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI6_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI7_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
