andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>COEX_PRI8_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_PRI9_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_STAT2_REG</name>
	<description>COEX Status 2 Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COEX_EXT_ACT</name>
	<description>The internal EXT_ACT used for the decision taking. </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>COEX_BLE_PTI_INT</name>
	<description>The BLE PTI value that is used for decision taking.</description>
	<access>read-only</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>COEX_BLE_TX_EN</name>
	<description>The current value of BLE TX_EN.</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>COEX_BLE_RX_EN</name>
	<description>The current value of BLE RX_EN.</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>COEX_BLE_ACTIVE</name>
	<description>The internal BLE_ACTIVE signal used for decision taking.</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>COEX_FTDF_PTI_INT</name>
	<description>The FTDF PTI value that is used for decision taking.
Value depends on COEX_CTRL_REG.SEL_FTDF_PTI.</description>
	<access>read-only</access>
	<bitRange>[8:6]</bitRange>
	
</field><field>
	<name>COEX_FTDF_TX_EN</name>
	<description>The current value of FTDF TX_EN.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>COEX_FTDF_RX_EN</name>
	<description>The current value of FTDF RX_EN.</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>COEX_FTDF_ACTIVE</name>
	<description>The internal FTDF_ACTIVE signal used for the decision taking.</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>COEX_DECISION_WITH_CLOSING</name>
	<description>DECISION (bits [1:0]) appended the CLOSING (bit [2]) state.</description>
	<access>read-only</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEX_STAT_REG</name>
	<description>COEX Status Register</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IGNORE_BLE_STAT</name>
	<description>This signal is constantly "1" on FTDF-only chips.
If set to "1" then all BLE requests are ignored by masking immediately the request signal from the BLE.
In more detail, the internal signal "ble_active" is the logical AND of this bitfield and the "ble.event_in_process".</description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>IGNORE_FTDF_STAT</name>
	<description>This signal is constantly "1" on BLE-only chips.
If set to "1" then all FTDF requests are ignored by masking immediately the request signal from the FTDF.
In more detail, the internal signal "ftdf_active" is the logical AND of this bitfield and the "ftdf.phy_en".</description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>IGNORE_EXT_STAT</name>
	<description>If set to "1" then all EXT requests are ignored by masking immediately the request signal from the external MAC.
In more detail, the internal signal "ext_active" is the logical AND of this bitfield and the "ext_act".</description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>COEX_RADIO_BUSY</name>
	<description>Current state of RADIO_BUSY signal generated from RFCU, which is the logical OR among all Radio DCFs.
Note that the arbiter will process this value with one COEX clock cycle delay.</description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>EXT_ACT1</name>
	<description>Current state of the pin.</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>EXT_ACT0</name>
	<description>Current state of the pin.</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SMART_PRI</name>
	<description>Current state of the pin.</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SMART_ACT</name>
	<description>Current state of the pin.</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>COEX_CLOSING</name>
	<description>Provides the value of the "CLOSING" substate.</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>COEX_DECISION</name>
	<description>Decision values:
0: Decision is NONE.
1: Decision is BLE.
2: Decision is FTDF.
3: Decision is EXT.
Note: If "0" (i.e. decision is NONE) then no MAC will have access to the on-chip radio. As a consequence, the SMART_PRI signal will stay low, since no on-chip (SMART) MAC will have priority.
Note: While in programming mode, the COEX_PRIx_REGs are considered as invalid, which means that no new decision can be taken.
Note: The decision NONE will be held as long as there is no "*_active" internal signal from BLE, FTDF or EXT. Also, if in programming state and the last transaction has been finished, then the decision will be held also to NONE.</description>
	<access>read-only</access>
	<bitRange>[6:5]</bitRange>
	
</field><field>
	<name>COEX_DECISION_PTR</name>
	<description>Provides the number "x" of the COEX_PRIx_REG that win the last arbitration cycle. If "0" then it is a null pointer, pointing to no COEX_PRIx_REG.</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
