andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_TOP</name>
	<version>1.0</version>
	<description>CRG_TOP registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>108</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>ANA_STATUS_REG</name>
	<description>status bit of analog (power management) circuits</description>
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000090</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>COMP_1V8_PA_HIGH</name>
	<description>VDD1V8P &gt; 1.7V </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>COMP_1V8_FLASH_HIGH</name>
	<description>VDD1V8 &gt; 1.7V</description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>COMP_V33_HIGH</name>
	<description>V33 &gt; 1.7V</description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>COMP_VBUS_LOW</name>
	<description>VBUS &gt; 3.4V</description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>COMP_VBUS_HIGH</name>
	<description>VBUS &gt; 4V</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>LDO_1V8_FLASH_OK</name>
	<description>ldo_vdd1v8 = ok</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>LDO_1V8_PA_OK</name>
	<description>ldo_vdd1v8P = ok</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>LDO_CORE_OK</name>
	<description>ldo_core = ok</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>COMP_VDD_HIGH</name>
	<description>VDD &gt; 1.13V</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>BANDGAP_OK</name>
	<description>bandgap = ok
</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>LDO_SUPPLY_USB_OK</name>
	<description>ldo_supply_usb = ok</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LDO_SUPPLY_VBAT_OK</name>
	<description>ldo_supply_vbat =ok</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>NEWBAT</name>
	<description>new battery has been detected</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>VBUS_AVAILABLE</name>
	<description>vbus is available (vbus &gt; vbat)</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>COMP_VBAT_OK</name>
	<description>vbat &gt; 1.7V</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LDO_RADIO_OK</name>
	<description>ldo_radio = ok</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>AON_SPARE_REG</name>
	<description>Spare register</description>
	<addressOffset>0x00000064</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>EN_BUSSYS_RET</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>EN_BATSYS_RET</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>OSC16_SH_DISABLE</name>
	<description>bias in tracking mode</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>OSC16_HOLD_AMP_REG</name>
	<description>freezes amplitude regulation</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BANDGAP_REG</name>
	<description>bandgap trimming</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LDO_SUPPLY_USE_BGREF</name>
	<description>0x0 -&gt; LDO_SUPPLY_(VBAT/USB) uses V12 voltage/(V12/2Mohm) current as reference
0x1 -&gt; LDO_SUPPLY_(VBAT/USB) uses bandgap voltage/bandgap current (1uA) as reference -&gt; set 0x1 in (booter-)software
Switch to 0x1 at start of user application when maximum BOD functionality is switched on.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>LDO_SLEEP_TRIM</name>
	<description>0x4 --&gt; 1120 mV
0x5 --&gt; 1089 mV
0x6 --&gt; 1058 mV
0x7 --&gt; 1030 mV
0x0 --&gt; 1037 mV
0x1 --&gt; 1005 mV
0x2 --&gt; 978 mV
0x3 --&gt; 946 mV
0x8 --&gt; 952 mV
0x9 --&gt; 918 mV
0xA --&gt; 889 mV
0xB --&gt; 861 mV
0xC --&gt; 862 mV
0xD --&gt; 828 mV
0xE --&gt; 798 mV
0xF --&gt; 770 mV
These values are from simulation and vary over corners</description>
	<access>read-write</access>
	<bitRange>[13:10]</bitRange>
	
</field><field>
	<name>BGR_ITRIM</name>
	<description>Current trimming for bias </description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>BGR_TRIM</name>
	<description>Trim register for bandgap </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BOD_CTRL2_REG</name>
	<description>Brown Out Detection control register</description>
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>BOD_V14_EN</name>
	<description>V14 BOD Enable</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>BOD_VBAT_EN</name>
	<description>VBAT BOD Enable</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>BOD_1V8_FLASH_EN</name>
	<description>1V8 Flash BOD Enable</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>BOD_1V8_PA_EN</name>
	<description>1V8 PA BOD Enable</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>BOD_V33_EN</name>
	<description>V33 BOD Enable</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>BOD_VDD_EN</name>
	<description>VDD BOD Enable</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>BOD_RESET_EN</name>
	<description>Generate a chip reset on BOD event</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
