andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>BOD_CTRL_REG</name>
	<description>Brown Out Detection control register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000007aa</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>BOD_VDD_LVL</name>
	<description>VDD BOD Level; 0=700mV; 1=700mV; 3=800mV; 7=1.05V</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>BOD_V33_TRIM</name>
	<description>V33 BOD Trimming bits</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>BOD_1V4_TRIM</name>
	<description>1V4 BOD Trimming bits</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>BOD_1V8_TRIM</name>
	<description>1V8 PA &amp; Flash BOD Trimming bits</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>BOD_VDD_TRIM</name>
	<description>VDD BOD Trimming bits</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BOD_STATUS_REG</name>
	<description>Brown Out Detection status register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>BOD_V14_LOW</name>
	<description>Indicates V14 &gt; V14_Trigger</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>BOD_VBAT_LOW</name>
	<description>Indicates VBAT &gt; VBAT_Trigger</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>BOD_V33_LOW</name>
	<description>Indicates V33 &gt; V33_Trigger</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>BOD_1V8_FLASH_LOW</name>
	<description>Indicates V18_Flash &gt; V18_Flash_Trigger</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>BOD_1V8_PA_LOW</name>
	<description>Indicates V18_PA &gt; V18_PA_Trigger</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>BOD_VDD_LOW</name>
	<description>Indicates VDD &gt; VDD_Trigger</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_16M_REG</name>
	<description>16 MHz RC and xtal oscillator register</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000054a0</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RC16M_STARTUP_DISABLE</name>
	<description>Gates the RC16M enable from the startup block.
The enable from the clksel and CLK_16M_REG[0] are not gated by this bit.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>XTAL16_HPASS_FLT_EN</name>
	<description>enables high pass filter
</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>XTAL16_SPIKE_FLT_BYPASS</name>
	<description>bypasses spikefilter</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>XTAL16_AMP_TRIM</name>
	<description>sets xtal amplitude, 0 is minimum, 101 is maximum</description>
	<access>read-write</access>
	<bitRange>[12:10]</bitRange>
	
</field><field>
	<name>XTAL16_EXT_CLK_ENABLE</name>
	<description>Uses the signal on the xtal-p pin as the clock, the xtal-n pin can float. </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>XTAL16_MAX_CURRENT</name>
	<description>Uses the maximum current, for testing purpose only.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>XTAL16_CUR_SET</name>
	<description>start-up current for the 16MHz XTAL oscillator. 000 is minimum, 110 is maximum. </description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>RC16M_TRIM</name>
	<description>0000 = lowest frequency
1111 = highest frequency </description>
	<access>read-write</access>
	<bitRange>[4:1]</bitRange>
	
</field><field>
	<name>RC16M_ENABLE</name>
	<description>Enables the 16MHz RC oscillator </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_32K_REG</name>
	<description>32 kHz oscillator register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000007ae</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>XTAL32K_XTAL1_BIAS_DISABLE</name>
	<description>Disables the 1nA bias current through the pull down diode</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>XTAL32K_DISABLE_AMPREG</name>
	<description>Setting this bit disables the amplitude regulation of the XTAL32kHz oscillator.
Set this bit to '1' for an external clock to XTAL32Kp
Keep this bit '0' with a crystal between XTAL32Kp and XTAL32Km</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>RC32K_TRIM</name>
	<description>0000 = lowest frequency
0111 = default
1111 = highest frequency </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>RC32K_ENABLE</name>
	<description>Enables the 32kHz RC oscillator </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>XTAL32K_CUR</name>
	<description>Bias current for the 32kHz XTAL oscillator. 0000 is minimum, 1111 is maximum, 0011 is default. For each application there is an optimal setting for which the start-up behavior is optimal </description>
	<access>read-write</access>
	<bitRange>[6:3]</bitRange>
	
</field><field>
	<name>XTAL32K_RBIAS</name>
	<description>Setting for the bias resistor. 00 is maximum, 11 is minimum. Prefered setting will be provided by Dialog </description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>XTAL32K_ENABLE</name>
	<description>Enables the 32kHz XTAL oscillator </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
