andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>CLK_AMBA_REG</name>
	<description>HCLK, PCLK, divider and clock gates</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000022</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>QSPI_ENABLE</name>
	<description>Clock enable for QSPI controller </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>QSPI_DIV</name>
	<description>QSPI divider
00 = divide by 1
01 = divide by 2
10 = divide by 4
11 = divide by 8</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>OTP_ENABLE</name>
	<description>Clock enable for OTP controller </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TRNG_CLK_ENABLE</name>
	<description>Clock enable for TRNG block </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ECC_CLK_ENABLE</name>
	<description>Clock enable for ECC block </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>AES_CLK_ENABLE</name>
	<description>Clock enable for AES crypto block </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>PCLK_DIV</name>
	<description>APB interface clock, Cascaded with HCLK:
00 = divide hclk by 1
01 = divide hclk by 2
10 = divide hclk by 4
11 = divide hclk by 8 </description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>HCLK_DIV</name>
	<description>AHB interface and microprocessor clock. Source clock divided by:
000 = divide hclk by 1
001 = divide hclk by 2
010 = divide hclk by 4
011 = divide hclk by 8
1xx = divide hclk by 16</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_CTRL_REG</name>
	<description>Clock control register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RUNNING_AT_PLL96M</name>
	<description>Indicates that the PLL96MHz clock is used as clock, and may not be switched off </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>RUNNING_AT_XTAL16M</name>
	<description>Indicates that the XTAL16M clock is used as clock, and may not be switched off </description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>RUNNING_AT_RC16M</name>
	<description>Indicates that the RC16M clock is used as clock </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>RUNNING_AT_32K</name>
	<description>Indicates that either the RC32k or XTAL32k is being used as clock </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>DIVN_SHIFT_SEL</name>
	<description>In 32MHz mode, select the clock to be in or out of phase w.r.t. RF clock.
0 : 180 degrees shifted
1 : 0 degrees shifted</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>CLK32K_SOURCE</name>
	<description>Sets the clock source of the LowerPower clock
'00': 32 Khz RC Oscillator
'01': RCX Oscillator
'10': XTAL32kHz, when using an external crystal i.c.w. the internal oscillator (set P20 and P21 to FUNC_XTAL32)
'11': XTAL32kHz, when an external generator or MCU applies a square wave on P20 (set P20 to FUNC_GPIO)</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>DIVN_SYNC_LEVEL</name>
	<description>Level of the RF divider to sync with in case XTAL32_MODE is set.
This is used to align the internal DIVN clock XTAL@32MHz divided by 2 with the radio clock</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DIVN_XTAL32M_MODE</name>
	<description>Enables the DIVN divide-by-2, in case of a 32 MHz crystal (See also XTAL32M_MODE), to keep the DIVN clock at 16 MHz.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>PLL_DIV2</name>
	<description>Divides the PLL clock by 2 before being used</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>USB_CLK_SRC</name>
	<description>Selects the USB source clock
0 : PLL clock, divided by 2
1 : HCLK</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>XTAL32M_MODE</name>
	<description>Enables dividers in the XTAL for both the RF and the BB PLL.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>XTAL16M_DISABLE</name>
	<description>Setting this bit instantaneously disables the 16 MHz crystal oscillator. This bit may not be set to '1' when "RUNNING_AT_XTAL16M is '1' to prevent deadlock. After resetting this bit, wait for XTAL16_TRIM_READY to become '1' before switching to XTAL16 clock source. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SYS_CLK_SEL</name>
	<description>Selects the clock source.
0x0 : XTAL16M (check the XTAL16_TRIM_READY bit!!)
0x1 : RC16M
0x2 : The Low Power clock is used
0x3 : The PLL96Mhz is used</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_FREQ_TRIM_REG</name>
	<description>Xtal frequency trimming register.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>COARSE_ADJ</name>
	<description>Xtal frequency course trimming register.
0x0 = lowest frequency
0x7 = highest frequencyIncrement or decrement the binary value with 1. Wait approximately 200usec to allow the adjustment to settle. </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>FINE_ADJ</name>
	<description>Xtal frequency fine trimming register.0x00 = lowest frequency
0xFF = highest frequency </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
