andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FORCE_SLEEP_REG</name>
	<description>Force FTDF/BLE to sleep</description>
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>FORCE_BLE_SLEEP</name>
	<description>Once set, the BLE can't be woken up
This bit is set only, and reset with HW reset</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>FORCE_FTDF_SLEEP</name>
	<description>Once set, the FTDF can't be woken up
This bit is set only, and reset with HW reset</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LDOS_DISABLE_REG</name>
	<description>Force off all LDOs</description>
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>LDOS_DISABLE</name>
	<description>If set to '1', the following LDOS are disabled:
LDO_SUPPLY_VBAT (V33)
LDO_SUPPLY_VBUS (V33)
LDO_VBAT_RET (V33)
LDO_1V8_PA
LDO_1V8_PA_RET
LDO_1V8_FLASH
LDO_1V8_FLASH_RET
LDO_CORE (VDD1V2)
</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LDO_CTRL1_REG</name>
	<description>LDO control register</description>
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000057</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>LDO_RADIO_ENABLE</name>
	<description>Enables (1) or disables (0) LDO_RADIO
For fast XTAL startup, this bit may be kept to '1' during deep sleep. The LDO is switched off automatically when in deep sleep, and enabled when waking up.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>LDO_RADIO_SETVDD</name>
	<description>Sets the output voltage of LDO_RADIO
000 = 1.30 V
001 = 1.35 V
010 = 1.40 V
011 = 1.45 V
1XX = 1.50 V</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>LDO_CORE_SETVDD</name>
	<description>Sets the output voltage of LDO_CORE
000 = 1.20 V
001 = 1.15 V
010 = 1.10 V
011 = 1.05 V
1XX = 1.32 V</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>LDO_SUPPLY_USB_LEVEL</name>
	<description>Sets the output voltage of LDO_SUPPLY_USB
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.60 V</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>LDO_SUPPLY_VBAT_LEVEL</name>
	<description>Sets the output voltage of LDO_SUPPLY_VBAT
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.60 V</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>LDO_VBAT_RET_LEVEL</name>
	<description>Sets the output voltage of LDO_VBAT_RET
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.60 V</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>LDO_CORE_CURLIM</name>
	<description>Sets the current limit of LDO_CORE
00 = Current limiter disabled
01 = 8 mA
10 = 60 mA
11 = 80 mA</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LDO_CTRL2_REG</name>
	<description>LDO control register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>LDO_1V8_PA_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_1V8_PA_RET</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>LDO_1V8_FLASH_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_1V8_FLASH_RET</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LDO_VBAT_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_VBAT_RET</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LDO_1V8_PA_ON</name>
	<description>Enables (1) or disables (0) LDO_1V8_PA</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LDO_1V8_FLASH_ON</name>
	<description>Enables (1) or disables (0) LDO_1V8_FLASH</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LDO_3V3_ON</name>
	<description>Enables (1) or disables (0) LDO_SUPPLY_VBAT and LDO_SUPPLY_USB</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LDO_1V2_ON</name>
	<description>Enables (1) or disables (0) LDO_CORE</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LDO_CTRL3_REG</name>
	<description>Retention LDO control register</description>
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>LDO_1V8_PA_RET_VREF_HOLD</name>
	<description>Setting of this register is "ORed" with the vref_hold
control from the CRG StateMachine.
"0" = CRG controls the T&amp;H of Vref.
"1" = T&amp;H is always in "Hold"</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LDO_1V8_PA_RET_ENABLE</name>
	<description>Setting of this register is "ORed" with the ldo_enable
control from the CRG StateMachine.
"0" = CRG controls the enable of the LDO.
"1" = LDO is always enabled
To activate a retention LDO in "active-mode", this bit
must be "1" and the VREF_HOLD bit must be "0".</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LDO_1V8_FLASH_RET_VREF_HOLD</name>
	<description>Setting of this register is "ORed" with the vref_hold
control from the CRG StateMachine.
"0" = CRG controls the T&amp;H of Vref.
"1" = T&amp;H is always in "Hold"</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LDO_1V8_FLASH_RET_ENABLE</name>
	<description>Setting of this register is "ORed" with the ldo_enable
control from the CRG StateMachine.
"0" = CRG controls the enable of the LDO.
"1" = LDO is always enabled
To activate a retention LDO in "active-mode", this bit
must be "1" and the VREF_HOLD bit must be "0".</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LDO_VBAT_RET_VREF_HOLD</name>
	<description>Setting of this register is "ORed" with the vref_hold
control from the CRG StateMachine.
"0" = CRG controls the T&amp;H of Vref.
"1" = T&amp;H is always in "Hold"</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LDO_VBAT_RET_ENABLE</name>
	<description>Setting of this register is "ORed" with the ldo_enable
control from the CRG StateMachine.
"0" = CRG controls the enable of the LDO.
"1" = LDO is always enabled
To activate a retention LDO in "active-mode", this bit
must be "1" and the VREF_HOLD bit must be "0".</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
