andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>PMU_CTRL_REG</name>
	<description>Power Management Unit control register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RETAIN_ECCRAM</name>
	<description>Selects the retainability of the ECC u-Code RAM during deep sleep.
'1' is retainable, '0' is power gated</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>RETAIN_CACHE</name>
	<description>Selects the retainability of the cache block during deep sleep.
'1' is retainable, '0' is power gated</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>ENABLE_CLKLESS</name>
	<description>Selects the clockless sleep mode. Wakeup is done asynchronously.
When set to '1', the lp_clk is stopped during deep sleep, until a wakeup event (not debounced) is detected by the WAKUPCT block.
When set to '0', the lp_clk continues running, so the MAC counters keep on running.
This mode cannot be combined with regulated sleep, so keep SLEEP_TIMER=0 when using ENABLE_CLKLESS.</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>RETAIN_RAM</name>
	<description>Select the retainability of the 5 system memory RAM macros during deep sleep.
'1' is retainable, '0' is power gated
(4) is SYSRAM5
(3) is SYSRAM4
(2) is SYSRAM3
(1) is SYSRAM2
(0) is SYSRAM1</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	
</field><field>
	<name>OTP_COPY_DIV</name>
	<description>Sets the HCLK division during OTP mirroring </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>RESET_ON_WAKEUP</name>
	<description>Perform a Hardware Reset after waking up. Booter will be started. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>MAP_BANDGAP_EN</name>
	<description>Maps the bandgap_enable to P06 </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FTDF_SLEEP</name>
	<description>Put the FTDF in powerdown </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>BLE_SLEEP</name>
	<description>Put the BLE in powerdown.
When the BLE system clock is disabled, either due to the CLK_RADIO_REG[BLE_ENABLE] or due to the PMU_CTRL_REG[BLE_SLEEP], then any access to the BLE Register file will issue a hard fault to the CPU.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RADIO_SLEEP</name>
	<description>Put the digital part of the radio in powerdown </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PERIPH_SLEEP</name>
	<description>Put all peripherals (I2C, UART, SPI, ADC) in powerdown </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PMU_RESET_RAIL_REG</name>
	<description>Controls rail resetting when RST is pulsed</description>
	<addressOffset>0x00000068</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>RESET_V18P</name>
	<description>1: Enables discharging of the V18P rail when HW reset is pressed
0: this rail will not be discharged when HW reset is pressed
</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RESET_V18</name>
	<description>1: Enables discharging of the V18 rail when HW reset is pressed
0: this rail will not be discharged when HW reset is pressed
</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RESET_V14</name>
	<description>1: Enables discharging of the V14 rail when HW reset is pressed
0: this rail will not be discharged when HW reset is pressed</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>POR_VBAT_CTRL_REG</name>
	<description>Controls the POR on VBAT</description>
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000326f</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>POR_VBAT_MASK_N</name>
	<description>Enables propagation of the generated POR</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>POR_VBAT_ENABLE</name>
	<description>Enables generation of the POR</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>POR_VBAT_HYST_LOW</name>
	<description>Controls hysteresis of POR. 20mV per step. Must be set to 0x2 when thres_ctrl_low is set to 0xf.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>POR_VBAT_THRES_HIGH</name>
	<description>High-side (PTAT) threshold contribution:
Level --&gt; Threshold
0x0 --&gt; 1.25V
0x1 --&gt; 1.27V
0x2 --&gt; 1.29V
0x3 --&gt; 1.31V
0x4 --&gt; 1.44V
0x5 --&gt; 1.49V
0x6 --&gt; 1.53V
0x7 --&gt; 1.58V
0x8 --&gt; 1.63V
0x9 --&gt; 1.68V
0xA --&gt; 1.73V
0xB --&gt; 1.78V0xC --&gt; 1.83V0xD --&gt; 1.87V0xE --&gt; 1.92V
0xF --&gt; 1.97V
</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>POR_VBAT_THRES_LOW</name>
	<description>Low-side (CTAT) threshold contribution
Level --&gt; Threshold
0xC --&gt; 1.25V
0xC --&gt; 1.27V
0xC --&gt; 1.29V
0xC --&gt; 1.31V
0x0 --&gt; 1.44V
0x1 --&gt; 1.49V
0x2 --&gt; 1.53V
0x3 --&gt; 1.58V
0x4 --&gt; 1.63V
0x5 --&gt; 1.68V
0x6 --&gt; 1.73V
0x7 --&gt; 1.78V
0x8 --&gt; 1.83V
0x9 --&gt; 1.87V
0xA --&gt; 1.92V
0xB --&gt; 1.97V
0xF --&gt; 1.63V; use only with POR_VBAT_THRES_LOW=0x6 and POR_VBAT_THRES_HYST=0x2</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>POWER_CTRL_REG</name>
	<description>Power control register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>TRIM_NEWBAT</name>
	
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
