andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RESET_STAT_REG</name>
	<description>Reset status register</description>
	<addressOffset>0x0000005e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000001f</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>SWD_HWRESET_STAT</name>
	<description>Indicates that a write to SWD_RESET_REG has happened. Note thatit is also set when a POReset has happened.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>WDOGRESET_STAT</name>
	<description>Indicates that a Watchdog has happened. Note that it is also set when a POReset has happened.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SWRESET_STAT</name>
	<description>Indicates that a SW Reset has happened</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>HWRESET_STAT</name>
	<description>Indicates that a HW Reset has happened</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PORESET_STAT</name>
	<description>Indicates that a PowerOn Reset has happened</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SECURE_BOOT_REG</name>
	<description>Controls secure booting</description>
	<addressOffset>0x00000066</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>FORCE_DEBUGGER_OFF</name>
	<description>Follows the respective OTP flag value. Is write-one-only and will be reset by POR only! Its value is updated by the BootROM code.
1: The system debugger SWD is totally disabled.
0: The system debugger is enabled with DEBUGGER_ENABLE</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SECURE_BOOT</name>
	<description>Follows the respective OTP flag value. Is write-one-only and will be reset by POR only! Its value is updated by the BootROM code.
1: system is a secure system supporting secure boot
0: system is not supporting secure boot
</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SLEEP_TIMER_REG</name>
	<description>Timer for regulated sleep</description>
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SLEEP_TIMER</name>
	<description>Defines the amount of ticks of the sleep clock between enabling the bandgap for re-charging the retention LDOs. This value depends on the load and should be calibrated on a per application basis.If set to 0, no recharging cycle will happen at all.
Keep this value to 0 (no recharging) when using the clockless sleep.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>STARTUP_STATUS_REG</name>
	<description>Startup timeout bits</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SU_BOD_STATUS</name>
	<description>0b011 brownout on V14
0b100 brownout on vdd
0b101 brownout on v18_flash
0b110 brownout on v18_pa
0b111 brownout on v33</description>
	<access>read-only</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>SU_LDO_1V8_FLASH_OK</name>
	
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>SU_COMP_1V8_FLASH_HIGH</name>
	
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>SU_COMP_1V8_PA_HIGH</name>
	
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SU_COMP_VBUS_LOW</name>
	
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SU_COMP_VBUS_HIGH</name>
	
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SU_COMP_V33_HIGH</name>
	
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SU_COMP_VDD_HIGH</name>
	
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SU_LDO_1V8_PA_OK</name>
	
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SU_LDO_CORE_OK</name>
	
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SU_LOD_SUPPLY_USB_OK</name>
	
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SU_LDO_SUPPLY_VBAT_OK</name>
	
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SU_NEWBAT</name>
	
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SU_BANDGAP_OK</name>
	
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SYS_CTRL_REG</name>
	<description>System Control register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SW_RESET</name>
	<description>Writing a '1' to this bit will generate a SW_RESET.</description>
	<access>write-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>REMAP_INTVECT</name>
	<description>0: normal operation
1: If ARM is in address range 0 to 0x1FF then the address is remapped to SYS-RAM 0x07FC.0000 to 0x07FC.01FF. This allows to put the interrupt vector table to be placed in RAM while executing from QSPI</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>OTP_COPY</name>
	<description>Enables OTP to SysRAM copy action after waking up PD_SYS </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>QSPI_INIT</name>
	<description>Enables QSPI initialization after wakeup</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>DEV_PHASE</name>
	<description>Sets the development phase mode, used in combination with OTP_COPY
No copy action to SysRAM is done when the system wakes up.
For emulating startup time, the OTP_COPY bit still needs to be set. </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>CACHERAM_MUX</name>
	<description>Controls accessiblity of Cache RAM:
0: the cache controller is bypassed, the cacheRAM is visible in the memory space next to the DataRAMs
1: the cache controller is enabled, the cacheRAM is not visible anymore in the memory space</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>TIMEOUT_DISABLE</name>
	<description>Disables timeout in Power statemachine. By default, the statemachine continues if after 2 ms the blocks are not started up. This can be read back from
ANA_STATUS_REG</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DRA_OFF</name>
	<description>Disables the DRA mode, and released the ARM reset</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DEBUGGER_ENABLE</name>
	<description>Enable the debugger. This bit is set by the booter according to the OTP header. If not set, the SWDIO and SW_CLK can be used as gpio ports. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>OTPC_RESET_REQ</name>
	<description>Reset request for the OTP controller. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>PAD_LATCH_EN</name>
	<description>Latches the control signals of the pads for state retention in powerdown mode.
0 = Control signals are retained
1 = Latch is transparant, pad can be recontrolled </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>REMAP_RAMS</name>
	<description>Defines the sequence of the 3 first DataRAMs in the memory space. DataRAM4, DataRAM5 and potentially CacheRAM, cannot not be reshuffled.
0x0: DataRAM1, DataRAM2, DataRAM3
0x1: DataRAM2, DataRAM1, DataRAM3
0x2: DataRAM3, DataRAM1, DataRAM2
0x3: DataRAM3, DataRAM2, DataRAM1</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>REMAP_ADR0</name>
	<description>Controls which memory is located at address 0x0000 for execution.
0x0: ROM
0x1: OTP
0x2: FLASH
0x3: RAMS (for the exact configuration see REMAP_RAMS)
0x4: FLASH un-cached (for verification only)
0x5: OTP un-cached (for verification only)
0x6: Cache Data RAM (CACHERAM_MUX=0, for testing purposes only)
Note 1: DWord (64 bits) access is not supported by the Cache Data RAM interface in mirrored mode (only 32, 16 and 8 bits).
Note 2: DMA access is not supported by the Cache Data RAM interface when REMAP_ADR0=0x6.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
