andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>XTAL16M_RAMP_REG</name>
	<description>Xtal frequency trimming register during ramping</description>
	<addressOffset>0x0000005a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000300</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>COARSE_ADJ</name>
	<description>Xtal frequency course trimming register.
0x0 = lowest frequency
0x7 = highest frequencyIncrement or decrement the binary value with 1. Wait approximately 200usec to allow the adjustment to settle. </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>FINE_ADJ</name>
	<description>Xtal frequency fine trimming register.0x00 = lowest frequency
0xFF = highest frequency </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTAL16M_START_REG</name>
	<description>Xtal frequency trimming register during startup</description>
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>COARSE_ADJ</name>
	<description>Xtal frequency course trimming register.
0x0 = lowest frequency
0x7 = highest frequencyIncrement or decrement the binary value with 1. Wait approximately 200usec to allow the adjustment to settle. </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>FINE_ADJ</name>
	<description>Xtal frequency fine trimming register.0x00 = lowest frequency
0xFF = highest frequency </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTAL16M_TRSTAT_REG</name>
	<description>Read back value of current XTAL trimming</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>XTAL16M_TRSTAT</name>
	<description>Read value of the current XTAL trimming</description>
	<access>read-only</access>
	<bitRange>[14:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTALRDY_CTRL_REG</name>
	<description>Control register for XTALRDY IRQ</description>
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>XTALRDY_CNT</name>
	<description>Number of LP cycles between the crystal is enabled, and the XTALRDY_IRQ is fired.
0x00: no interrupt
</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTALRDY_STAT_REG</name>
	<description>Difference between XTAL_OK and XTALRDY_IRQ in LP clock cycles</description>
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>XTALRDY_STAT</name>
	
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCDC</name>
	<version>1.0</version>
	<description>DCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000080</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>58</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>DCDC_CTRL_0_REG</name>
	<description>DCDC First Control Register</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002f24</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>DCDC_FAST_STARTUP</name>
	<description>Set current limit to maximum during initial startup</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCDC_BROWNOUT_LV_MODE</name>
	<description>Switches to low voltage settings when battery voltage drops below 2.5 V</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>DCDC_IDLE_CLK_DIV</name>
	<description>Idle Clock Divider
00 = 2
01 = 4
10 = 8
11 = 16</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>DCDC_PRIORITY</name>
	<description>Charge priority register (4x 2 bit ID)
Charge sequence is [1:0] &gt; [3:2] &gt; [5:4] &gt; [7:6]
ID[V14] = 00
ID[V18] = 01
ID[VDD] = 10
ID[V18P] = 11</description>
	<access>read-write</access>
	<bitRange>[10:3]</bitRange>
	
</field><field>
	<name>DCDC_FW_ENABLE</name>
	<description>Freewheel switch enable</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_MODE</name>
	<description>DCDC converter mode
00 = Disabled
01 = Active
10 = Sleep mode
11 = Disabled</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_CTRL_1_REG</name>
	<description>DCDC Second Control Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00005410</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_STARTUP_DELAY</name>
	<description>Delay between turning bias on and converter becoming active
0 - 31 us, 1 us step size</description>
	<access>read-write</access>
	<bitRange>[15:11]</bitRange>
	
</field><field>
	<name>DCDC_GLOBAL_MAX_IDLE_TIME</name>
	<description>Global maximum idle time
The current limit of any output that is idle for this long will be downramped faster than normal
0 - 7875 ns, 125 ns step size</description>
	<access>read-write</access>
	<bitRange>[10:5]</bitRange>
	
</field><field>
	<name>DCDC_TIMEOUT</name>
	<description>P and N switch timeout, if switch is closed longer than this a timeout is generated and the FSM is forced to the next state
Writing 0 disables timeout functionality
62.5 - 1937.5 ns, 62.5 ns step size</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
