andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>DCDC_STATUS_0_REG</name>
	<description>DCDC First Status Register</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_CHARGE_REG_3</name>
	<description>Charge register position 3</description>
	<access>read-only</access>
	<bitRange>[11:9]</bitRange>
	
</field><field>
	<name>DCDC_CHARGE_REG_2</name>
	<description>Charge register position 2</description>
	<access>read-only</access>
	<bitRange>[8:6]</bitRange>
	
</field><field>
	<name>DCDC_CHARGE_REG_1</name>
	<description>Charge register position 1</description>
	<access>read-only</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>DCDC_CHARGE_REG_0</name>
	<description>Charge register position 0</description>
	<access>read-only</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_STATUS_1_REG</name>
	<description>DCDC Second Status Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_AVAILABLE</name>
	<description>Indicates whether V18P is available
Requires that converter is enabled, output is enabled and V_OK and V_NOK have both occured</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DCDC_VDD_AVAILABLE</name>
	<description>Indicates whether VDD is available
Requires that converter is enabled, output is enabled and V_OK and V_NOK have both occured</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DCDC_V18_AVAILABLE</name>
	<description>Indicates whether V18 is available
Requires that converter is enabled, output is enabled and V_OK and V_NOK have both occured</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DCDC_V14_AVAILABLE</name>
	<description>Indicates whether V14 is available
Requires that converter is enabled, output is enabled and V_OK and V_NOK have both occured</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DCDC_V18P_OK</name>
	<description>OK output of V18P comparator</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DCDC_VDD_OK</name>
	<description>OK output of VDD comparator</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DCDC_V18_OK</name>
	<description>OK output of V18 comparator</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DCDC_V14_OK</name>
	<description>OK output of V14 comparator</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DCDC_V18P_NOK</name>
	<description>NOK output of V18P comparator</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DCDC_VDD_NOK</name>
	<description>NOK output of VDD comparator</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_V18_NOK</name>
	<description>NOK output of V18 comparator</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_V14_NOK</name>
	<description>NOK output of V14 comparator</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_STATUS_2_REG</name>
	<description>DCDC Third Status Register</description>
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_SW_STATE</name>
	<description>DCDC state machine V18P output</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DCDC_VDD_SW_STATE</name>
	<description>DCDC state machine VDD output</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DCDC_V18_SW_STATE</name>
	<description>DCDC state machine V18 output</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DCDC_V14_SW_STATE</name>
	<description>DCDC state machine V14 output</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DCDC_NSW_STATE</name>
	<description>DCDC state machine NSW output</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DCDC_PSW_STATE</name>
	<description>DCDC state machine PSW output</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DCDC_P_COMP_P</name>
	<description>DCDC P side dynamic comparator P output</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DCDC_P_COMP_N</name>
	<description>DCDC P side dynamic comparator N output</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP_P</name>
	<description>DCDC N side dynamic comparator P output</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP_N</name>
	<description>DCDC N side dynamic comparator N output</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_P_COMP</name>
	<description>DCDC P side continuous time comparator output</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP</name>
	<description>DCDC N side continuous time comparator output</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_STATUS_3_REG</name>
	<description>DCDC Fourth Status Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000084</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_STARTUP_COMPLETE</name>
	<description>Indicates if the converter is enabled and the startup counter has expired (internal biasing settled)</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DCDC_LV_MODE</name>
	<description>Indicates if the converter is in low battery voltage mode</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DCDC_I_LIM_V18P</name>
	<description>Actual V18P current limit</description>
	<access>read-only</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_I_LIM_VDD</name>
	<description>Actual VDD current limit</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
