andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>DCDC_STATUS_4_REG</name>
	<description>DCDC Fifth Status Register</description>
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000084</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>DCDC_I_LIM_V18</name>
	<description>Actual V18 current limit</description>
	<access>read-only</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_I_LIM_V14</name>
	<description>Actual V14 current limit</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_TEST_0_REG</name>
	<description>DCDC Test Register</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_FORCE_COMP_CLK</name>
	<description>Disables automatic comparator clock, clock lines values based on DCDC_COMP_CLK</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_CURRENT</name>
	<description>Force output current setting</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCDC_OUTPUT_MONITOR</name>
	<description>Output monitor switch (connect to ADC)
000 = None
001 = V14
010 = V18
011 = VDD
100 = VPA
101 = None
110 = None
111 = None</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>DCDC_ANA_TEST</name>
	<description>Analog test bus
000 = None
001 = High side ground
010 = Low side supply
011 = 1.2 V buffer output
100 = None
101 = None
110 = None
111 = None</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_IDLE</name>
	<description>Force idle mode</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_V18P</name>
	<description>Force V18P switch on</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_VDD</name>
	<description>Force VDD switch on</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_V18</name>
	<description>Force V18 switch on</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_V14</name>
	<description>Force V14 switch on</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_FW</name>
	<description>Force FW switch on</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_NSW</name>
	<description>Force N switch on</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_PSW</name>
	<description>Force P switch on</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_TEST_1_REG</name>
	<description>DCDC Test Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>DCDC_COMP_CLK</name>
	<description>Forced clock values for [COMP_VPA, COMP_VDD, COMP_V18, COMP_V14] (requires DCDC_FORCE_COMP_CLK = 1)</description>
	<access>read-write</access>
	<bitRange>[12:9]</bitRange>
	
</field><field>
	<name>DCDC_TEST_CURRENT</name>
	<description>Current limit setting when current limit is forced</description>
	<access>read-write</access>
	<bitRange>[8:4]</bitRange>
	
</field><field>
	<name>DCDC_TEST_REG</name>
	<description>Determines which register appears on the testbus
0x0 = DCDC_NONE
0x1 = DCDC_STATUS_0
0x2 = DCDC_STATUS_1
0x3 = DCDC_STATUS_2
0x4 = DCDC_STATUS_3
0x5 = DCDC_STATUS_4
0x6 = DCDC_TRIM_0
0x7 = DCDC_TRIM_1
0x8 = DCDC_TRIM_2
0x9 = DCDC_TRIM_3
0xA-0xF = DCDC_NONE</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_TRIM_0_REG</name>
	<description>DCDC V14 Comparator Trim Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_V14_TRIM_P</name>
	<description>P comparator trim value when V14 is active
Signed magnitude representation
011111 = +47 mV
000000 = 100000 = +16 mV
111111 = -15 mV</description>
	<access>read-only</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>DCDC_V14_TRIM_N</name>
	<description>N comparator trim value when V14 is active
Signed magnitude representation
011111 = +13 mV
000000 = 100000 = -22 mV
111111 = -56 mV</description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_TRIM_1_REG</name>
	<description>DCDC V18 Comparator Trim Register</description>
	<addressOffset>0x0000002e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18_TRIM_P</name>
	<description>P comparator trim value when V18 is active
Signed magnitude representation
011111 = +47 mV
000000 = 100000 = +16 mV
111111 = -15 mV</description>
	<access>read-only</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>DCDC_V18_TRIM_N</name>
	<description>N comparator trim value when V18 is active
Signed magnitude representation
011111 = +13 mV
000000 = 100000 = -22 mV
111111 = -56 mV</description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_TRIM_2_REG</name>
	<description>DCDC VDD Comparator Trim Register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_VDD_TRIM_P</name>
	<description>P comparator trim value when VDD is active
Signed magnitude representation
011111 = +47 mV
000000 = 100000 = +16 mV
111111 = -15 mV</description>
	<access>read-only</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>DCDC_VDD_TRIM_N</name>
	<description>N comparator trim value when VDD is active
Signed magnitude representation
011111 = +13 mV
000000 = 100000 = -22 mV
111111 = -56 mV</description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
