andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>DCDC_TRIM_3_REG</name>
	<description>DCDC VPA Comparator Trim Register</description>
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_TRIM_P</name>
	<description>P comparator trim value when V18P is active
Signed magnitude representation
011111 = +47 mV
000000 = 100000 = +16 mV
111111 = -15 mV</description>
	<access>read-only</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>DCDC_V18P_TRIM_N</name>
	<description>N comparator trim value when V18P is active
Signed magnitude representation
011111 = +13 mV
000000 = 100000 = -22 mV
111111 = -56 mV</description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_TRIM_REG</name>
	<description>DCDC Comparator Trim Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>DCDC_P_COMP_MAN_TRIM</name>
	<description>Trim mode for P side comparator
0 = Automatic
1 = Manual</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>DCDC_P_COMP_TRIM</name>
	<description>Manual trim value for P side comparator
Signed magnitude representation
011111 = +47 mV
000000 = 100000 = +16 mV
111111 = -15 mV</description>
	<access>read-write</access>
	<bitRange>[12:7]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP_MAN_TRIM</name>
	<description>Trim mode for N side comparator
0 = Automatic
1 = Manual</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP_TRIM</name>
	<description>Manual trim value for N side comparator
Signed magnitude representation
011111 = +13 mV
000000 = 100000 = -22 mV
111111 = -56 mV</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_V14_0_REG</name>
	<description>DCDC V14 First Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000a1a4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V14_FAST_RAMPING</name>
	<description>V14 output fast current ramping (improves response time at the cost of more ripple)</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_V14_VOLTAGE</name>
	<description>V14 output voltage
V = 1.2 V + 25 mV * N</description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>DCDC_V14_CUR_LIM_MAX_HV</name>
	<description>V14 output maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_V14_CUR_LIM_MIN</name>
	<description>V14 output minimum current limit
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_V14_1_REG</name>
	<description>DCDC V14 Second Control Register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000d890</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V14_ENABLE_HV</name>
	<description>V14 output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_V14_ENABLE_LV</name>
	<description>V14 output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCDC_V14_CUR_LIM_MAX_LV</name>
	<description>V14 output maximum current limit low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[13:10]</bitRange>
	
</field><field>
	<name>DCDC_V14_IDLE_HYST</name>
	<description>V14 output idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_V14_IDLE_MIN</name>
	<description>V14 output minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_V18P_0_REG</name>
	<description>DCDC VPA First Control Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000e3e4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_FAST_RAMPING</name>
	<description>V18P output fast current ramping (improves response time at the cost of more ripple)</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_V18P_VOLTAGE</name>
	<description>V18P output voltage
V = 1.2 V + 25 mV * N</description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>DCDC_V18P_CUR_LIM_MAX_HV</name>
	<description>V18P output maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_V18P_CUR_LIM_MIN</name>
	<description>V18P output minimum current limit
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_V18P_1_REG</name>
	<description>DCDC VPA Second Control Register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000bc90</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_ENABLE_HV</name>
	<description>V18P output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_V18P_ENABLE_LV</name>
	<description>V18P output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCDC_V18P_CUR_LIM_MAX_LV</name>
	<description>V18P output maximum current limit low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[13:10]</bitRange>
	
</field><field>
	<name>DCDC_V18P_IDLE_HYST</name>
	<description>V18P output idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_V18P_IDLE_MIN</name>
	<description>V18P output minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
