andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>DCDC_V18_0_REG</name>
	<description>DCDC V18 First Control Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000e3e4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18_FAST_RAMPING</name>
	<description>V18 output fast current ramping (improves response time at the cost of more ripple)</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_V18_VOLTAGE</name>
	<description>V18 output voltage
V = 1.2 V + 25 mV * N</description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>DCDC_V18_CUR_LIM_MAX_HV</name>
	<description>V18 output maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_V18_CUR_LIM_MIN</name>
	<description>V18 output minimum current limit
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_V18_1_REG</name>
	<description>DCDC V18 Second Control Register</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000bc90</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18_ENABLE_HV</name>
	<description>V18 output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_V18_ENABLE_LV</name>
	<description>V18 output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCDC_V18_CUR_LIM_MAX_LV</name>
	<description>V18 output maximum current limit low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[13:10]</bitRange>
	
</field><field>
	<name>DCDC_V18_IDLE_HYST</name>
	<description>V18 output idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_V18_IDLE_MIN</name>
	<description>V18 output minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_VDD_0_REG</name>
	<description>DCDC VDD First Control Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000c304</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_VDD_FAST_RAMPING</name>
	<description>VDD output fast current ramping (improves response time at the cost of more ripple)</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_VDD_VOLTAGE</name>
	<description>VDD output voltage
V = 0.8 V + 25 mV * N</description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>DCDC_VDD_CUR_LIM_MAX_HV</name>
	<description>VDD output maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_VDD_CUR_LIM_MIN</name>
	<description>VDD output minimum current limit
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_VDD_1_REG</name>
	<description>DCDC VDD Second Control Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000ec90</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCDC_VDD_ENABLE_HV</name>
	<description>VDD output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_VDD_ENABLE_LV</name>
	<description>VDD output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCDC_VDD_CUR_LIM_MAX_LV</name>
	<description>VDD output maximum current limit low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[13:10]</bitRange>
	
</field><field>
	<name>DCDC_VDD_IDLE_HYST</name>
	<description>VDD output idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_VDD_IDLE_MIN</name>
	<description>VDD output minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DEM</name>
	<version>1.0</version>
	<description>DEM registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002e00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>90</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>RF_AFC_CTRL_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000d5</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>APD_MODE</name>
	<description>Select the mode in the APD FSM:

xx1: Enable the transition from the ADDRESSDETECTION state to the IDLE state when the signal detection is low
x1x: Enable the reset of the AFC filter when the FSM is in the IDLE state
1xx: Enable the time out in the PREAMBLEDETECTION state. The FSM returns to the IDLE state after the time out.</description>
	<access>read-write</access>
	<bitRange>[12:10]</bitRange>
	
</field><field>
	<name>PAD_MODE</name>
	<description>The PAD mode in BLE mode

00: No limits
01: Wrapping
10: Saturate to zero
11: 580 legacy mode</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>POLE2</name>
	<description>Choose the method to use for AFC tracking during the slot
Description TBD </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>POLE1</name>
	<description>Choose the method to use for AFC tracking during the slot
Description TBD </description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>AFC_MODE</name>
	<description>Choose the method to use for AFC tracking during the slot
Description TBD </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
