andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_AGC_CTRL1_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000950d</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>AGC_MODE</name>
	<description>Choose the method to use for AGC evaluation
Description TBD </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>AGC_TH_HIGH</name>
	<description>AGC hysteresis high threshold (switch up one AGC_SETTING_R step when exceeding this level) </description>
	<access>read-write</access>
	<bitRange>[13:7]</bitRange>
	
</field><field>
	<name>AGC_TH_LOW</name>
	<description>AGC hysteresis low threshold (switch down one AGC_SETTING_R step when dropping below this level) </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_CTRL2_REG</name>
	
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000043</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SLOW_AGC</name>
	<description>Enable the slow AGC mode (no consecutive AGC setting switches) </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>AGCSETTING_WR</name>
	<description>Fixed AGC setting to be used to configure LNA, VGA1 and VGA2 when AGCSETTING_SEL = 1
0: Highest gain as configured in RF_AGC_LUT_01_REG
1: Lower gain as configured in RF_AGC_LUT_01_REG
2: Still lower gain as configured in RF_AGC_LUT_23_REG
...
9-F: Lowest gain as configured in RF_AGC_LUT_89_REG </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>AGCSETTING_SEL</name>
	<description>LNA, VGA1 and VGA2 gains
'0': controlled by AGC'1': provided manually through AGCSETTING_WR </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>EN_FRZ_GAIN</name>
	<description>'0': AGC always active'1': Freeze gain after Access Address detection </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RSSI_TH</name>
	<description>RSSI threshold for the packet detection </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_LUT_01_REG</name>
	
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN1</name>
	<description>LNA gain setting while in AGC setting 0 </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>VGA1_GAIN1</name>
	<description>VGA1 gain setting while in AGC setting 1 </description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>VGA2_GAIN1</name>
	<description>VGA2 gain setting while in AGC setting 1 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN0</name>
	<description>LNA gain setting while in AGC setting 0 </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>VGA1_GAIN0</name>
	<description>VGA1 gain setting while in AGC setting 0 </description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>VGA2_GAIN0</name>
	<description>VGA2 gain setting while in AGC setting 0 </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_LUT_23_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00004202</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN3</name>
	<description>LNA gain setting while in AGC setting 3 </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>VGA1_GAIN3</name>
	<description>VGA1 gain setting while in AGC setting 3 </description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>VGA2_GAIN3</name>
	<description>VGA2 gain setting while in AGC setting 3 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN2</name>
	<description>LNA gain setting while in AGC setting 2 </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>VGA1_GAIN2</name>
	<description>VGA1 gain setting while in AGC setting 2 </description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>VGA2_GAIN2</name>
	<description>VGA2 gain setting while in AGC setting 2 </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_LUT_45_REG</name>
	
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00004b4a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN5</name>
	<description>LNA gain setting while in AGC setting 5 </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>VGA1_GAIN5</name>
	<description>VGA1 gain setting while in AGC setting 5 </description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>VGA2_GAIN5</name>
	<description>VGA2 gain setting while in AGC setting 5 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN4</name>
	<description>LNA gain setting while in AGC setting 4 </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>VGA1_GAIN4</name>
	<description>VGA1 gain setting while in AGC setting 4 </description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>VGA2_GAIN4</name>
	<description>VGA2 gain setting while in AGC setting 4 </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
