andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_AGC_LUT_67_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00005b53</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN7</name>
	<description>LNA gain setting while in AGC setting 7 </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>VGA1_GAIN7</name>
	<description>VGA1 gain setting while in AGC setting 7 </description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>VGA2_GAIN7</name>
	<description>VGA2 gain setting while in AGC setting 7 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN6</name>
	<description>LNA gain setting while in AGC setting 6 </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>VGA1_GAIN6</name>
	<description>VGA1 gain setting while in AGC setting 6 </description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>VGA2_GAIN6</name>
	<description>VGA2 gain setting while in AGC setting 6 </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_LUT_89_REG</name>
	
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00006b63</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN9</name>
	<description>LNA gain setting while in AGC setting 9 </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>VGA1_GAIN9</name>
	<description>VGA1 gain setting while in AGC setting 9 </description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>VGA2_GAIN9</name>
	<description>VGA2 gain setting while in AGC setting 9 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN8</name>
	<description>LNA gain setting while in AGC setting 8 </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>VGA1_GAIN8</name>
	<description>VGA1 gain setting while in AGC setting 8 </description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>VGA2_GAIN8</name>
	<description>VGA2 gain setting while in AGC setting 8 </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_RESULT_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>AGCSETTING_RD</name>
	<description>AGC setting as automatically selected in receive mode to configure LNA, VGA1 and VGA2
0: Highest gain as configured in RF_AGC_LUT_01_REG
1: Lower gain as configured in RF_AGC_LUT_01_REG
2: Still lower gain as configured in RF_AGC_LUT_23_REG
...
9-F: Lowest gain as configured in RF_AGC_LUT_89_REG </description>
	<access>read-only</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>AFC_RD</name>
	<description>Frequency offset estimation (in 2s complement) with a resolution of approximately 5 kHz. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CCA_RSSITH_REG</name>
	
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000708</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SIGDET_TIMEOUT_LEN</name>
	
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>CCA_RSSITH</name>
	<description>RSSI threshold used during CCA</description>
	<access>read-write</access>
	<bitRange>[12:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL1_REG</name>
	
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00008080</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_WR</name>
	<description>DC offset compensation value in Q channel valid when DCOFFSET_SEL = 1 </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_WR</name>
	<description>DC offset compensation value in I channel valid when DCOFFSET_SEL = 1 </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL2_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001d2</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCVGA1SCALE_EN</name>
	<description>Enable the DC offset scaling with the VGA1 gain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DCPARCAL_INIT</name>
	<description>Select the inital value used for the partial DC offset calibration.

0: The DC offset from the previous packet
1: The DC offset found with the full DC offset calibration</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DCNGAIN</name>
	<description>Number of gain settings for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[8:7]</bitRange>
	
</field><field>
	<name>DCNSTEP</name>
	<description>Number of the steps per.gain setting for the full or partial DC offset calibrations </description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>DCPOLE</name>
	<description>Selects the pole of the digital high pass fitlers
Encoding: TBD </description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>DCPARCAL_EN</name>
	<description>Enable flag for the partial DC offset calibration (executed when the demodulator is enabled). </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCOFFSET_SEL</name>
	<description>'0': Normal operation
'1': Use the manual DC offset compensation values from RF_DC_OFFSET_CTRL1_REG </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
