andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL3_REG</name>
	
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000dce4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCBETA_Q</name>
	<description>Quadrature feedback gain for the DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>DCBETA_I</name>
	<description>Inphase feedback gain for the DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL4_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00009210</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCAGCSETTING_FULL3</name>
	<description>AGC setting for forth last the gain step for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>DCAGCSETTING_FULL2</name>
	<description>AGC setting for third last the gain step for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>DCAGCSETTING_FULL1</name>
	<description>AGC setting for second last the gain step for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>DCAGCSETTING_FULL0</name>
	<description>AGC setting for last the gain step for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_RESULT_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset compensation value in Q channel valid when DCOFFSET_SEL = 0 </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset compensation value in I channel valid when DCOFFSET_SEL = 0. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DEM_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000d9</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>CFE_PPOLE</name>
	<description>Select the smoothing factor (pole) for the planer filter used in the CFE (FTDF mode)

Decoding is TBD</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>CFE_MEDIAN_EN</name>
	<description>Select the CFE value in FTDF mode

0: Current estimate
1: Median of the last three estimates</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>CFE_DOUBLE_EN</name>
	<description>Select the update rate of the CFE in FTDF mode

0: Every symbol period (16 us)
1: Every second symbol period (32 us)</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>IQCORR_EN</name>
	<description>Enable the IQ mismatch correction

The correction coefficients are define in the RF_DEM_IQCORRECT_REG register</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>BLE_DDC_EN</name>
	<description>Enable the digital conversion in BLE mode</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>EQUAL_EN</name>
	<description>Enable the equalizer in the demodulator </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>MATCH0101_TH</name>
	<description>Threshold for the 0101 pattern matching </description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>DEM_HSI_POL</name>
	<description>Invert "frequency" polarity of the demodulator </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RXDATA_INV</name>
	<description>'0': Normal operation
'1': Invert the polarity of the received bits </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DEM_IQCORRECT_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IQCORR_ALPHA</name>
	
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>IQCORR_BETA</name>
	
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DEM_TESTMODE_REG</name>
	
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>DEM_TESTMODE</name>
	<description>Defines the demodulator test mode

DEM_TESTMODE[3:0] selects the data mapped on the testbus (see demodulator documentation for details.

The upper and lower 16-bits test data are swapped when DEM_TESTMODE[4] is set.

The lower 16-bits are assigned to the test bus when DEM_TESTMODE[5] is set. The input test bus is copied when DEM_TESTMODE[6] is reset.

The upper 16-bits are assigned to the test bus when DEM_TESTMODE[6] is set. The input test bus is copied with DEM_TESTMODE[7] is reset.

The trigger is slected with DEM_TESTMODE[8:7]
00: dem_en
01: Signal detected
10: Set with the rising edge of DEM_EN and reset with the rising edge of SYNC_FOUND_P
11: Set with the rising edge of SYNC_FOUND_P and reset with the falling edge of DEM_EN


DEM_TESTMODE[9] is reserved</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
