andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_FTDF_CTRL4_REG</name>
	
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000c3a7</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SO_FTDF_SEL</name>
	<description>Start of FTDF (CCA) selection
0: End of the partial DC offset calibration
1: Enable signal DEM_FTDF_EN</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>CCA_MODE</name>
	<description>cca_mode select whether the CCA status for the energy detection and carrier sense are or'ed or and'ed.

0: CCA_STAT = CCA_STAT_ED &amp;&amp; CCA_STAT_CS
1: CCA_STAT = CCA_STAT_ED || CCA_STAT_CS</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>FTDF_HSI_POL</name>
	<description>The polarity of the HSI in the FTDF mode

0: IF = +2.0 MHz
1: IF = -2.0 MHz</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>LQI_SCALE</name>
	<description>Scale factor for the LQI calculation. The scaling factor equals LQI_SCALE+1</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>LQI_CORRTH_EN</name>
	<description>Subtract the correlation thress TODO add register and field name from the correction values used in the LQI calculation</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>LQI_SYMBOL_EN</name>
	<description>Use two of the correction values after the preamble detection for the LQI calculation</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>LQI_PREAMBLE_EN</name>
	<description>Use two of the correlation values during the preamble detection for the LQI calculation</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SFD1</name>
	<description>Most significant nibble of the SFD</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>SFD0</name>
	<description>Least significant nibble of the SFD</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_FTDF_CTRL5_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00004708</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DS_OFFSET_SEL</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>FSSS_CLEAR</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>FTDF_DDC_INV</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>RSSITH</name>
	<description>RSSI threshold used for the CCA-ED</description>
	<access>read-write</access>
	<bitRange>[12:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_FTDF_LOOP_GAIN_DS_REG</name>
	
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000060</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>KI_LF_DS</name>
	<description>Integral gain for the frequency offset tracking loop filter used after the preamble detection</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>KP_LF_DS</name>
	<description>Proportional gain for the frequency offset tracking loop filter used after the preamble dectection</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_FTDF_LOOP_GAIN_PD_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000060</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>KI_LF_PD</name>
	<description>Integral gain for the frequency offset tracking loop filter used during the preamble detection</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>KP_LF_PD</name>
	<description>Proportional gain for the frequency offset tracking loop filter used during the preamble dectection</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_FTDF_SIGDET_CTRL_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>SIGDET_DELAY</name>
	
	<access>read-write</access>
	<bitRange>[14:13]</bitRange>
	
</field><field>
	<name>SIGDET_SFACTOR1</name>
	
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>SIGDET_SFACTOR2</name>
	
	<access>read-write</access>
	<bitRange>[10:9]</bitRange>
	
</field><field>
	<name>SIGDET_DIFF</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SIGDET_THRESHOLD</name>
	
	<access>read-write</access>
	<bitRange>[7:2]</bitRange>
	
</field><field>
	<name>SIGDET_MODE</name>
	
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PAD_CNT_CTRL_REG</name>
	
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>PAD_CLEAR_COUNT</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>PAD_NEG_LIMIT</name>
	
	<access>read-write</access>
	<bitRange>[13:7]</bitRange>
	
</field><field>
	<name>PAD_POS_LIMIT</name>
	
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PAD_CNT_RESULT_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PAD_NEG_CNT_RD</name>
	
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>PAD_POS_CNT_RD</name>
	
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
