andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>ECC_VERSION_REG</name>
	<description>Version register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ECC_HVN</name>
	<description>Version of IP to be read via CPU interface.</description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>ECC_SVN</name>
	<description>Version of Crypto code to be read via CPU interface.Note that this should be read before ECC is used since it corrupts its contents.</description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>FTDF</name>
	<version>1.0</version>
	<description>FTDF registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40080000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>73740</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>FTDF_BUILDTIME_0_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUILDTIME</name>
	<description>A 4 words wide register, showing in ASCII the build date (dd mmm yy) and time (hh:mm) of device, eg. 01 Dec 14 14:10. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_1_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUILDTIME</name>
	<description>A 4 words wide register, showing in ASCII the build date (dd mmm yy) and time (hh:mm) of device, eg. 01 Dec 14 14:10. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_2_REG</name>
	<description>Build time</description>
	<addressOffset>0x00010018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUILDTIME</name>
	<description>A 4 words wide register, showing in ASCII the build date (dd mmm yy) and time (hh:mm) of device, eg. 01 Dec 14 14:10. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_BUILDTIME_3_REG</name>
	<description>Build time</description>
	<addressOffset>0x0001001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUILDTIME</name>
	<description>A 4 words wide register, showing in ASCII the build date (dd mmm yy) and time (hh:mm) of device, eg. 01 Dec 14 14:10. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_DEBUGCONTROL_REG</name>
	<description>Debug control register</description>
	<addressOffset>0x00010390</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000100</resetMask>
	<fields>
	<field>
	<name>DBG_RX_INPUT</name>
	<description>If set to '1', the Rx debug interface will be selected as input for the Rx pipeline rather than the DPHY interface signals.
Note that in this mode, DBG_RX_DATA[3:0] and DBG_RX_SOF are sourced by another source (outside the scope of the LMAC) while the other Rx inputs (CCA_STAT, LQI[7:0] and ED_STAT[7:0]) are forced to 0x00. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_EVENTCURRVAL_REG</name>
	<description>Value of event generator</description>
	<addressOffset>0x00010058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields>
	<field>
	<name>EVENTCURRVAL</name>
	<description>The value of the captured Event generator (Wake-up counter) (initiated by getGeneratorVal, valid when getGeneratorVal_e is set). </description>
	<access>read-only</access>
	<bitRange>[24:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_FTDF_CE_REG</name>
	<description>Selection register events</description>
	<addressOffset>0x00010250</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>FTDF_CE</name>
	<description>Composite service request from ftdf macro (see FR0400 in v40.100.2.41.pdf), set to '1' if the branch currently contributes to the interrupt.
Bit 0 = unused
Bit 1 = rx interrupts
Bit 2 = unused
Bit 3 = miscelaneous interrupts
Bit 4 = tx interrupts
Bit 5 = Reserved
Upon an interrupt, using the ftdf_ce bits it can be checked which interrupt branch creates this interrupt. </description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_FTDF_CM_REG</name>
	<description>Mask selection register events</description>
	<addressOffset>0x00010254</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>FTDF_CM</name>
	<description>mask bits for ftf_ce.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_0_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000ff00</resetValue>
	<resetMask>0x0006ff0e</resetMask>
	<fields>
	<field>
	<name>MACTSCHENABLED</name>
	<description>If set to '1', the TSCH mode is enabled </description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>MACLEENABLED</name>
	<description>If set to '1', the Low Energy mode (also called CSL) is enabled </description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>MACSIMPLEADDRESS</name>
	<description>Simple address of the PAN coordinator </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>TX_DMA_REQ</name>
	<description>Source of the TX_DMA_REQ output pin of this block. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RX_DMA_REQ</name>
	<description>Source of the RX_DMA_REQ output pin of this block. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ISPANCOORDINATOR</name>
	<description>Enable/disable receiver check on address fields (0=enabled, 1=disabled) </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
