andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_1_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACSHORTADDRESS</name>
	<description>The short address of the device. The values 0xFFFF and 0xFFFE indicate that no IEEE Short Address is available. </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>MACPANID</name>
	<description>The PAN ID of this device.
The value 0xFFFF indicates that the device is not associated to a PAN. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_2_REG</name>
	<description>Global control register</description>
	<addressOffset>0x00010028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>AEXTENDEDADDRESS_L</name>
	<description>Unique device address, 48 bits wide, lowest 32 bit </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_GLOB_CONTROL_3_REG</name>
	<description>Global control register</description>
	<addressOffset>0x0001002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>AEXTENDEDADDRESS_H</name>
	<description>Unique device address, 48 bits wide, highest 16 bit </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMACRESET_REG</name>
	<description>Lmax reset register</description>
	<addressOffset>0x00010360</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000106df</resetMask>
	<fields>
	<field>
	<name>LMACGLOBRESET_COUNT</name>
	<description>If set, the LMAC performance and traffic counters will be reset.
Use this register for functionally reset these counters. </description>
	<access>write-only</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>LMACRESET_TIMCTRL</name>
	<description>LmacReset_count: A '1' resets LMAC timing control block (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>LMACRESET_COUNT</name>
	<description>LmacReset_count: A '1' resets LMAC mac counters (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>LMACRESET_SEC</name>
	<description>LmacReset_sec: A '1' resets LMAC security (for debug and MLME-reset)

#$LmacReset_wutim@on_off_regmap
#LmacReset_wutim: A '1' Resets LMAC wake-up timer (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LMACRESET_TSTIM</name>
	<description>LmacReset_tstim: A '1' resets LMAC timestamp timer (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>LMACRESET_OREG</name>
	<description>LmacReset_oreg: A '1' resets LMAC on_off regmap (for debug and MLME-reset)

#$LmacReset_areg@on_off_regmap
#LmacReset_areg: A '1' Resets LMAC always_on regmap (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LMACRESET_AHB</name>
	<description>LmacReset_ahb: A '1' resets LMAC ahb interface (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LMACRESET_TX</name>
	<description>LmacReset_tx: A '1' resets LMAC tx pipeline (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LMACRESET_RX</name>
	<description>LmacReset_rx: A '1' resets LMAC rx pipeline (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LMACRESET_CONTROL</name>
	<description>LmacReset_control: A '1' resets LMAC Controller (for debug and MLME-reset) </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_0_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>KEEP_PHY_EN</name>
	<description>When the transmit or receive action is ready (LmacReady4Sleep is set), the PHY_EN signal is cleared unless the control register keep_phy_en is set to '1'.
When the control register keep_phy_en is set to '1', the signal PHY_EN shall remain being set until the keep_phy_en is cleared.
This will help control the behavior of the arbiter between the LMAC and the DPHY. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>PTI_RX</name>
	<description>This value will be used during receiving frames, during the auto ACK (when the AR bit is set in the received frame, see [FR0655] and further), a single CCA and ED scan.
In TSCH mode this register will be used during the time slot in which frames can be received and consequently an Enhanced ACK can be transmitted. </description>
	<access>read-write</access>
	<bitRange>[30:27]</bitRange>
	
</field><field>
	<name>RXALWAYSON</name>
	<description>If set to '1', the receiver shall be always on if RxEnable is set to '1'. </description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>RXONDURATION</name>
	<description>The time (in symbol periods) the Rx must be on after setting RxEnable to '1'. </description>
	<access>read-write</access>
	<bitRange>[24:1]</bitRange>
	
