andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_10_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x0001010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x20000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACRZZEROVAL</name>
	<description>In CSL mode, if the current RZtime is less or Equal to macRZzeroVal an RZtime with value zero is inserted in the wakeup frame. So this is by default the last Wake-up frame of a Wake-up sequence. </description>
	<access>read-write</access>
	<bitRange>[31:28]</bitRange>
	
</field><field>
	<name>MACCSLMARGINRZ</name>
	<description>In CSL mode, the software can set the margin for the expected frame by control register macCSLmarginRZ (in 10 symbol periods).
The LMAC will make sure that the receiver is ready to receive data this amount of time earlier than to be expected by the received RZ time. </description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>MACWURZCORRECTION</name>
	<description>In CSL mode, this register shall be used if the Wake-up frame to be transmitted is larger than 15 octets.
It shall indicate the amount of extra data in a Wake-up frame after the RZ position in the frame (in 10 symbol periods).
This correction is needed to make sure that the correct RZ time is filled in by the LMAC. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_11_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x0001006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CSMA_CA_BO_THRESHOLD</name>
	<description>If the backoff time calculated in the CSMA-CA procedure as described in [FR3280] is equal to or higher than the control register Csma_Ca_BO_threshold[8] (resolution 320us, see [FR3290]) the event register Csma_Ca_BO_thr_e will be set and an interrupt.
In case Csma_Ca_BO_threshold equals 0xFF no check will be performed and consequently Csma_Ca_BO_thr_e will not be set and no interrupt will be generated. </description>
	<access>read-write</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>CSMA_CA_NB_VAL</name>
	<description>Number of backoffs value in case of a CSMA-CA resume action. </description>
	<access>read-write</access>
	<bitRange>[19:17]</bitRange>
	
</field><field>
	<name>MACDISCARXOFFTORZ</name>
	<description>The switching off and on of the PHY Rx (see macRxTotalCycleTime) can be disabled whith the control register macDisCaRxOfftoRZ.
0 : Disabled
1 : Enabled </description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>MACRXTOTALCYCLETIME</name>
	<description>In CSL mode it can be decided to disable the PHY Rx (Rx-off) after reception of a Wake-up frame and enable the PHY Rx (Rx-on) when the data frame is to be expected, based on the received RZ time.
In order to make it easier to calculate if it is efficient to switch to Rx-off and Rx-on again, a control register indicates the time needed to disable and enable the PHY Rx: macRxTotalCycleTime (resolution is 10 symbol periods) </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_1_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PHYRXATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>PHYRXATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>PHYRXATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>PHYRXATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>PHYRXATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_2_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>EDSCANDURATION</name>
	<description>The length of ED scan in symbol periods. </description>
	<access>read-write</access>
	<bitRange>[31:8]</bitRange>
	
</field><field>
	<name>EDSCANENABLE</name>
	<description>If set to '1', the Energy Detect scan will be performed when RxEnable is set to '1' rather than starting a receive action.
The length of this scan is defined by EdScanDuration. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_3_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x070004c4</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields>
	<field>
	<name>FTDF_LPDP_ENABLE</name>
	<description>If set, not only is FP_override and SA matching done on data_request frames but to all command and data frame types (in normal mode) </description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>FP_FORCE_VALUE</name>
	<description>In case the control register FP_override is set, the value of the control register FP_force_value will always be the value of the FP bit in the automatic ACK response frame. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>FP_OVERRIDE</name>
	<description>In case the control register FP_override is set, the value of the control register FP_force_value will always be the value of the FP bit in the automatic ACK response frame. </description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>ADDR_TAB_MATCH_FP_VALUE</name>
	<description>In case the received source address matches with one of the Exp_SA registers, the value of the control register Addr_tap_match_FP_value will be inserted on the position of the FP bit.
In case there is no match found, the inverse value of Addr_tap_match_FP_value will be inserted. </description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>CCAIDLEWAIT</name>
	<description>Time to wait (in us) after CCA returned medium idle before starting TX-ON.
Notes:
1) extra wait times are involved before a packet is really transmitted, see the relevant timing figures.
2) not applicable in TSCH mode since there macTSRxTx shall be used. </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>MACMAXFRAMETOTALWAITTIME</name>
	<description>Max time to wait (in symbol periods) for a requested Data Frame or an announced broadcast frame, triggered by the FP bit in the received frame was set to '1'. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
