andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_4_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PHYACKATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>PHYACKATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	
</field><field>
	<name>PHYACKATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>PHYACKATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	
</field><field>
	<name>PHYACKATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>RXPIPEPROPDELAY</name>
	<description>The control register RxPipePropDelay indicates the propagation delay in ~s of the Rx pipeline between the last symbol being captured at the DPHY interface and the data valid indication to the LMAC controller. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>PHYSLEEPWAIT</name>
	<description>The minume time (in us) required between the clear to '0' and set to '1' of PHY_EN.
When the signal PHY_EN is deasserted, it will not be asserted within the time phySleepWait. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_5_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000008c0</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PHYCSMACAATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>PHYCSMACAATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	
</field><field>
	<name>PHYCSMACAATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>PHYCSMACAATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	
</field><field>
	<name>PHYCSMACAATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>CCASTATWAIT</name>
	<description>The output CCASTAT is valid after 8 symbols + phyRxStartup.
The 8 symbols are programmable by control registerCcaStatWait (in symbol periods).
Default value is 8d. </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>ACK_RESPONSE_DELAY</name>
	<description>In order to have some flexibility the control register Ack_Response_Delay indicates the Acknowledge response time in ~s.
The default value shall is 192 ~s (12 symbols). </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_6_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000c0c28</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>WUIFSPERIOD</name>
	<description>The WakeUp IFS period is programmable by WUifsPeriod (in symbols).
The default is 12 symbols (192 us). </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>SIFSPERIOD</name>
	<description>The Short IFS period is programmable by SifsPeriod (in symbols).
The default is 12 symbols (192 is). </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>LIFSPERIOD</name>
	<description>The Long IFS period is programmable by LifsPeriod (in symbols).
The default is 40 symbols (640 us), </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_7_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00420000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACCSLSAMPLEPERIOD</name>
	<description>In CSL mode, when performing a idle listening, the receiver is enabled for at least macCSLsamplePeriod (in symbol oeriods). </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>MACWUPERIOD</name>
	<description>In CSL mode, the Wake-up duration in symbol periods. During this period, Wake-up frames will be transmitted. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_8_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACCSLSTARTSAMPLETIME</name>
	<description>In CSL mode, the control register macCSLstartSampleTime indicates the TimeStamp generator time (in symbol periods) when to start listening (called idle listening) or transmitting (when tx_flag_status is set). </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_9_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACCSLFRAMEPENDINGWAITT</name>
	<description>In CSL mode, if a non Wake-up frame with Frame Pending bit = '1' is received, the receiver is enabled for at least an extra period of macCSLFramePendingWaitT (in symbol periods) after the end of the received frame.
The time the Enhanced ACK transmission lasts (if applicable) is included in this time. </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>MACCSLDATAPERIOD</name>
	<description>In CSL mode, after the wake-up sequence a data frame is expected. The receiver will be enabled for at least a period of macCSLdataPeriod (in symbol periods). </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
