andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_DELTA_REG</name>
	<description>Lmac delta control register</description>
	<addressOffset>0x00010070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007e</resetMask>
	<fields>
	<field>
	<name>WAKEUPTIMERENABLESTATUS_D</name>
	<description>Delta which indicates that WakeupTimerEnableStatus has changed
This delta bit is set to '1' on each change of this status, contributes to ftdf_ce[3]. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>GETGENERATORVAL_E</name>
	<description>Event, set to '1' to indicate that the the getGeneratorVal request is completed.
This event bit contributes to ftdf_ce[3]. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SYMBOLTIME2THR_E</name>
	<description>Event, set to '1' when the symboltime counter matched SymbolTime2Thr
This event bit contributes to ftdf_ce[3]. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SYMBOLTIMETHR_E</name>
	<description>Event, set to '1' when the symboltime counter matched SymbolTimeThr
This event bit contributes to ftdf_ce[3]. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SYNCTIMESTAMP_E</name>
	<description>The SyncTimeStamp_e event is set to '1' when the TimeStampgenerator is loaded with SyncTimeStampVal.
This occurs at the rising edge of lp_clk when SyncTimeStampEna is set and the value of the Event generator is equal to the value SyncTimestampThr.
This event bit contributes to ftdf_ce[3]. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LMACREADY4SLEEP_D</name>
	<description>Delta bit for register LmacReady4sleep.
This delta bit is set to '1' on each change of this status, contributes to ftdf_ce[3]. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_MASK_REG</name>
	<description>Lmac mask control register</description>
	<addressOffset>0x00010080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007e</resetMask>
	<fields>
	<field>
	<name>WAKEUPTIMERENABLESTATUS_M</name>
	<description>Mask for WakeupTimerEnableStatus_d
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>GETGENERATORVAL_M</name>
	<description>Mask for getGeneratorVal_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SYMBOLTIME2THR_M</name>
	<description>Mask for SymbolTime2Thr_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SYMBOLTIMETHR_M</name>
	<description>Mask for SymbolTimeThr_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SYNCTIMESTAMP_M</name>
	<description>Mask bit for event register SyncTimeStamp_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LMACREADY4SLEEP_M</name>
	<description>Mask bit for delta bit LmacReady4sleep_d.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_OS_REG</name>
	<description>Lmac control register</description>
	<addressOffset>0x00010050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>CSMA_CA_RESUME_CLEAR</name>
	<description>If set, Csma_Ca_resume_stat is cleared </description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>CSMA_CA_RESUME_SET</name>
	<description>If set, Csma_Ca_resume_stat is set </description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SINGLECCA</name>
	<description>If set to '1', a single CCA will be performed.
This can be used when e.g. the TSCH timing is not performed by the LMAC but completely by software. </description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RXENABLE</name>
	<description>If set, receiving data may be done </description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>GETGENERATORVAL</name>
	<description>If set to '1', the current values of the Wake-up (event) counter/generator (EventCurrVal) and Timestamp (symbol) counter/generator (TimeStampCurrVal and TimeStampCurrPhaseVal) will be captured.
Note that this capture actually has been done when getGeneratorVal_e is set (assuming it was cleared in advance). </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_CONTROL_STATUS_REG</name>
	<description>Lmac status register</description>
	<addressOffset>0x00010054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CSMA_CA_BO_STAT</name>
	<description>The value of the currently calculated BackOff value. To be used for the sleep time calculation in case of sleep during the BackOff time. </description>
	<access>read-only</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>CSMA_CA_RESUME_STAT</name>
	<description>In case Csma_Ca_resume_stat is set the LMAC will
- use the value of Csma_Ca_NB_val in the CSMA-CA process rather than the initial value 0d.
- immediately perform CCA after the sleep, not waiting for the backoff time.
- reset Csma_Ca_resume_stat when it resumes CSMA-CA after the sleep. </description>
	<access>read-only</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>CSMA_CA_NB_STAT</name>
	<description>Current status of the Number of Backoffs. </description>
	<access>read-only</access>
	<bitRange>[18:16]</bitRange>
	
</field><field>
	<name>EDSCANVALUE</name>
	<description>The result of an ED scan. </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>WAKEUPTIMERENABLESTATUS</name>
	<description>Status of WakeupTimerEnable after being clocked by LP_CLK (showing it's effective value).
WakeupTimerEnableStatus can be set by setting the one-shot register WakeupTimerEnable_set and cleared by setting the one-shot register WakeupTimerEnable_clear.
When WakeupTimerEnableStatus is set (after being cleared), the event counter will be reset to 0x0.

This status can be used by software since WakeupTimerEnable is used in the slow LP_CLK area.
Rather than waiting for a certain number of LP_CLK periods, simply scanning this status (or enable the interrupt created by WakeupTimerEnableStatus_e) will allow software to determine if this signal has been effected.
Note that the rising edge of WakeupTimerEnable will reset the Wake-up (event) counter. </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>CCASTAT</name>
	<description>The value of a single CCA, valid when CCAstat_e is set to '1'. </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LMACREADY4SLEEP</name>
	<description>If set to '1' this register indicates that the LMAC is ready to go to sleep. </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
