andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_LMAC_EVENT_REG</name>
	<description>Lmac event regsiter</description>
	<addressOffset>0x00010090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>CSMA_CA_BO_THR_E</name>
	<description>If set, the calculated backoff time is more than Csma_Ca_BO_threshold.
This event bit contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RXTIMEREXPIRED_E</name>
	<description>Set to '1' if one of the timers enabling the Rx-on mode expires without having received any valid frame.
This event bit contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CCASTAT_E</name>
	<description>If set to '1', the single CCA is ready
This event bit contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>EDSCANREADY_E</name>
	<description>The event EdScanReady_e is set to '1' to notify that the ED scan is ready.
This event bit contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_MANUAL_1_REG</name>
	<description>Lmax manual PHY register</description>
	<addressOffset>0x000100a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LMAC_MANUAL_PHY_ATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_PHY_ATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_PHY_ATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_PHY_ATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_PHY_ATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_PTI</name>
	<description>lmac_manual_pti controls the PTI interface signal when lmac_manual_mode is set to '1'. </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_TX_FRM_NR</name>
	<description>lmac_manual_tx_frm_nr controls the entry in the tx buffer to be transmitted when lmac_manual_mode is set to '1'. </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_ED_REQUEST</name>
	<description>lmac_manual_ed_request controls the ED_REQUEST interface signal when lmac_manual_mode is set to '1'. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_RX_PIPE_EN</name>
	<description>lmac_manual_rx_pipe_en controls the rx_enable signal towards the rx pipeline when lmac_manual_mode is set to '1'. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_RX_EN</name>
	<description>lmac_manual_rx_en controls the RX_EN interface signal when lmac_manual_mode is set to '1'. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_TX_EN</name>
	<description>lmac_manual_tx_en controls the TX_EN interface signal when lmac_manual_mode is set to '1'. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_PHY_EN</name>
	<description>lmac_manual_phy_en controls the PHY_EN interface signal when lmac_manual_mode is set to '1'. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_MODE</name>
	<description>If the control register lmac_manual_mode is set to '1', the LMAC controller control signals should be controlled by the lmac_manual_control registers </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_MANUAL_OS_REG</name>
	<description>One shot register triggers transmission in manual mode</description>
	<addressOffset>0x000100a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>LMAC_MANUAL_TX_START</name>
	<description>One shot register which triggers the transmission of a frame from the tx buffer in lmac_manual_mode to '1'. </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_MANUAL_STATUS_REG</name>
	<description>Lmac status register in manual mode</description>
	<addressOffset>0x000100a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ff01</resetMask>
	<fields>
	<field>
	<name>LMAC_MANUAL_ED_STAT</name>
	<description>lmac_manual_ed_stat shows the status of the ED_STAT DPHY interface signal. </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>LMAC_MANUAL_CCA_STAT</name>
	<description>lmac_manual_cca_stat shows the status of the CCA_STAT DPHY interface signal. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LMAC_MASK_REG</name>
	<description>Lmac mask register</description>
	<addressOffset>0x00010094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>CSMA_CA_BO_THR_M</name>
	<description>Mask bit for event Csma_Ca_BO_thr_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RXTIMEREXPIRED_M</name>
	<description>Mask bit for event RxTimerExpired_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CCASTAT_M</name>
	<description>Mask bit for event CCAstat_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>EDSCANREADY_M</name>
	<description>Mask bit for event EdScanReady_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
