andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_LONG_ADDR_0_0_REG</name>
	
	<addressOffset>0x00012000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>EXP_SA_L</name>
	<description>Lowest part of the 64 bits long source address or SA entry 1 resp. SA entry 0 in case of short source address. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_LONG_ADDR_1_0_REG</name>
	
	<addressOffset>0x00012004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>EXP_SA_H</name>
	<description>Highest part of the 64 bits long source address or SA entry 3 resp. SA entry 2 in case of short source address. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_MACACKWAITDURATION_REG</name>
	<description>Maximum time to wait for a ACK</description>
	<addressOffset>0x00010038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000036</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>MACACKWAITDURATION</name>
	<description>Maximum time (in symbol periods) to wait for an ACK response after transmitting a frame with the AR bit set to '1'.
This value is used in the normal mode for the wait of an ACK response, irrespective if the ACK is a normal ACK or an Enhanced ACK. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_MACENHACKWAITDURATION_REG</name>
	<description>Maximum time to wait for an enhanced ACK frame</description>
	<addressOffset>0x0001003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000360</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MACENHACKWAITDURATION</name>
	<description>Maximum time (in us) to wait for an Enhanced ACK response after transmitting a frame with the AR bit set to '1'.
This value is used in the LE/CSL mode for the wait of an ACK response (which is always an Enhanced ACK). </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_MACFCSERRORCOUNT_REG</name>
	<description>Lmac FCS error register</description>
	<addressOffset>0x00010340</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACFCSERRORCOUNT</name>
	<description>metrics counter: the number of received frames that were discarded due to an incorrect FCS after the last deep-sleep cycle. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_MACRXADDRFAILFRMCNT_REG</name>
	<description>Discarded frames register</description>
	<addressOffset>0x00010318</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACRXADDRFAILFRMCNT</name>
	<description>Traffic counter: the number of frames discarded due to incorrect address or PAN Id after the last deep-sleep cycle. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_MACRXSTDACKFRMOKCNT_REG</name>
	<description>Received acknowledgment frames</description>
	<addressOffset>0x00010314</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACRXSTDACKFRMOKCNT</name>
	<description>Traffic counter: the number of Standard Acknowledgment frames received after the last deep-sleep cycle. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_MACRXUNSUPFRMCNT_REG</name>
	<description>Unsupported frames register</description>
	<addressOffset>0x0001031c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACRXUNSUPFRMCNT</name>
	<description>Traffic counter: the number of frames which do pass the checks but are not supported after the last deep-sleep cycle. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_MACTSTXACKDELAYVAL_REG</name>
	<description>Time left until next ACK is sent (us)</description>
	<addressOffset>0x00010078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MACTSTXACKDELAYVAL</name>
	<description>The time (in us) left until the ack frame is sent by the lmac.
This can be used by software to determine if there is enough time left to send the, by software created, Enhanced ACK frame. </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_MACTXSTDACKFRMCNT_REG</name>
	<description>Transmitted acknowledgment frames</description>
	<addressOffset>0x00010310</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACTXSTDACKFRMCNT</name>
	<description>Traffic counter: the number of standard Acknowledgment frames transmitted after the last deep-sleep cycle. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_0_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x76543210</resetValue>
	<resetMask>0x77777777</resetMask>
	<fields>
	<field>
	<name>RXBITPOS_7</name>
	<description>DPHY interface: see rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	
</field><field>
	<name>RXBITPOS_6</name>
	<description>DPHY interface: see rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[26:24]</bitRange>
	
</field><field>
	<name>RXBITPOS_5</name>
	<description>DPHY interface: see rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[22:20]</bitRange>
	
</field><field>
	<name>RXBITPOS_4</name>
	<description>DPHY interface: see rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[18:16]</bitRange>
	
</field><field>
	<name>RXBITPOS_3</name>
	<description>DPHY interface: see rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>RXBITPOS_2</name>
	<description>DPHY interface: see rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>RXBITPOS_1</name>
	<description>DPHY interface: see rxBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>RXBITPOS_0</name>
	<description>DPHY interface: control rxBitPos(8)(3) controls the position that a bit should have at the DPHY interface.
So the default values are rxBitPos_0 = 0, rxBitPos_1 = 1, rxBitPos_2 = 2, etc.

