andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
Note1 that this is a conversion from rx DPHY interface to the internal data byte
So
for(n=7;n&gt;=0;n--)
rx_data(n) = dphy_bit(tx_BitPos(n))
endfor

Note2 that rxBitPos and txBitPos must have inverse functions. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_1_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010184</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x76543210</resetValue>
	<resetMask>0x77777777</resetMask>
	<fields>
	<field>
	<name>TXBITPOS_7</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	
</field><field>
	<name>TXBITPOS_6</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[26:24]</bitRange>
	
</field><field>
	<name>TXBITPOS_5</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[22:20]</bitRange>
	
</field><field>
	<name>TXBITPOS_4</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[18:16]</bitRange>
	
</field><field>
	<name>TXBITPOS_3</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>TXBITPOS_2</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>TXBITPOS_1</name>
	<description>DPHY interface: see txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>TXBITPOS_0</name>
	<description>DPHY interface: control txBitPos(8)(3) controls the position that a bit should have at the DPHY interface.
So the default values are txBitPos_0 = 0, txBitPos_1 = 1, txBitPos_2 = 2, etc.

Note1 that this is a conversion from internal data byte to the DPHY interface.
So
for(n=7;n&gt;=0;n--)
tx_dphy_bit(n) = tx_data(tx_BitPos(n))
endfor

Note2 that txBitPos and rxBitPos must have inverse functions. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_2_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010188</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PHYTRXWAIT</name>
	<description>DPHY interface: Phy wait time (in us) between deassertion of TX_EN and assertion of RX_EN or vice versa. </description>
	<access>read-write</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>PHYTXFINISH</name>
	<description>DPHY interface: Phy wait time (in us) before deasserting TX_EN after deasserting TX_VALID. </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>PHYTXLATENCY</name>
	<description>DPHY interface: phy delay (in us) between DPHY interface and air interface. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>PHYTXSTARTUP</name>
	<description>DPHY interface: the phy wait time (in us) before transmission of a frame may start. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_3_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x0001018c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01000000</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields>
	<field>
	<name>USE_LEGACY_PHY_EN</name>
	<description>If the control register use_legacy_phy_en is set (default), the output signal PHY_TRANSACTION will be sourced by PHY_EN rather than PHY_TRANSACTION. </description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>PHYENABLE</name>
	<description>DPHY interface: Asserting the DPHY interface signals TX_EN or RX_EN does not take place within the time phyEnable after asserting the signal PHY_EN.
(in us). </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>PHYRXLATENCY</name>
	<description>DPHY interface: Phy delay (in us) between air and DPHY interface. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>PHYRXSTARTUP</name>
	<description>DPHY interface: Phy wait time (in us) before receiving of a frame may start. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_REL_NAME_0_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>REL_NAME</name>
	<description>A 4 words wide register, showing in ASCII the name of the release, eg. ftdf_107. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_REL_NAME_1_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>REL_NAME</name>
	<description>A 4 words wide register, showing in ASCII the name of the release, eg. ftdf_107. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_REL_NAME_2_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>REL_NAME</name>
	<description>A 4 words wide register, showing in ASCII the name of the release, eg. ftdf_107. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
