andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_REL_NAME_3_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x0001000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>REL_NAME</name>
	<description>A 4 words wide register, showing in ASCII the name of the release, eg. ftdf_107. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_CONTROL_0_REG</name>
	<description>Receive control register</description>
	<addressOffset>0x00010200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields>
	<field>
	<name>DISRXACKRECEIVEDCA</name>
	<description>If set to '1', the LMAC controller shall ignore all consequent actions upon a set AR bit in the transmitted frame (e.g. enabling Rx-on mode after the transmission and wait for an ACK). </description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>MACIMPLICITBROADCAST</name>
	<description>If set to '1', Frame Version 2 frames without Daddr or DPANId shall be accepted. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>MACPASSWAKEUP</name>
	<description>In CSL mode, if set to '1', WakeUp frames will be put into the Rx buffer.
This can be useful for software to parse the WakeUp frame. </description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>MACALWAYSPASSWAKEUP</name>
	<description>In CSL mode, if the control register macAlwaysPassWakeUp is set to '1', received Wake- up frames for this device are put into the Rx packet buffer without notifying the LMAC Controller (part of transparent mode control). </description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>MACALWAYSPASSFRMTYPE</name>
	<description>The control registers macAlwaysPassFrmType[7:0], shall control if this Frame Type shall be dropped.
If a bit is set to '1', the Frame Type corresponding with the bit position is not dropped, even in case of a CRC error.
Example:
if bit 3 is set to '1', Frame Type 3 shall not be dropped.
If there is a FCS error, the error shall be reported in the Rx meta data (crc16_error is set to '1'). </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>MACALWAYSPASSTOPANCOORDINATOR</name>
	<description>When the control register macAlwaysPassToPanCoordinator is set to '1', the frame is not dropped due to a span_coord_error.
However, in case of an FCS error, the packet is dropped. </description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>MACALWAYSPASSBEACONWRONGPANID</name>
	<description>If the control register macAlwaysPassBeaconWrongPANId is set, the frame is not dropped in case of a mismatch in PAN-ID, irrespective of the setting of RxBeaconOnly. </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>MACALWAYSPASSWRONGDADDR</name>
	<description>If set to '1', a packet with a wrong DAddr is not dropped </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>MACALWAYSPASSWRONGDPANID</name>
	<description>If register macAlwaysPassWrongDPANId is set to '1', packet with a wrong Destiantion PanID will not be dropped.
However, in case of an FCS error, the packet is dropped. </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>MACALWAYSPASSRESFRAMEVERSION</name>
	<description>If set to '1', a packet with a reserved FrameVersion shall not be dropped </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DISDATAREQUESTCA</name>
	<description>When the control register DisDataRequestCa is set, the notification of the received Data Request is disabled. </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>MACALWAYSPASSCRCERROR</name>
	<description>If set to '1', a FCS error will not drop the frame. However, an FCS error will be reported in the Rx meta data (crc16_error is set to '1'). </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DISRXACKREQUESTCA</name>
	<description>When the control register DisRxAckRequestca is set to '1' all consequent actions for a received Acknowledge Request bit are disabled. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DISRXFRMPENDINGCA</name>
	<description>Whan the control register DisRxFrmPendingCa is set to '1', the notification of the received FP bit to the LMAC Controller is disabled and thus no consequent actions will take place. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RX_READ_BUF_PTR</name>
	<description>Indication where new data will be read
All four bits shall be used when using these pointer values (0d - 15d).
However, the Receive Packet buffer has a size of 8 entries.
So reading the Receive Packet buffer entries shall use the mod8 of the pointer values. </description>
	<access>read-write</access>
	<bitRange>[6:3]</bitRange>
	
</field><field>
	<name>RXCOORDREALIGNONLY</name>
	<description>If set to '1', only Coordinator Realignment frames are accepted </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RXBEACONONLY</name>
	<description>If set to '1', only Beacons frames are accepted </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DBGRXTRANSPARENTMODE</name>
	<description>If set yo '1', Rx pipe is fully set in transparent mode (for debug purpose). </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_EVENT_REG</name>
	<description>Receive event register</description>
	<addressOffset>0x00010204</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>RXBYTE_E</name>
	<description>If set to '1' it indicates that the first byte of a new packet has been received
This event bit contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RX_BUF_AVAIL_E</name>
	<description>If set to '1' it indicates that a new valid packet has been completely received
This event bit contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RX_OVERFLOW_E</name>
	<description>If set to '1' it indicates that the Rx packet buffer has an overflow.
This event bit contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RXSOF_E</name>
	<description>Set to '1' when RX_SOF has been detected.
This event bit contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
