andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_0_0_REG</name>
	<description>Address receive fifo 0</description>
	<addressOffset>0x00008000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_1_0_REG</name>
	<description>Address transmit fifo 1</description>
	<addressOffset>0x00008080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_2_0_REG</name>
	<description>Address transmit fifo 2</description>
	<addressOffset>0x00008100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_3_0_REG</name>
	<description>Address transmit fifo 3</description>
	<addressOffset>0x00008180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_4_0_REG</name>
	<description>Address transmit fifo 4</description>
	<addressOffset>0x00008200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_5_0_REG</name>
	<description>Address transmit fifo 5</description>
	<addressOffset>0x00008280</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_6_0_REG</name>
	<description>Address transmit fifo 6</description>
	<addressOffset>0x00008300</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_7_0_REG</name>
	<description>Address transmit fifo 7</description>
	<addressOffset>0x00008380</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_MASK_REG</name>
	<description>Receive event mask register</description>
	<addressOffset>0x00010208</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>RXBYTE_M</name>
	<description>Mask bit for event rxbyte_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RX_BUF_AVAIL_M</name>
	<description>Mask bit for event rx_buf_avail_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RX_OVERFLOW_M</name>
	<description>Mask bit for event rx_overflow_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RXSOF_M</name>
	<description>Mask bit for event RxSof_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_0_REG</name>
	<description>Receive metadata register 0</description>
	<addressOffset>0x00000280</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
