andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_1_REG</name>
	<description>Receive metadata register 1</description>
	<addressOffset>0x00000290</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_2_REG</name>
	<description>Receive metadata register 2</description>
	<addressOffset>0x000002a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_3_REG</name>
	<description>Receive metadata register 3</description>
	<addressOffset>0x000002b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_4_REG</name>
	<description>Receive metadata register 4</description>
	<addressOffset>0x000002c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_5_REG</name>
	<description>Receive metadata register 5</description>
	<addressOffset>0x000002d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_6_REG</name>
	<description>Receive metadata register 6</description>
	<addressOffset>0x000002e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_7_REG</name>
	<description>Receive metadata register 7</description>
	<addressOffset>0x000002f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Rx meta data per entry: Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_1_0_REG</name>
	<description>Receive metadata register 0</description>
	<addressOffset>0x00000284</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields>
	<field>
	<name>QUALITY_INDICATOR</name>
	<description>Rx meta data per entry: the Link Quality Indication value during reception of this frame.

# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Rx meta data per entry: if set to '1', the received frame is not for PAN coordinator, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SPANID_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a PAN ID error has occurred, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DADDR_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a destination Address error has occurred, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DPANID_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a destination PAN ID error has occurred, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Rx meta data per entry: if set to '1' this frame is a not supported frame version, applicable when frame is not discarded. </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Rx meta data per entry: if set to '1' this frame is a not supported frame type, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CRC16_ERROR</name>
	<description>Rx meta data per entry: if set, a CRC error has occurred in this frame, applicable for transparent mode only </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_META_1_1_REG</name>
	<description>Receive metadata register 1</description>
	<addressOffset>0x00000294</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields>
	<field>
	<name>QUALITY_INDICATOR</name>
	<description>Rx meta data per entry: the Link Quality Indication value during reception of this frame.

# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Rx meta data per entry: if set to '1', the received frame is not for PAN coordinator, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SPANID_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a PAN ID error has occurred, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DADDR_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a destination Address error has occurred, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DPANID_ERROR</name>
	<description>Rx meta data per entry: if set to '1', a destination PAN ID error has occurred, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Rx meta data per entry: if set to '1' this frame is a not supported frame version, applicable when frame is not discarded. </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Rx meta data per entry: if set to '1' this frame is a not supported frame type, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CRC16_ERROR</name>
	<description>Rx meta data per entry: if set, a CRC error has occurred in this frame, applicable for transparent mode only </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
