andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_DELTA_REG</name>
	<description>Receive status delta register</description>
	<addressOffset>0x00010220</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>RX_BUFF_IS_FULL_D</name>
	<description>Delta bit of status rx_buff_is_full.
This delta bit is set to '1' on each change of this status, contributes to ftdf_ce[1]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_MASK_REG</name>
	<description>Receive status delta mask register</description>
	<addressOffset>0x00010224</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>RX_BUFF_IS_FULL_M</name>
	<description>Mask bit for delta bit rx_buff_is_full_d
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_REG</name>
	<description>Receive status register</description>
	<addressOffset>0x0001020c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>RX_WRITE_BUF_PTR</name>
	<description>Indication where new data will be written.
All four bits shall be used when using these pointer values (0d - 15d).
However, the Receive Packet buffer has a size of 8 entries.
So reading the Receive Packet buffer entries shall use the mod8 of the pointer values. </description>
	<access>read-only</access>
	<bitRange>[4:1]</bitRange>
	
</field><field>
	<name>RX_BUFF_IS_FULL</name>
	<description>If set to '1', it indicates that the Rx packet buffer is full </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECKEY_0_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x00010118</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECKEY_0</name>
	<description>Encryption/decryption mode: Registers secKey[0..3] contain the key to be used. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECKEY_1_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x0001011c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECKEY_1</name>
	<description>Encryption/decryption mode: see register secKey_0 </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECKEY_2_REG</name>
	<description>SecKey register</description>
	<addressOffset>0x00010120</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECKEY_2</name>
	<description>Encryption/decryption mode: see register secKey_0 </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECKEY_3_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x00010124</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECKEY_3</name>
	<description>Encryption/decryption mode: see register secKey_0</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECNONCE_0_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010128</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECNONCE_0</name>
	<description>Encryption/decryption mode: register secNonce[0..3] contains the Nonce to be used for encryption/decryption. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECNONCE_1_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x0001012c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECNONCE_1</name>
	<description>Encryption/decryption mode: see register Nonce_0 </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECNONCE_2_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010130</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECNONCE_2</name>
	<description>Encryption/decryption mode: see register Nonce_0 </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECNONCE_3_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010134</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>SECNONCE_3</name>
	<description>Encryption/decryption mode: see register Nonce_0 </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECURITY_0_REG</name>
	<description>Security register</description>
	<addressOffset>0x00010110</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECENCDECN</name>
	<description>Encryption/decryption mode: the control register secEncDecn indicates whether to encrypt ('1') or decrypt ('0') the data. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>SECMLENGTH</name>
	<description>Encryption/decryption mode: the length of the m_data is indicated by control register secMlength (in bytes). </description>
	<access>read-write</access>
	<bitRange>[30:24]</bitRange>
	
</field><field>
	<name>SECALENGTH</name>
	<description>Encryption/decryption mode: the length of the a_data is indicated by control register secAlength (in bytes).
The end of the a_data is the start point of the m_data. So secAlength must also be set if security level==4. </description>
	<access>read-write</access>
	<bitRange>[22:16]</bitRange>
	
</field><field>
	<name>SECENTRY</name>
	<description>Encryption/decryption mode: the software indicates by the control registers secEntry and secTxRxn which entry to use and if it's from the Tx or Rx buffer ('1' resp. '0'). </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>SECTXRXN</name>
	<description>Encryption/decryption mode: see register secEntry. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
