andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_SECURITY_1_REG</name>
	<description>Security register</description>
	<addressOffset>0x00010114</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SECENCRFLAGS</name>
	<description>Encryption/decryption mode: register secEncrFlags contains the encryption flags field.
Bits [2:0] are the 3-bit encoding flags of a_data, the other bits msut be set to '0'. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SECAUTHFLAGS</name>
	<description>Encryption/decryption mode: register secAuthFlags contains the authentication flags fields.
bit[7] is '0'
bit[6] is A_data present
bit[5:3]: 3-bit security level of m_data
bit[2:0]: 3-bit security level of a_data. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECURITY_EVENTMASK_REG</name>
	<description>security event mask register</description>
	<addressOffset>0x00010154</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>SECREADY_M</name>
	<description>Mask bit for event secReady_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECURITY_EVENT_REG</name>
	<description>security event register</description>
	<addressOffset>0x00010150</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>SECREADY_E</name>
	<description>Encryption/decryption mode: the Event bit secReady_e is set to '1' when the authentication process is ready (i.e. secBusy is cleared).
This event bit contributes to ftdf_ce[3]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECURITY_OS_REG</name>
	<description>One shot register to start encryption/decryption</description>
	<addressOffset>0x00010138</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>SECSTART</name>
	<description>Encryption/decryption mode: one_shot register to start the encryption, decryption and authentication support task. </description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SECABORT</name>
	<description>Encryption/decryption mode: see register Nonce_0 </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SECURITY_STATUS_REG</name>
	<description>Security status register</description>
	<addressOffset>0x00010140</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>SECAUTHFAIL</name>
	<description>Encryption/decryption mode: in case of decryption, the status bit secAuthFail will be set when the authentication has failed. </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SECBUSY</name>
	<description>Encryption/decryption mode: register secBusy indicates if the encryption/decryption process is still running. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SIZE_AND_VAL_0_REG</name>
	
	<addressOffset>0x00012008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>SHORT_LONGNOT</name>
	<description>A '1' indicates that Exp_SA contains four short SA's, a '0' indicates one long SA. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>VALID_SA</name>
	<description>Indication which SA entry is valid (if set). In case of 4 short SA Valid bit 3 belongs to SA entry 3 etc.
In case of a long SA Valid bit 0 is the valid indication. </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIME2THR_REG</name>
	<description>Symboltime threshold register 2</description>
	<addressOffset>0x00010384</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYMBOLTIME2THR</name>
	<description>Symboltime 2 Threshold to generate a general interrupt when this value matches the symbol counter value. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIMESNAPSHOTVAL_REG</name>
	<description>Value timestamp generator</description>
	<addressOffset>0x00010210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYMBOLTIMESNAPSHOTVAL</name>
	<description>The Status register SymbolTimeSnapshotVal indicates the actual value of the TimeStamp generator.
This can be useful for software to use e.g. in CSL mode at creating an Enhanced ACK to calculate the CSL phase and period. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIMETHR_REG</name>
	<description>Symboltime threshold register 1</description>
	<addressOffset>0x00010380</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYMBOLTIMETHR</name>
	<description>Symboltime Threshold to generate a general interrupt when this value matches the symbol counter value. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
