andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPPHASEVAL_REG</name>
	<description>Timestamp phase value regsiter</description>
	<addressOffset>0x00010320</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>SYNCTIMESTAMPPHASEVAL</name>
	<description>Value to synchronize the timestamp counter phase with at the moment indicated by SyncTimeStampThr.
Please note the +1 correction needed for most accurate result (+0.5 is than the average error, resulting is a just too fast clock). </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPTHR_REG</name>
	<description>Threshold timestamp generator</description>
	<addressOffset>0x00010304</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields>
	<field>
	<name>SYNCTIMESTAMPTHR</name>
	<description>Threshold for synchronize the timestamp counter: at this value of the event counter the synchronization of the timestamp (symbol) counter is done (if SyncTimeStampEna is set to '1').
If SyncTimeStamp_e is set to '1' the synchronization has taken place. </description>
	<access>read-write</access>
	<bitRange>[24:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPVAL_REG</name>
	<description>Value timestamp generator</description>
	<addressOffset>0x00010308</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYNCTIMESTAMPVAL</name>
	<description>Value to synchronize the timestamp counter with at the moment indicated by SyncTimeStampThr. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TIMER_CONTROL_1_REG</name>
	<description>Timer control register</description>
	<addressOffset>0x0001030c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000002</resetMask>
	<fields>
	<field>
	<name>SYNCTIMESTAMPENA</name>
	<description>If set to '1', the synchronization of the timestamp counter after a deep-sleep cycle will be performed when SyncTimeStampThr matches the value of the event (wake-up) counter. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TIMESTAMPCURRPHASEVAL_REG</name>
	<description>Value of timestamp generator phase within a symbol</description>
	<addressOffset>0x00010074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>TIMESTAMPCURRPHASEVAL</name>
	<description>Value of captured timestamp generator phase within a symbol (initiated by getGeneratorVal, valid when getGeneratorVal_e is set) </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TIMESTAMPCURRVAL_REG</name>
	<description>Value of timestamp generator</description>
	<addressOffset>0x0001005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIMESTAMPCURRVAL</name>
	<description>The value of captured timestamp generator (symbol counter) (initiated by getGeneratorVal, valid when getGeneratorVal_e is set) </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_0_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010160</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x089803e8</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACTSRXWAIT</name>
	<description>TSCH mode: The times to wait for start of frame </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>MACTSTXACKDELAY</name>
	<description>TSCH mode: the time between the end of a Rx frame and the start of an Enhanced Acknowlegde frame. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_1_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010164</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000c0</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MACTSRXTX</name>
	<description>TSCH mode: The time between the CCA and the TX of a frame </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_2_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010168</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01900320</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACTSACKWAIT</name>
	<description>TSCH mode: The minimum time to wait for start of an Acknowledgement </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>MACTSRXACKDELAY</name>
	<description>TSCH mode: End of frame to when the transmitter shall listen for Acknowledgement </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TXBYTE_E_REG</name>
	<description>Transmit first byte register</description>
	<addressOffset>0x00010394</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>TX_LAST_SYMBOL_E</name>
	<description>If set to '1', it indicates the last symbol of a frame is transmitted
This event bit contributes to ftdf_ce[4]. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TXBYTE_E</name>
	<description>If set to '1', it indicates the first byte of a frame is transmitted
This event bit contributes to ftdf_ce[4]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
