andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_TXBYTE_M_REG</name>
	<description>Transmit first byte mask register</description>
	<addressOffset>0x00010398</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>TX_LAST_SYMBOL_M</name>
	<description>Mask bit for event tx_last_symbol_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TXBYTE_M</name>
	<description>Mask bit for event txbyte_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TXPIPEPROPDELAY_REG</name>
	<description>Prop delay transmit register</description>
	<addressOffset>0x00010034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>TXPIPEPROPDELAY</name>
	<description>Propagation delay (in us) of the tx pipe, between start of transmission (indicated by setting tx_flag_status) to the DPHY.
The reset value is 0 us, which is also the closest value to the real implementation figure. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_CLEAR_OS_REG</name>
	<description>One shot register to clear flag</description>
	<addressOffset>0x00010484</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR</name>
	<description>Tx meta data per entry: if set to '1', the tx_flag_stat will be cleared to '0'. </description>
	<access>write-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_CONTROL_0_REG</name>
	<description>Transmit control register</description>
	<addressOffset>0x00010240</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004350</resetValue>
	<resetMask>0x00007ff1</resetMask>
	<fields>
	<field>
	<name>MACMAXCSMABACKOFFS</name>
	<description>CSMA-CA: Maximum number of CSMA-CA backoffs (range 0-5) </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>MACMINBE</name>
	<description>CSMA-CA: Minimum Backoff Exponent (range 0-macMaxBE) </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>MACMAXBE</name>
	<description>CSMA-CA: Maximum Backoff Exponent (range 3-8) </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>DBGTXTRANSPARENTMODE</name>
	<description>If set to '1', the MPDU octets pass transparently through the MAC in the transmit direction (for debug purpose). </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_0_0_REG</name>
	<description>Address transmit fifo 0</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported.
Note that, despite the name, this fifo is NOT retained when the LMAC is put into deep-sleep! </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_1_0_REG</name>
	<description>Address transmit fifo 1</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported.
Note that, despite the name, this fifo is NOT retained when the LMAC is put into deep-sleep! </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_2_0_REG</name>
	<description>Address transmit fifo 2</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported.
Note that, despite the name, this fifo is NOT retained when the LMAC is put into deep-sleep! </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_3_0_REG</name>
	<description>Address transmit fifo 3</description>
	<addressOffset>0x00000180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported.
Note that, despite the name, this fifo is NOT retained when the LMAC is put into deep-sleep! </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_0_REG</name>
	<description>Clear flag register 0</description>
	<addressOffset>0x00010404</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>Tx meta data per entry: if set to '1' the LMAC hardware has cleared the tx_flag_stat status.
This event bit contributes to ftdf_ce[4]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
