andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_1_REG</name>
	<description>Clear flag register 1</description>
	<addressOffset>0x00010424</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>Tx meta data per entry: if set to '1' the LMAC hardware has cleared the tx_flag_stat status.
This event bit contributes to ftdf_ce[4]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_2_REG</name>
	<description>Clear flag register 2</description>
	<addressOffset>0x00010444</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>Tx meta data per entry: if set to '1' the LMAC hardware has cleared the tx_flag_stat status.
This event bit contributes to ftdf_ce[4]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_3_REG</name>
	<description>Clear flag register 3</description>
	<addressOffset>0x00010464</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>Tx meta data per entry: if set to '1' the LMAC hardware has cleared the tx_flag_stat status.
This event bit contributes to ftdf_ce[4]. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_0_REG</name>
	<description>Mask flag register 0</description>
	<addressOffset>0x00010408</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Tx meta data per entry: Mask bit for event tx_flag_clear_e.
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_1_REG</name>
	<description>Mask flag register 1</description>
	<addressOffset>0x00010428</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Tx meta data per entry: Mask bit for event tx_flag_clear_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_2_REG</name>
	<description>Clear flag register 2</description>
	<addressOffset>0x00010448</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Tx meta data per entry: Mask bit for event tx_flag_clear_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_3_REG</name>
	<description>Clear flag register 3</description>
	<addressOffset>0x00010468</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Tx meta data per entry: Mask bit for event tx_flag_clear_e
The mask bit is masking when cleared to '0' (default value) and will enable the contribution to the interrupt when set to '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_0_REG</name>
	<description>Transmit packet ready for transmission register 0</description>
	<addressOffset>0x00010400</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_STAT</name>
	<description>Tx meta data per entry: if set to '1', the packet is ready for transmission </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_1_REG</name>
	<description>Transmit packet ready for transmission register 1</description>
	<addressOffset>0x00010420</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_STAT</name>
	<description>Tx meta data per entry: if set to '1', the packet is ready for transmission </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_2_REG</name>
	<description>Transmit packet ready for transmission register 2</description>
	<addressOffset>0x00010440</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_STAT</name>
	<description>Tx meta data per entry: if set to '1', the packet is ready for transmission </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_3_REG</name>
	<description>Transmit packet ready for transmission register 3</description>
	<addressOffset>0x00010460</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_STAT</name>
	<description>Tx meta data per entry: if set to '1', the packet is ready for transmission </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
