andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_0_REG</name>
	<description>Transmit metadata register 0</description>
	<addressOffset>0x00000200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields>
	<field>
	<name>CRC16_ENA</name>
	<description>Tx meta data per entry: Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>ACKREQUEST</name>
	<description>Tx meta data per entry: '1' indicates that an acknowledge is expected from the recipient of this packet. </description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>CSMACA_ENA</name>
	<description>Tx meta data per entry: '1' indicates that a CSMA-CA is required for the transmission of this packet. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>FRAMETYPE</name>
	<description>Tx meta data per entry: the frame type of the data to be transmitted (Data/Cmd/Ack/wakeup frame/etc.). </description>
	<access>read-write</access>
	<bitRange>[25:23]</bitRange>
	
</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[21:19]</bitRange>
	
</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[18:15]</bitRange>
	
</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	
</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[10:7]</bitRange>
	
</field><field>
	<name>FRAME_LENGTH</name>
	<description>Tx meta data per entry: Frame length (in bytes) </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_1_REG</name>
	<description>Transmit metadata register 1</description>
	<addressOffset>0x00000210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields>
	<field>
	<name>CRC16_ENA</name>
	<description>Tx meta data per entry: Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>ACKREQUEST</name>
	<description>Tx meta data per entry: '1' indicates that an acknowledge is expected from the recipient of this packet. </description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>CSMACA_ENA</name>
	<description>Tx meta data per entry: '1' indicates that a CSMA-CA is required for the transmission of this packet. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>FRAMETYPE</name>
	<description>Tx meta data per entry: the frame type of the data to be transmitted (Data/Cmd/Ack/wakeup frame/etc.). </description>
	<access>read-write</access>
	<bitRange>[25:23]</bitRange>
	
</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[21:19]</bitRange>
	
</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[18:15]</bitRange>
	
</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	
</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[10:7]</bitRange>
	
</field><field>
	<name>FRAME_LENGTH</name>
	<description>Tx meta data per entry: Frame length (in bytes) </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_2_REG</name>
	<description>Transmit metadata register 2</description>
	<addressOffset>0x00000220</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields>
	<field>
	<name>CRC16_ENA</name>
	<description>Tx meta data per entry: Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>ACKREQUEST</name>
	<description>Tx meta data per entry: '1' indicates that an acknowledge is expected from the recipient of this packet. </description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>CSMACA_ENA</name>
	<description>Tx meta data per entry: '1' indicates that a CSMA-CA is required for the transmission of this packet. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>FRAMETYPE</name>
	<description>Tx meta data per entry: the frame type of the data to be transmitted (Data/Cmd/Ack/wakeup frame/etc.). </description>
	<access>read-write</access>
	<bitRange>[25:23]</bitRange>
	
</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[21:19]</bitRange>
	
</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[18:15]</bitRange>
	
</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	
</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[10:7]</bitRange>
	
</field><field>
	<name>FRAME_LENGTH</name>
	<description>Tx meta data per entry: Frame length (in bytes) </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
