andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_2_REG</name>
	<description>Transmit priority register 2</description>
	<addressOffset>0x00010450</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000f1f</resetMask>
	<fields>
	<field>
	<name>PTI_TX</name>
	<description>This register has 4 entries, belonging to the entry of the Tx frame to send, to be used during transmitting frames and the CMSA-CA phase before (when requested).
In TSCH mode this register shall be used during the time slot in which frames can be transmitted and consequently an Enhanced ACK can be received.
Since pti_tx belongs to a certain frame to be transmitted, pti_tx can be considered as extra Tx meta data. </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>ISWAKEUP</name>
	<description>Tx meta data per entry: A basic wake-up frame can be generated by the UMAC in the Tx buffer.
The meta data control bit IsWakeUp must be set to indicate that this is a Wake-up frame. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TX_PRIORITY</name>
	<description>Tx meta data per entry: Priority of packet </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_3_REG</name>
	<description>Transmit priority register 3</description>
	<addressOffset>0x00010470</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000f1f</resetMask>
	<fields>
	<field>
	<name>PTI_TX</name>
	<description>This register has 4 entries, belonging to the entry of the Tx frame to send, to be used during transmitting frames and the CMSA-CA phase before (when requested).
In TSCH mode this register shall be used during the time slot in which frames can be transmitted and consequently an Enhanced ACK can be received.
Since pti_tx belongs to a certain frame to be transmitted, pti_tx can be considered as extra Tx meta data. </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>ISWAKEUP</name>
	<description>Tx meta data per entry: A basic wake-up frame can be generated by the UMAC in the Tx buffer.
The meta data control bit IsWakeUp must be set to indicate that this is a Wake-up frame. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TX_PRIORITY</name>
	<description>Tx meta data per entry: Priority of packet </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_0_0_REG</name>
	<description>Transmit status register 0</description>
	<addressOffset>0x00000240</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TXTIMESTAMP</name>
	<description>Tx return status per entry: Transmit Timestamp
The Timestamp of the transmitted packet. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_0_1_REG</name>
	<description>Transmit status register 1</description>
	<addressOffset>0x00000250</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TXTIMESTAMP</name>
	<description>Tx return status per entry: Transmit Timestamp
The Timestamp of the transmitted packet. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_0_2_REG</name>
	<description>Transmit status register 2</description>
	<addressOffset>0x00000260</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TXTIMESTAMP</name>
	<description>Tx return status per entry: Transmit Timestamp
The Timestamp of the transmitted packet. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_0_3_REG</name>
	<description>Transmit status register 3</description>
	<addressOffset>0x00000270</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TXTIMESTAMP</name>
	<description>Tx return status per entry: Transmit Timestamp
The Timestamp of the transmitted packet. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_1_0_REG</name>
	<description>Transmit status register 0</description>
	<addressOffset>0x00000244</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>CSMACANRRETRIES</name>
	<description>Tx return status per entry: Number of CSMA-CA retries before this frame has been transmitted </description>
	<access>read-only</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>CSMACAFAIL</name>
	<description>Tx return status per entry: CSMA-CA status
0 : SUCCESS
1 : FAIL </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ACKFAIL</name>
	<description>Tx return status per entry: Acknowledgement status
0 : SUCCESS
1 : FAIL </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_1_1_REG</name>
	<description>Transmit status register 1</description>
	<addressOffset>0x00000254</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>CSMACANRRETRIES</name>
	<description>Tx return status per entry: Number of CSMA-CA retries before this frame has been transmitted </description>
	<access>read-only</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>CSMACAFAIL</name>
	<description>Tx return status per entry: CSMA-CA status
0 : SUCCESS
1 : FAIL </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ACKFAIL</name>
	<description>Tx return status per entry: Acknowledgement status
0 : SUCCESS
1 : FAIL </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
