andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_1_2_REG</name>
	<description>Transmit status register 2</description>
	<addressOffset>0x00000264</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>CSMACANRRETRIES</name>
	<description>Tx return status per entry: Number of CSMA-CA retries before this frame has been transmitted </description>
	<access>read-only</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>CSMACAFAIL</name>
	<description>Tx return status per entry: CSMA-CA status
0 : SUCCESS
1 : FAIL </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ACKFAIL</name>
	<description>Tx return status per entry: Acknowledgement status
0 : SUCCESS
1 : FAIL </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_RETURN_STATUS_1_3_REG</name>
	<description>Transmit status register 3</description>
	<addressOffset>0x00000274</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>CSMACANRRETRIES</name>
	<description>Tx return status per entry: Number of CSMA-CA retries before this frame has been transmitted </description>
	<access>read-only</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>CSMACAFAIL</name>
	<description>Tx return status per entry: CSMA-CA status
0 : SUCCESS
1 : FAIL </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ACKFAIL</name>
	<description>Tx return status per entry: Acknowledgement status
0 : SUCCESS
1 : FAIL </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_TX_SET_OS_REG</name>
	<description>One shot register to set flag</description>
	<addressOffset>0x00010480</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_SET</name>
	<description>Tx meta data per entry: if set to '1', the tx_flag_stat will be set to '1'. </description>
	<access>write-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_WAKEUP_CONTROL_OS_REG</name>
	
	<addressOffset>0x00010364</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>WAKEUPTIMERENABLE_CLEAR</name>
	<description>If set, WakeupTimerEnableStatus will be cleared. </description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>WAKEUPTIMERENABLE_SET</name>
	<description>If set, WakeupTimerEnableStatus will be set. </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>FTDF_WAKEUP_CONTROL_REG</name>
	<description>Wakeup timer vcontrol register</description>
	<addressOffset>0x00011000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x40000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>WAKEUP_MODE</name>
	<description>The Control register WakeUp_mode controls the behavior of the Event counter:
0d = off, 1d = free running (default), 2d = one shot with auto clear, 3d = configurable period (timer
mode). </description>
	<access>read-write</access>
	<bitRange>[31:30]</bitRange>
	
</field><field>
	<name>WAKEUPENABLE</name>
	<description>If set to '1', the WakeUpIntThr is enabled to generate an WAKEUP_IRQ interrupt. </description>
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>WAKEUPINTTHR</name>
	<description>Threshold for wake-up interrupt. When WakeUpEnable is set to '1' and the Wake-up (event) counter matches this value, the interrupt WAKEUP_IRQ is set to '1' for the duration of one LP_CLK period. </description>
	<access>read-write</access>
	<bitRange>[24:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GP_TIMERS</name>
	<version>1.0</version>
	<description>GP_TIMERS registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003400</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>32</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>BREATH_CFG_REG</name>
	<description>Breath configuration register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001ff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>BRTH_STEP</name>
	<description>Defines the number of PWM periods minus 1, in which duty cycle will be constant</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>BRTH_DIV</name>
	<description>Defines the breath PWM frequecny. Breath PWM frequency is 16MHz / (BRTH_DIV+1)</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BREATH_CTRL_REG</name>
	<description>Breath control register</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>BRTH_PWM_POL</name>
	<description>Defines the output polarity. '0' line is low in idle state. '1' line is high in idle state.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>BRTH_EN</name>
	<description>'1' enable the Breath operation</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BREATH_DUTY_MAX_REG</name>
	<description>Breath max duty cycle register</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000a</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>BRTH_DUTY_MAX</name>
	<description>Defines the maximum duty cycle of the PWM breath function. Max duty cycle = BRTH_DUTY_MAX / (BRTH_DIV+1)</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
