andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>GPIO_CLK_SEL</name>
	<description>Select which clock to map on port in PPA</description>
	<addressOffset>0x000000d0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FUNC_CLOCK_SEL</name>
	<description>Select which clock to map when PID = FUNC_CLOCK.
0x0: XTAL32K
0x1: RC32K
0x2: RCX
0x3: XTAL16M
0x4: RC16M
0x5: DIVN
0x6: Reserved
0x7: Reserved</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P00_MODE_REG</name>
	<description>P00 Mode Register</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>Function of port
0: GPIO, PUPD see above
1: UART_RX
2: UART_TX
3: UART_IRDA_RX
4: UART_IRDA_TX
5: UART2_RX
6: UART2_TX
7: UART2_IRDA_RX
8: UART2_IRDA_TX
9: UART2_CTSN
10: UART2_RTSN
11: SPI_DI
12: SPI_DO
13: SPI_CLK14: SPI_EN
15: SPI2_DI
16: SPI2_DO
17: SPI2_CLK
18: SPI2_EN
19: I2C_SCL
20: I2C_SDA
21: I2C2_SCL
22: I2C2_SDA
23: PWM0
24: PWM1
25: PWM2
26: PWM3
27: PWM4
28: BLE_DIAG (ble_diag_0: pins P2_0 and P3_0, ble_diag_1: pins P2_1 and P3_1, ble_diag_2: pins P2_2 and P3_2, ble_diag_3: pins P1_0 and P3_3, ble_diag_4: pins P1_1 and P3_4, ble_diag_5: pins P1_2 and P3_5, ble_diag_6: pins P1_3 and P3_6, ble_diag_7: pins P2_3 and P3_7)
29: FTDF_DIAG (ftdf_diag_0: pins P1_4 and P4_0, ftdf_diag_1: pins P1_5 and P4_1, ftdf_diag_2: pins P1_6 and P4_2, ftdf_diag_3: pins P1_7 and P4_3, ftdf_diag_4: pins P0_6 and P4_4, ftdf_diag_5: pins P0_7 and P4_5, ftdf_diag_6: pins P1_3 and P4_6, ftdf_diag_7: pins P2_3 and P4_7)
30: PCM_DI
31: PCM_DO
32: PCM_FSC
33: PCM_CLK
34: PDM_DI
35: PDM_DO
36: PDM_CLK
37: USB_SOF
38: ADC (only for P0[7:6], P1[5:2,0] and P2[4])
38: USB (only for P2[2] and P1[1])
38: XTAL32 (only for P2[1:0])
39: QD_CHA_X
40: QD_CHB_X
41: QD_CHA_Y
42: QD_CHB_Y
43: QD_CHA_Z
44: QD_CHB_Z
45: IR_OUT
46: BREATH
47: KB_ROW
48: COEX_EXT_ACT0
49: COEX_EXT_ACT1
50: COEX_SMART_ACT
51: COEX_SMART_PRI
52: CLOCK
53: ONESHOT
54: PWM5
55: PORT0_DCF
56: PORT1_DCF
57: PORT2_DCF
58: PORT3_DCF
59: PORT4_DCF
60: RF_ANT_TRIM[0]
61: RF_ANT_TRIM[1]
62: RF_ANT_TRIM[2]
63: Reserved</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P01_MODE_REG</name>
	<description>P01 Mode Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P02_MODE_REG</name>
	<description>P02 Mode Register</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P03_MODE_REG</name>
	<description>P03 Mode Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P04_MODE_REG</name>
	<description>P04 Mode Register</description>
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
