andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RAMBIST_STATUS1_REG</name>
	
	<addressOffset>0x000000e2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000036db</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROM_BIST_BUSY</name>
	<description>status of internal signal "busy" of rom bist </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>QSPIRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of qspiram bist </description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>QSPIRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of qspiram bist </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>QSPIRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of qspiram bist </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>USBRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of usbram bist </description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>USBRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of usbram bist </description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>USBRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of usbram bist </description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>CDRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of cdram bist </description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>CDRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of cdram bist </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>CDRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of cdram bist </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>CTRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ctram bist </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>CTRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ctram bist </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>CTRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ctram bist </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SYSRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of sysram bist </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SYSRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of sysram bist </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SYSRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of sysram bist </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RAMBIST_STATUS2_REG</name>
	
	<addressOffset>0x000000e4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000036db</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CRYPTORAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of cryptoram bist </description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>CRYPTORAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of cryptoram bist </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>CRYPTORAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of cryptoram bist </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>ECC_TCMRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ecc_tcmram bist </description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>ECC_TCMRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ecc_tcmram bist </description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>ECC_TCMRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ecc_tcmram bist </description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>ECC_CODERAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ecc_coderam bist </description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ECC_CODERAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ecc_coderam bist </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ECC_CODERAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ecc_coderam bist </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>FTDF_RXRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ftdf_rxram bist </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>FTDF_RXRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ftdf_rxram bist </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FTDF_RXRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ftdf_rxram bist </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FTDF_TXRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ftdf_txram bist </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>FTDF_TXRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ftdf_txram bist </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>FTDF_TXRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail" of ftdf_txram bist </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
