andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RAMBIST_STATUS3_REG</name>
	
	<addressOffset>0x000000e6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FTDF_FPRAM_BIST_BUSY</name>
	<description>status of internal signal "busy" of ftdf_fpram bist</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>FTDF_FPRAM_BIST_FAIL</name>
	<description>status of internal signal "fail" of ftdf_fpram bist</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>FTDF_FPRAM_BIST_LINE_FAIL</name>
	<description>status of internal signal "line_fail"of ftdf_fpram bist</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ROMBIST_RESULTH_REG</name>
	
	<addressOffset>0x000000ea</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROMBIST_RESULTH</name>
	<description>Read version of bist status, result[31:16] </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ROMBIST_RESULTL_REG</name>
	
	<addressOffset>0x000000e8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROMBIST_RESULTL</name>
	<description>Read version of bist status, result[15:0] </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TEST_CTRL2_REG</name>
	
	<addressOffset>0x000000f2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_IN_TESTMUX_CTRL</name>
	<description>Connect the RF input testbus to pins:
Switch 1 (bit 8) connects T0 of the radio test input bus to P0[7]
Switch 2 (bit 9) connects T1 of the radio test input bus to P1[3]
If this bit is 0, the switch is open (not conducting).</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>ANA_TESTMUX_CTRL</name>
	<description>Control of analog test bus switches:
Switch 1 connects T0 of the radio test output bus to P1[7]
Switch 2 connects T1 of the radio test output bus to P1[4]
Switch 3 connects T0 of the analog test output bus to P1[7]
Switch 4 connects T1 of the analog test output bus to P1[4]

0: all switches open
1: only switch 1 closed
2: only switch 2 closed
3: only switch 3 closed
4: only switch 4 closed
5: switches 1 &amp; 2 closed
6: switches 1 &amp; 4 closed
7: switches 2 &amp; 3 closed
8: switches 3 &amp; 4 closed </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TEST_CTRL3_REG</name>
	
	<addressOffset>0x000000f4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_TEST_OUT_PARAM</name>
	<description>Select which test will be enabled on the block selected by the RF output testbus (see </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>VBUS_COMPARATOR_TEST</name>
	<description>Control for the testability of VBUS input on V33 comparator</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RF_TEST_OUT_SEL</name>
	<description>Select a radio block to have its testbus connected to P1[1] and P1[2]. See
Table 7
for more information.
NOTE: all 0 represent no testmode and the testbusses are shorted to ground to prevent floating busses. </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TEST_CTRL4_REG</name>
	
	<addressOffset>0x000000f6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_TEST_IN_PARAM</name>
	<description>Select which test will be enabled on the block selected by the RF output testbus (see </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>RF_TEST_IN_SEL</name>
	<description>Select an RF block to have its test input connected to the input testbus at pins P0[0] and P0[3]. NOTE: all 0 represent no testmode and the testbusses are shorted to ground to prevent floating busses. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TEST_CTRL5_REG</name>
	
	<addressOffset>0x000000f8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>TEST_POR_VBAT_NOK_AVD</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>TEST_VREF_1V2_A</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>TEST_VCONT_A</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>TEST_I_DCDC_FILT</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TEST_BOD_VREF_IN</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>TEST_BOD_VREF_OUT</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TEST_SIMO_BUCK</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TEST_BANDGAP_I_TEST</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TEST_LDO_PLL</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TEST_LDO_ADC</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TEST_LDO_1V8_PA</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TEST_LDO_CORE</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>TEST_LDO_1V8_FLASH</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>TEST_LDO_1V4</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TEST_BUS_TO_AVS</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
