andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>TEST_CTRL_REG</name>
	
	<addressOffset>0x000000f0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>XTAL16M_TRIM_TEST_EN</name>
	<description>0: normal port function, 1: shows xtal16m_trim_sw1_isolated to pin P15 and xtal16m_trim_sw2_isolated to pin P16</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>XTAL16M_TST_SYS</name>
	<description>xtal16m_tst_sys[0]:
'0': Normal operation, '1': Disables the current in the main oscillator stage. Suggested to set it to '1' only when measuring the varicap.
xtal16m_tst_sys[1]:
'0 ': Normal operation, '1': Amplifies by 10 the current passing through a resistor series of the XTAL, compared to the case where this bit is '0'.
The voltage over this resistor series is set to the testbus and it can be measured either on a pin or by the ADC. The resistance value
of this resistor series is determined by CLK_16M_REG.XTAL16_CUR_SET.</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>SHOW_PWR_TST_OUT</name>
	<description>0: Normal operation
1: P1[7:1] = ldo_1v8_flash_ret_enable, ldo_supply_vbat_ok, ldo_supply_usb_ok, ldo_1v8_pa_ret_enable, bandgap_bgr_ok, 0, ldo_vbat_ret_enable
2: P1[7:1] = ldo_vbat_ret_vref_hold, ldo_core_ok, pll_status_reg_isolated_1, ldo_radio_ok,ldo_1v8_pa_ok, ldo_1v8_flash_ok, ldo_supply_usb_enable
3: P1[7:1] = ldo_1v8_flash_ret_vref_hold, vbus_available, newbat, clear_newbat, ldo_1v8_pa_ret_vref_hold, 0, power_on_reset
4: P1[7:1] = comp_v18_pa_high, comp_v18_flash_high, comp_vdd_high, comp_vbus_low, comp_vbus_high, comp_v33_high, comp_vbat_ok
5: P1[7:1] = charge_gate_enable, bod_v18_pa_low, bod_v33_low, bod_v18_flash_low, bod_vdd_low, bod_vbat_low, bod_clk
</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>SHOW_TXDAC_MOD</name>
	<description>0: Normal operation
1: show the TxDAC_MOD bus on P1[6:4]</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>PLL_TST_MODE</name>
	<description>0: Normal operation
1: Show the PLL test mode signals:
P07 = RCLK
P16 = NCLK
P13 = CP_UP
P11 = CP_DOWN
Notes:
- The control signal should go to the radio to enable this test mode. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SHOW_IF_RO</name>
	<description>0: Normal Port function.
1: Show IF filter Reference Oscillator I and Q signals.
P10 = iff_ro_out_i
P06 = iff_ro_out_q </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>XTAL16M_CAP_TEST_EN</name>
	<description>0: Normal Port function.
1: Show xtal16m_cap_test_outoutput P1[1:0]
Notes:
- The control signal should go to the radio to enable this test mode.
- This register should be zero during scan test! </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SHOW_DCDC_TESTBUS</name>
	<description>0: normal port function
1: map the DCDC testbus [11:0] on the following GPIO's (MSB first): P23,P21,P20,P1[7:0],P07</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SHOW_PLL_TEST_OUT</name>
	<description>0: normal port function
1: map pll_out_div_test_out on P06 and pll_loop_div_test_out on P10</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ENABLE_RFPT</name>
	<description>0: normal port function
1: enable the RF Production Test Unit. Used to store RX ADC samples or PLL TDC samples in SRAM.
See RFPT_CTRL_REG, RFPT_ADDR_REG and RFPT_LEN_REG for details. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SHOW_CLOCKS</name>
	<description>0: normal port function
1: show DIVN clock on P10
</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPREG</name>
	<version>1.0</version>
	<description>GPREG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003300</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>26</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>BLE_FINECNT_SAMP_REG</name>
	<description>BLE FINECNT sampled value while in deep sleep state.</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>BLE_FINECNT_SAMP</name>
	<description>This register is located at the Always On Power Domain and it holds the automatically sampled value of the BLE FINECNT timer
The HW automatically samples the value into this register during the sequence of "BLE Sleep On" and restores automatically the value during the BLE Wake up sequence.
The Software may read and modify the value while the BLE is in Sleep state. While the BLE is awake, the value of the register has no meaning, while changing the value by writing another one will have no effect in the operation of the BLE core.</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DEBUG_REG</name>
	<description>Various debug information register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DEBUGS_FREEZE_EN</name>
	<description>Default '1', freezing of the on-chip timers is enabled when the Cortex-M0 is halted in DEBUG State.
If '0', freezing of the on-chip timers is depending on FREEZE_REG when the Cortex-M0 is halted in DEBUG State except the watchdog timer. The watchdog timer is always frozen when the Cortex-M0 is halted in DEBUG State.
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
