andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>ECC_BASE_ADDR_REG</name>
	<description>Base address of the ECC Crypto memory register.</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ECC_BASE_ADDR</name>
	<description>Contains the base address of the ECC Crypto memory.
Memory allocation is in pages of 1KB and up to 127KB.
Since the ECC has an address range of 2KB and the total addressable memory range is 128KB, the maximum value of 0x7F (127KB offset) will result in 1KB at the top of the memory range and the other 1KB at the bottom of the memory range.</description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>GP_CONTROL_REG</name>
	<description>General purpose system control register.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>BLE_WAKEUP_LP_IRQ</name>
	<description>The current value of the BLE_WAKEUP_LP_IRQ interrupt request.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>BLE_H2H_BRIDGE_BYPASS</name>
	<description>If '1', the AHB-to-AHB bridge is bypassed, needed to access the BLE Register file, only when the system clock source is the XTAL and both hclk and ble_hclk are running at 16MHz, i.e. at the XTAL clock rate.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>BLE_WAKEUP_REQ</name>
	<description>If '1', the BLE wakes up. Must be kept high at least for 1 low power clock period. 
If the BLE is in deep sleep state, then by setting this bit it will cause the wakeup LP IRQ to be asserted with a delay of 3 to 4 low power cycles.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>GP_STATUS_REG</name>
	<description>General purpose system status register.</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAL_PHASE</name>
	<description>If '1', it designates that the chip is in Calibration Phase i.e. the OTP has been initially programmed but no Calibration has occured. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LED_CONTROL_REG</name>
	<description>Controls muxing and enabling of the LEDs.</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LED_TRIM</name>
	<description>LED current trimming bits.</description>
	<access>read-write</access>
	<bitRange>[9:6]</bitRange>
	
</field><field>
	<name>LED3_EN</name>
	<description>0: LED3 disabled,
1: LED3 enabled.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LED2_EN</name>
	<description>0: LED2 disabled,
1: LED2 enabled.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LED1_EN</name>
	<description>0: LED1 disabled,
1: LED1 enabled.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LED3_SRC_SEL</name>
	<description>0: LED3 = PWM4,
1: LED3 = Breathing Timer.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LED2_SRC_SEL</name>
	<description>0: LED2 = PWM3,
1: LED2 = Breathing Timer.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LED1_SRC_SEL</name>
	<description>0: LED1 = PWM2,
1: LED1 = Breathing Timer.
Note: The PWM2/3/4 can also be routed to GPIOs using PID 25/26/27 respectively.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL1_REG</name>
	<description>System PLL control register 1.</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_R_DIV</name>
	<description>PLL Output dvider R (x means divide by x, 0 means divide by 1)</description>
	<access>read-write</access>
	<bitRange>[14:8]</bitRange>
	
</field><field>
	<name>LDO_PLL_VREF_HOLD</name>
	<description>0: indicates that the reference input is tracked,
1: indicates that the reference input is sampled.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LDO_PLL_ENABLE</name>
	<description>0: LDO PLL off,
1: LDO PLL on.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PLL_EN</name>
	<description>0: Power down
1: PLL on </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL2_REG</name>
	<description>System PLL control register 2.</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002006</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_SEL_MIN_CUR_INT</name>
	<description>0: VCO current read from min_current &lt;5:0&gt;,
1: VCO current is internally determined with a calibration algoritm.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>PLL_DEL_SEL</name>
	<description>PLL manual delay value for Phase Frequency Detector.
0: 0.493
1: 0.814
2: 1.13 ns &lt;- default
3: 1.44 ns </description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>PLL_N_DIV</name>
	<description>PLL Loop divider N (x means divide by x, 0 means divide by 1) </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
