andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL3_REG</name>
	<description>System PLL control register 3.</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00003c09</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_RECALIB</name>
	<description>Recalibrate</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>PLL_START_DEL</name>
	<description>Programmable delay time for the loop filter voltage preset value. After PLL_EN is set, the loopfilter precharge resistors are disabled after this delay time. One LSB is 48 ns </description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>PLL_ICP_SEL</name>
	<description>PLL charge pump current select
One LSB is 5uA. </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL_SYS_STATUS_REG</name>
	<description>System PLL status register.</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_CALIBR_END</name>
	<description>Indicates that calibration has finished.</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>PLL_PLL_BEST_MIN_CUR</name>
	<description>Calibrated VCO frequency band.</description>
	<access>read-only</access>
	<bitRange>[10:5]</bitRange>
	
</field><field>
	<name>LDO_PLL_OK</name>
	<description>1: Indicates that LDO PLL is in regulation.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PLL_LOCK_FINE</name>
	<description>1: PLL locked </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL_SYS_TEST_REG</name>
	<description>System PLL test register.</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000070</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_LOCK_DET_RES_CNT</name>
	<description>Lock measurement time in &lt;tbd&gt; clock cycle of xx usec. After this period PLL_LOCK_FINE is calculated based on the difference of the M and N counted pulses in that period. If PLL_LOCK_FINE is still 0, the lock state machine restarts until PLL_LOCK_FINE gets 1
0: &lt;tbd&gt; usec
7: &lt;tbd&gt; usec </description>
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>PLL_SEL_R_DIV_TEST</name>
	<description>Select test mode for output divider R
Maps PLL_R_DIV input on pins &lt;tbd&gt; and divider output on pin &lt;tbd&gt; </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>PLL_SEL_N_DIV_TEST</name>
	<description>Select test mode for loop divider N.
Maps PLL_N_DIV input on pins &lt;tbd&gt; and divider output on pin &lt;tbd&gt; </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PLL_CHANGE</name>
	<description>0: normal value
1: reverse charge pump up/down signals </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>PLL_OPEN_LOOP</name>
	<description>1: set to open loop to termine max frequency </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>PLL_TEST_VCTR</name>
	<description>1: map loopfilter voltage on external pin &lt;tbd&gt; </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>PLL_MIN_CURRENT</name>
	<description>VCO current trimming.</description>
	<access>read-write</access>
	<bitRange>[6:1]</bitRange>
	
</field><field>
	<name>PLL_DIS_LOOPFILT</name>
	<description>1: disable PLL internal loop filter </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RESET_FREEZE_REG</name>
	<description>Controls unfreezing of various timers/counters (incl. DMA and USB).</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FRZ_SWTIM2</name>
	<description>If '1', the SW Timer (TIMER2) continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM1</name>
	<description>If '1', the SW Timer (TIMER1) continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>FRZ_DMA</name>
	<description>If '1', the DMA continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>FRZ_USB</name>
	<description>If '1', the USB continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FRZ_WDOG</name>
	<description>If '1', the watchdog timer continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FRZ_BLETIM</name>
	<description>If '1', the BLE master clock continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM0</name>
	<description>If '1', the SW Timer (TIMER0) continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>FRZ_WKUPTIM</name>
	<description>If '1', the Wake Up Timer continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SET_FREEZE_REG</name>
	<description>Controls freezing of various timers/counters (incl. DMA and USB).</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FRZ_SWTIM2</name>
	<description>If '1', the SW Timer (TIMER2) is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM1</name>
	<description>If '1', the SW Timer (TIMER1) is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>FRZ_DMA</name>
	<description>If '1', the DMA is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>FRZ_USB</name>
	<description>If '1', the USB is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FRZ_WDOG</name>
	<description>If '1', the watchdog timer is frozen, '0' is discarded. WATCHDOG_CTRL_REG[NMI_RST] must be '0' to allow the freeze function. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FRZ_BLETIM</name>
	<description>If '1', the BLE master clock is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM0</name>
	<description>If '1', the SW Timer (TIMER0) is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>FRZ_WKUPTIM</name>
	<description>If '1', the Wake Up Timer is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
