andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>I2C2_TX_TL_REG</name>
	<description>I2C Transmit FIFO Threshold Register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>TX_TL</name>
	<description>Transmit FIFO Threshold Level Controls the level of entries (or below) that trigger the TX_EMPTY interrupt (bit 4 in I2C_RAW_INTR_STAT register). The valid range is 0-3, a value of 0 sets the threshold for 0 entries, and a value of 3 sets the threshold for 4 entries.. </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>IR</name>
	<version>1.0</version>
	<description>IR registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001700</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>20</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>IR_CTRL_REG</name>
	<description>IR control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>IR_IRQ_EN</name>
	<description>1 = Enables the interrupt generation upon TX completion
0 = masks out the interrupt generation upon TX completion
</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>IR_LOGIC_ONE_FORMAT</name>
	<description>1 = Logic one starts with a Space followed by a Mark
0 = Logic one starts with a Mark followed by a Space
</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>IR_LOGIC_ZERO_FORMAT</name>
	<description>1 = Logic zero starts with a Space followed by a Mark
0 = Logic zero starts with a Mark followed by a Space</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>IR_INVERT_OUTPUT</name>
	<description>1 = IR output is inverted
0 = IR output is not inverted
</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>IR_REPEAT_TYPE</name>
	<description>1 = repeat command is defined at Repeat FIFO
0 = repeat command is defined at Code FIFO
</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>IR_TX_START</name>
	<description>1 = IR transmits a command
0 = IR is stopped
While this bit is 1 and SW programs it to 0, the code FIFO will be flushed automatically.
</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>IR_ENABLE</name>
	<description>1 = IR block is enabled
0 = IR block is disabled and at reset state. This also resets the pointers at the FIFOs
</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>IR_REP_FIFO_RESET</name>
	<description>1 = Flush Repeat FIFO (auto clear)</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>IR_CODE_FIFO_RESET</name>
	<description>1 = Flush Code FIFO (auto clear)</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>IR_FREQ_CARRIER_OFF_REG</name>
	<description>Defnes the carrier signal low duration</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>IR_FREQ_CARRIER_OFF</name>
	<description>Defines the carrier signal low duration in IR_clk cycles</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>IR_FREQ_CARRIER_ON_REG</name>
	<description>Defines the carrier signal  high duration</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>IR_FREQ_CARRIER_ON</name>
	<description>Defines the carrier signal high duration in IR_clk cycles. 0x0 is not allowed as a value.</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>IR_IRQ_STATUS_REG</name>
	<description>IR interrupt status register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>IR_IRQ_ACK</name>
	<description>When read Interrupt line is cleared</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>IR_LOGIC_ONE_TIME_REG</name>
	<description>Defines the logic one waveform</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000101</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IR_LOGIC_ONE_MARK</name>
	<description>Defines the mark duration in carrier clock cycles. Must be &gt;0</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>IR_LOGIC_ONE_SPACE</name>
	<description>Defines the space duration in carrier clock cycles. Must be &gt;0</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>IR_LOGIC_ZERO_TIME_REG</name>
	<description>Defines the logic zero wavefrom</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000101</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IR_LOGIC_ZERO_MARK</name>
	<description>Defines the mark duration in carrier clock cycles. Must be &gt;0</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>IR_LOGIC_ZERO_SPACE</name>
	<description>Defines the space duration in carrier clock cycles. Must be &gt;0</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
