andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>IR_MAIN_FIFO_REG</name>
	<description>Main fifo write register</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IR_CODE_FIFO_DATA</name>
	<description>Code FIFO data write port</description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>IR_REPEAT_FIFO_REG</name>
	<description>Repeat fifo write register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IR_REPEAT_FIFO_DATA</name>
	<description>Repeat FIFO data write port</description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>IR_REPEAT_TIME_REG</name>
	<description>Defines the repeat time</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IR_REPEAT_TIME</name>
	<description>Defines the repeat time in carrier clock cycles. The repeat timer will start counting from the start of the command and will trigger the output of the same command residing in the Code FIFO or the special command residing in the Repeat FIFO as soon as it expires.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>IR_STATUS_REG</name>
	<description>IR status register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>IR_BUSY</name>
	<description>1 = IR generator is busy sending a message
0 = IR generator is idle
</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>IR_REP_FIFO_WRDS</name>
	<description>Contains the amount of words in Repeat FIFO (updated only on write)</description>
	<access>read-only</access>
	<bitRange>[9:6]</bitRange>
	
</field><field>
	<name>IR_CODE_FIFO_WRDS</name>
	<description>Contains the amount of words in Code FIFO (updated only on write)</description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>KBSCAN</name>
	<version>1.0</version>
	<description>KBSCAN registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001600</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>92</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>KBSCN_CTRL2_REG</name>
	<description>Keyboard scanner control 2 register</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>KBSCN_ROW_ACTIVE_TIME</name>
	<description>Define the row active time in keyboard clock cycles</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_CTRL_REG</name>
	<description>Keyboard scanner control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>KBSCN_RESET_FIFO</name>
	<description>'1' reset fifo, read always '0'</description>
	<access>write-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>KBSCN_CLKDIV</name>
	<description>Defines keyboard clk. "00" div/1, "01" div/4, "10" div/16, "11" div/64</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>KBSCN_INACTIVE_EN</name>
	<description>'1' After inactive time the keyboard scanner stops the key maxtrix scan</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>KBSCN_INACTIVE_TIME</name>
	<description>Defines the inactive time in scan cycles. Value 0 is not allowed</description>
	<access>read-write</access>
	<bitRange>[10:4]</bitRange>
	
</field><field>
	<name>KBSCN_IRQ_FIFO_MASK</name>
	<description>'1' Enable IRQ for fifo over and under flow</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>KBSCN_IRQ_INACTIVE_MASK</name>
	<description>'1' : Enable IRQ for inactive</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>KBSCN_IRQ_MESSAGE_MASK</name>
	<description>'1' : Enable IRQ for message</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>KBSCN_EN</name>
	<description>'1' : Enable keyboard scanner, Auto clear when inactive enable and inactive case</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_DEBOUNCE_REG</name>
	<description>Defines the debounce time for key press and release</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000082</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>KBSCN_DEBOUNCE_PRESS_TIME</name>
	<description>Defines the press debounce time in cycles of full matrix scan. One means no debounce, zero is reserved</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>KBSCN_DEBOUNCE_RELEASE_TIME</name>
	<description>Defines the press debounce time in cycles of full matrix scan. One means no debounce, zero is reserved</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_MATRIX_SIZE_REG</name>
	<description>Defines the number of rows and columns of the matrix</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>KBSCN_MATRIX_COLUMN</name>
	<description>Defines the number of the columns of the keyboard matrix minus 1. Zero means number of columns 1</description>
	<access>read-write</access>
	<bitRange>[8:4]</bitRange>
	
</field><field>
	<name>KBSCN_MATRIX_ROW</name>
	<description>Defines the number of the rows of the keyboard matrix minus 1. Zero means number of rows 1</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
