andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>KBSCN_P07_MODE_REG</name>
	<description>Defines the keyboard mode for P07</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P10_MODE_REG</name>
	<description>Defines the keyboard mode for P10</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P11_MODE_REG</name>
	<description>Defines the keyboard mode for P11</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P12_MODE_REG</name>
	<description>Defines the keyboard mode for P12</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P13_MODE_REG</name>
	<description>Defines the keyboard mode for P13</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P14_MODE_REG</name>
	<description>Defines the keyboard mode for P14</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P15_MODE_REG</name>
	<description>Defines the keyboard mode for P15</description>
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P16_MODE_REG</name>
	<description>Defines the keyboard mode for P16</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
