andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>KBSCN_P17_MODE_REG</name>
	<description>Defines the keyboard mode for P17</description>
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P20_MODE_REG</name>
	<description>Defines the keyboard mode for P20</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P21_MODE_REG</name>
	<description>Defines the keyboard mode for P21</description>
	<addressOffset>0x0000002e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P22_MODE_REG</name>
	<description>Defines the keyboard mode for P22</description>
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P23_MODE_REG</name>
	<description>Defines the keyboard mode for P23</description>
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P24_MODE_REG</name>
	<description>Defines the keyboard mode for P24</description>
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P30_MODE_REG</name>
	<description>Defines the keyboard mode for P30</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P31_MODE_REG</name>
	<description>Defines the keyboard mode for P31</description>
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
