andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>KBSCN_P32_MODE_REG</name>
	<description>Defines the keyboard mode for P32</description>
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P33_MODE_REG</name>
	<description>Defines the keyboard mode for P33</description>
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P34_MODE_REG</name>
	<description>Defines the keyboard mode for P34</description>
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P35_MODE_REG</name>
	<description>Defines the keyboard mode for P35</description>
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P36_MODE_REG</name>
	<description>Defines the keyboard mode for P36</description>
	<addressOffset>0x00000048</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P37_MODE_REG</name>
	<description>Defines the keyboard mode for P37</description>
	<addressOffset>0x0000004a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P40_MODE_REG</name>
	<description>Defines the keyboard mode for P40</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P41_MODE_REG</name>
	<description>Defines the keyboard mode for P41</description>
	<addressOffset>0x0000004e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
