andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>KBSCN_P42_MODE_REG</name>
	<description>Defines the keyboard mode for P42</description>
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P43_MODE_REG</name>
	<description>Defines the keyboard mode for P43</description>
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P44_MODE_REG</name>
	<description>Defines the keyboard mode for P44</description>
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P45_MODE_REG</name>
	<description>Defines the keyboard mode for P45</description>
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P46_MODE_REG</name>
	<description>Defines the keyboard mode for P46</description>
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_P47_MODE_REG</name>
	<description>Defines the keyboard mode for P47</description>
	<addressOffset>0x0000005a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>KBSCN_STATUS_REG</name>
	<description>keyboard scanner Interrupt status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>KBSCN_FIFO_UNDERFL</name>
	<description>'1' Fifo Underflow occurred</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>KBSCN_FIFO_OVERFL</name>
	<description>'1' Fifo Overflow occurred</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>KBSCN_NUM_MESSAGE</name>
	<description>Defines how many messages there are in the fifo.</description>
	<access>read-only</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>KBSCN_INACTIVE_IRQ_STATUS</name>
	<description>There is no keyboard activity for a predefined time</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>KBSCN_MES_IRQ_STATUS</name>
	<description>There is at least one last message in the fifo. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
