andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>OTPC</name>
	<version>1.0</version>
	<description>OTPC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x07f40000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>52</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>OTPC_AHBADR_REG</name>
	<description>AHB master start address</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07fc0000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_AHBADR</name>
	<description>It is the AHB address used by the AHB master interface of the controller (the bits [31:2]). The bits [1:0] of the address are considered always as equal to zero.
The value of the register remains unchanged, by the internal logic of the controller. </description>
	<access>read-write</access>
	<bitRange>[31:2]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_CELADR_REG</name>
	<description>Macrocell start address</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_CELADR_LV</name>
	<description>This is a readonly field that contains the "live" value of the OTP cell address as it is used by the hardware of the OTPC controller during the AREAD and the APROG modes. The value of the register is updated only while the OTPC is in AREAD or the APROG mode. </description>
	<access>read-only</access>
	<bitRange>[29:16]</bitRange>
	
</field><field>
	<name>OTPC_CELADR</name>
	<description>It represents an OTP address, where the OTP word width should be considered equal to 32-bits.
The physical word width of the OTP memory is 72 bits. The 8-bits of them are used for the implementation of an error correcting code and are not available for the application. The remaining 64 bits of the physical word are available for the application. 
The OTPC_CELADDR can distinguish the upper 32 bits from the lower 32 bits of the available for the application bits of the OTP word.
When OTPC_CELADDR[0] = 1 the address refers to the upper 32 bits of the physical OTP address OTPC_CELADDR[14:1].
The register is used during the modes: AREAD and APROG.
The value of the register remains unchanged, by the internal logic of the controller.</description>
	<access>read-write</access>
	<bitRange>[13:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_FFPRT_REG</name>
	<description>Ports access to fifo logic</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_FFPRT</name>
	<description>Provides access to the fifo through an access port.
Write to this register with the corresponding data, when the APROG mode is selected and the dma is disabled.
Read from this register the corresponding data, when the AREAD mode is selected and the dma is disabled.
The software should check the OTPCC_STAT_FWORDS register for the availability of data/space, before accessing the fifo.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_FFRD_REG</name>
	<description>The data which have taken with the latest read from the OTPC_FFPRT_REG</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_FFRD</name>
	<description>Contains the value which taken from the fifo, after a read of the OTPC_FFPRT_REG register. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_MODE_REG</name>
	<description>Mode register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_MODE_RLD_RR_REQ</name>
	<description>Write with 1 in order to be requested the reloading of the repair records. The reloading of the repair records will be performed at the next enabling of the OTP cell. That means that first the controller should be configured to the STBY mode and after should be activated any other mode. The hardware will clear this register, when the reloading will be performed.
The reloading has meaning only if the repair records have been updated manually (MPROG mode).</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>OTPC_MODE_USE_SP_ROWS</name>
	<description>Selects the memory area of the OTP cell that will be used.
0: Uses the normal memory area of the OTP cell
1: Uses the spare rows of the OTP cell
This selection has meaning only if the mode of the controller is not TDEC and TWR. The controller should be in STBY mode, in order to takes into account this bit. The selection will take effect at the next mode that will be enabled.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>OTPC_MODE_ERR_RESP_DIS</name>
	<description>When is performed a read from the OTP memory in the MREAD mode, a double error is likely be detected during the retrieving of the data from the OTP. This error condition is always indicated in the status bit OTPC_STAT_REG[OTPC_STAT_RERROR]. However, the OTP controller has also the ability to indicates this error condition, by generating an ERROR response in the AHB bus.
The generation of the ERROR response can be avoided with the help of this configuration bit.
0: The OTP controller generates an ERROR response in the AHB bus, when a double error is detected during a reading in MREAD mode. The OTPC_STAT_REG[OTPC_STAT_RERROR] is also updated. The receiving of an ERROR response by the CPU causes a Hard Fault exception in the CPU.
1: Only the OTPC_STAT_REG[OTPC_STAT_RERROR] is updated in a case of such error. The OTP controller will not generate an ERROR response in the AHB bus.
</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>OTPC_MODE_FIFO_FLUSH</name>
	<description>By writing with 1, removes any content from the fifo. This bit returns automatically to value 0. </description>
	<access>write-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>OTPC_MODE_USE_DMA</name>
	<description>Selects the use of the dma, when the controller is configured in one of the modes: AREAD or APROG.
0: The dma is not used. The data should be transferred from/to controller through the register OTPC_FFPRT_REG.
1: The dma is used. The data transfers from/to controller are performed automatically, with the help of the internal DMA of the OTP controller. The AHB base address should be configured in register OTPC_AHBADR_REG, before the selection of one of the two modes: AREAD or APROG.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>OTPC_MODE_MODE</name>
	<description>Defines the mode of operation of the OTPC controller. The encoding of the modes is as follows:
0x0: STBY mode
0x1: MREAD mode
0x2: MPROG mode
0x3: AREAD mode
0x4: APROG mode
0x5: TBLANK mode
0x6: TDEC mode
0x7: TWR mode </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
