andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>OTPC_NWORDS_REG</name>
	<description>Number of words</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_NWORDS</name>
	<description>The number of words (minus one) for reading /programming during the AREAD/APROG mode.
The width of the word should be considered equal to 32-bits.
The value of the register remains unchanged, by the internal logic of the controller.
During mirroring, this register reflects the current ammount of copied data.</description>
	<access>read-write</access>
	<bitRange>[13:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_PCTRL_REG</name>
	<description>Bit-programming control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_PCTRL_PSTART</name>
	<description>Write with '1' to trigger the programming of one OTP word, in the case where the MPROG mode is selected. The bit is cleared automatically. The 64-bits that will be programmed into the OTP memory are contained into the two registers OTPC_PWORDx_REG.
This bit should be used when a new programming is initiated, but also when the programming must be retried.
The OTPC_PCTRL_WADDR defines the OTP position where will be performed the programming.</description>
	<access>write-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>OTPC_PCTRL_PRETRY</name>
	<description>It distinguishes the first attempt of a programming of an OTP position, from a retry of programming.
0: A new value will be programmed in a blank OTP position. The hardware will try to write all the bits that are equal to '1'.
1: The programming that is applied is not the first attempt, but is a request for reprogramming. Will be processed only the bits that were failed to be programmed during the previous attempt. The hardware knows the bits that were failed during the previous attempt.
The registers OTPC_PWORDx_REG should contain the 64 bits of the value that should be programmed, independent of the value of the OTPC_PCTRL_PRETRY bit.
Also, the OTPC_PCTRL_WADDR should contain always the required OTP address.
A retry of a programming should be requested only if the previous action was the first attempt of programming or a retry of programming. Should not be requested a retry if the first attempt has not been performed.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>OTPC_PCTRL_WADDR</name>
	<description>Defines the OTP position where will be programmed the 64-bits that are contained into the registers OTPC_PWORDx_REG. It points to a physical 72 bits OTP word.</description>
	<access>read-write</access>
	<bitRange>[12:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_PWORDH_REG</name>
	<description>The 32 higher bits of the 64-bit word that will be programmed, when the MPROG mode is used.</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_PWORDH</name>
	<description>Contains the upper 32 bits that can be programmed with the help of the OTPC_PCTRL_REG, while the controller is in MPROG mode.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_PWORDL_REG</name>
	<description>The 32 lower bits of the 64-bit word that will be programmed, when the MPROG mode is used.</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_PWORDL</name>
	<description>Contains the lower 32 bits that can be programmed with the help of the OTPC_PCTRL_REG, while the controller is in MPROG mode.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_STAT_REG</name>
	<description>Status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000051</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_STAT_NWORDS</name>
	<description>It contains the "live" value of the number of (32 bits) words that remain to be processed by the controller.</description>
	<access>read-only</access>
	<bitRange>[29:16]</bitRange>
	
</field><field>
	<name>OTPC_STAT_FWORDS</name>
	<description>Indicates the number of words which contained in the fifo of the controller.</description>
	<access>read-only</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>OTPC_STAT_RERROR</name>
	<description>Indicates that during a normal reading (MREAD or AREAD) was reported a double error by the SECDED logic. That means that the data are corrupted.
0: The read data are considered as correct.
1: The SECDED logic detects a double error.
This bit can be cleared only with a write with '1'.
</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>OTPC_STAT_ARDY</name>
	<description>Should be used to monitor the progress of the AREAD and APROG modes.
0: One of the APROG or AREAD mode is selected. The controller is busy.
1: The controller is not in an active AREAD or APROG mode.
</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>OTPC_STAT_TERROR</name>
	<description>Indicates the result of a test sequence. Should be checked after the end of a TBLANK, TDEC and TWR mode (OTPC_STAT_TRDY = 1).
0: The test sequence ends with no error.
1: The test sequence has failed.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>OTPC_STAT_TRDY</name>
	<description>Indicates the state of a test mode. Should be used to monitor the progress of the TBLANK, TDEC and TWR modes.
0: The controller is busy. One of the test modes is in progress.
1: There is no active test mode.</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>OTPC_STAT_PZERO</name>
	<description>Indicates that the programming sequence has been avoided during a programming request, due to that the word that should be programmed is equal to zero.
0: At least one bit has been programmed into the OTP.
1: The programming has not been performed. All the bits of the word that should be programmed are equal to zero.
When the controller is in MPROG mode, this bit can be checked after the end of the programming process (OTPC_STAT_PRDY = 1).
During APROG mode, the value of this field it is normal to changing periodically. After the end of the APROG mode (OTPC_STAT_ARDY = 1), this field indicates that one or more of words that have been processed are equal to zero.</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>OTPC_STAT_PERR_COR</name>
	<description>Indicates that a correctable error has been occurred during the word programming process.
0: There is no correctable error in the word-programming process.
1: The process of word - programming reported a correctable error.
The correctable error occurs when exactly one bit in an OTP position cannot take the required value. This is not a critical failure in the programming process. The data can still be retrieved correctly by the OTP memory, due to that the error correcting algorithm can repair the corrupted bit.
When the controller is in MPROG mode, this bit can be checked after the end of the programming process (OTPC_STAT_PRDY = 1).
During APROG mode, the value of this field it is normal to changing periodically. After the end of the APROG mode (OTPC_STAT_ARDY = 1), this field indicates that one or more words had a correctable error.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>OTPC_STAT_PERR_UNC</name>
	<description>Indicates that an uncorrectable error has been occurred during the word programming process.
0: There is no uncorrectable error in the word-programming process.
1: The process of word-programming failed due to an uncorrectable error.
An uncorrectable error is considered when two or more of the bits in an OTP position cannot take the required values. This is a critical failure in the programming process, which means that the data cannot corrected by the single error correcting algorithm.
When the controller is in MPROG mode, this bit should be checked after the end of the programming process (OTPC_STAT_PRDY = 1).
During APROG mode, the value of this field it is normal to changing periodically. After the end of the APROG mode (OTPC_STAT_ARDY = 1), this field indicates if the programming was failed or ended successfully.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>OTPC_STAT_PRDY</name>
	<description>Indicates the state of a bit-programming process.
0: The controller is busy. A bit-programming is in progress
1: The logic which performs bit-programming is idle.
When the controller is in MPROG mode, this bit should be used to monitor the progress of a programming request.
During APROG mode, the value of this field it is normal to changing periodically. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
