andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>OTPC_TEST_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_USED_RR</name>
	<description>Indicates the source from which have been retrieved the data when is performed a reading from the OTP memory. This bit is updated after every reading from the OTP memory.
0: The data have been retrieved from the OTP memory itself.
1: The data have been retrieved from a repair record and not for the OTP memory itself.

When OTPC_USED_RR=1, the OTPC_SECDED_STAT and the OTPC_SECDED_RAW_ECC are invalid.</description>
	<access>read-only</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>OTPC_SECDED_STAT</name>
	<description>This is the status of the SECDED circuit, after the decoding of a retrieved word. It is updated every time where a new OTP word is retrieved from the OTP memory.This field is invalid when the OTPC_USED_RR is equal to 1.
0x0: No error
0x1: A single bit error has been detected.
0x2: A double bit error has been detected
0x3: A single bit error has been detected. The corrupted bit is the parity bit.

This field is valid even when OTPC_SECDED_COR_DIS=1.</description>
	<access>read-only</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>OTPC_SECDED_RAW_ECC</name>
	<description>This is the raw value of the SECDED ECC as has been retrieved from the OTP memory. It is updated every time where a new OTP word is retrieved from the OTP memory.This field is invalid when the OTPC_USED_RR is equal to 1.</description>
	<access>read-only</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>OTPC_SECDED_COR_DIS</name>
	<description>This bit is for test purposes and controls the correction that is applied by the SECDED during the normal read of the OTP memory.
0: The SECDED correction is applied in the word that is retrieved from the OTP memory. The OTPC_STAT_RERROR is updated after each read from the OTP memory. The generation of an AHB ERROR is controlled by the OTPC_MODE_ERR_RESP_DIS.
1: The SECDED correction is not applied. The data that are returned by the OTP controller is the raw data that is contained in the OTP memory. The OTPC_STAT_RERROR is not updated and there is no generation of an AHB ERROR response in a case of a double error.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_TIM1_REG</name>
	<description>Various timing parameters of the OTP cell.</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1a104f20</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_TIM1_CC_T_25NS</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval at least higher than 25 ns.</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_CC_T_200NS</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval at least higher than 200 ns.</description>
	<access>read-write</access>
	<bitRange>[30:27]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_CC_T_500NS</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval at least higher than 500 ns</description>
	<access>read-write</access>
	<bitRange>[26:22]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_CC_T_1US</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval at least higher than 1 us.</description>
	<access>read-write</access>
	<bitRange>[21:16]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_CC_T_PW</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval that is
- at least higher than 4.8 us
- and lower than 5.2 us
It is preferred the programmed value to give a time interval equal to 5 us.
It defines the duration of the programming pulse for every bit that written in the OTP cell.</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_CC_T_CADX</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval at least higher than 2 us. It is used as a wait time each time where the OTP cell is enabled.</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_TIM2_REG</name>
	<description>Various timing parameters of the OTP cell.</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00010000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_TIM2_RDENL_PROT</name>
	<description>This bit has meaning only when the OTPC_TIM1_CC_T_25NS = 1, otherwise has no functionality. 
0: The minimum number of clock cycles for which the signal read_enable of the OTP memory stays inactive is one clock cycle. This is also applicable if OTPC_TIM1_CC_T_25NS = 0.
1: The minimum number of clock cycles for which the signal read_enable of the OTP memory stays inactive is two clock cycles. The controller adds one extra wait state in the AHB access , if it is required, in order to achieves this constraint. This setting is applicable only if OTPC_TIM1_CC_T_25NS = 1.</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_CC_T_BCHK</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval between 100 ns and 200 ns. This time interval is used for the reading of the contents of the OTP cell during the TBLANK mode.</description>
	<access>read-write</access>
	<bitRange>[22:16]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_CC_STBY_THR</name>
	<description>This register controls a power saving feature, which is applicable only in MREAD mode. The controller monitors the accesses in the OTP cell. If there is no access for more than OTPC_TIM2_CC_STBY_THR hclk_c clock cycles, the OTP cell goes to the standby while the controller itself remains in the MREAD mode. The OTP cell will be enabled again when will be applied a new read request. The enabling of the OTP cell has a cost of 2 us (OTPC_TIM1_CC_T_CADX hclk_c clock cycles).
When OTPC_TIM2_CC_STBY_THR = 0 the power saving feature is disabled and the OTP cell remains active while the controller is in MREAD mode.</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
