andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>PATCH_DATA26_REG</name>
	<description>Patch Data field</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_DATA</name>
	<description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_DATA27_REG</name>
	<description>Patch Data field</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_DATA</name>
	<description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_VALID_REG</name>
	<description>Validity Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_VALID</name>
	<description>Indicates which patch entry is valid. For example, when bit x is high it indicates that entry x is valid, i.e. the values of PATCH_ADDRx_REG / PATCH_DATAx_REG, are effective. </description>
	<access>read-write</access>
	<bitRange>[27:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_VALID_RESET_REG</name>
	<description>Validity Reset Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_VALID</name>
	<description>Writing to this register, it will clear to "0" the bits of PATCH_VALID_REG that correspond to the bits with "1" of the PATCH_VALID_RESET_REG write value.</description>
	<access>write-only</access>
	<bitRange>[27:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_VALID_SET_REG</name>
	<description>Validity Set Control Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_VALID</name>
	<description>Writing to this register, it will set to "1" the bits of PATCH_VALID_REG that correspond to the bits with "1" of the PATCH_VALID_SET_REG write value.</description>
	<access>write-only</access>
	<bitRange>[27:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>PLLDIG</name>
	<version>1.0</version>
	<description>PLLDIG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002d00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>114</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>RF_BMCW_REG</name>
	
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>HSI_SEL</name>
	<description>Select between:
1 = use HSI_WR as HSI
0 = use HSI from the MAC attributes (normal function). </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>CN_SEL</name>
	<description>Select between:
1 = use CN_WR as channel number
0 = use BLE/FTDF Frequency word (normal function). </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>HSI_WR</name>
	<description>HSI functionality. When set, the LO frequency is 1 MHz below the channel frequency
</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>CN_WR</name>
	<description>[5:0] = Channel Number </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CALCAP1_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000502a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_CALCAP_LOW</name>
	<description>Lowest 16 bits of vco_calcap </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CALCAP2_REG</name>
	
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_CALCAP_HIGH</name>
	<description>Highest 2 bits of vco_calcap. </description>
	<access>read-only</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CALTRIM_STEP1_REG</name>
	
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MDSTATE_RD</name>
	
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CALTRIM_STEP2_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MDSTATE_RD</name>
	
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CALTRIM_STEP3_REG</name>
	
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MDSTATE_RD</name>
	
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
