andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_CALTRIM_STEP4_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000ffff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MDSTATE_RD</name>
	<description>Content of the calibration counter </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_FTDF_PHYATTR_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FTDF_PHYATTR</name>
	<description>Read out the phyattr bus from the FTDF</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_KMOD_ALPHA_BLE_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000028c</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>KMOD_ALPHA_TXDAC</name>
	<description>BLE Kmod channel dependent trimming constant (when TX-DAC is used).
0: No trimming is activated
&gt;0: The modulation gain in the direct path is modified with a factor: 1-SGNx(KMOD_ALPHA)x(CN-CN_CAL_RD)/2048</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>KMOD_ALPHA_GAUSSDAC</name>
	<description>BLE Kmod channel dependent trimming constant (when GAUSS DAC is used).
0: No trimming is activated
&gt;0: The modulation gain in the direct path is modified with a factor: 1-SGNx(KMOD_ALPHA)x(CN-CN_CAL_RD)/2048</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_KMOD_ALPHA_FTDF_REG</name>
	
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>KMOD_ALPHA_FTDF</name>
	<description>FTDF Kmod channel dependent trimming constant.
0: No trimming is activated
&gt;0: The modulation gain in the direct path is modified with a factor: 1-SGNx(KMOD_ALPHA)x(CN-CN_CAL_RD)/2048</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL0_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL1_REG</name>
	
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL2_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL3_REG</name>
	
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL4_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL5_REG</name>
	
	<addressOffset>0x0000005a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL6_REG</name>
	
	<addressOffset>0x0000005c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL7_REG</name>
	
	<addressOffset>0x0000005e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_CTRL2_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000090</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>MSK_GAINCAL_LONG</name>
	<description>Run MSK gain calibration for 7 steps instead of 6 steps.
0: 5 (MGAIN_MODE_SEL = 0) or 6 (MGAIN_MODE_SEL = 1) steps
1: 6 (MGAIN_MODE_SEL = 0) or 7 (MGAIN_MODE_SEL = 1) steps</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>MGAIN_MODE_SEL</name>
	<description>0) Use DA14680AA/AC method for binary search of MGAIN calibration. Only odd values for Mgain are found
1) Use new mode, where the comparator results are evaluated. Take the noisiest values. 

</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>MGAIN_TRANSMIT_LENGTH</name>
	<description>Number of symbols for transmit0 and transmit1 length during mgain calibration. </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
