andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_MGAIN_CTRL3_REG</name>
	
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000070</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>GFSK_GAIN_OFFSET</name>
	<description>Unsigned number, to be added to GAUSS_GAIN before supplying to the multiplier.
This value is used when the TXDAC is used in BLE mode.
</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_CTRL_BLE_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00001403</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>MGAIN_AVER</name>
	<description>Average over a number of comparator output values
0: 1 value
1: 3 values
2: 5 values
3: 7 values </description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>MGAIN_CMP_INV</name>
	<description>Invert the output of the modulation gain comparator before usage. </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>BLE_TESTPAT_GEN</name>
	<description>Enable the BLE testpattern generator.
Bitstream can be controlled using RF_MSKMOD_CHIPL/H_REG</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>GAUSS_GAIN_SEL</name>
	<description>0: Normal operation
1: Use GAUSS_GAIN_WR for the modulation gain </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>GAUSS_GAIN_WR</name>
	<description>Externally provided modulation gain value </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGAIN_CTRL_FTDF_REG</name>
	
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00007000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MSK_GAIN_OFFSET</name>
	<description>Unsigned number, to be added to MSK_GAIN before supplying to the multiplier
</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>MSK_GAIN_SEL</name>
	<description>0: Normal operation
1: Use MSK_GAIN_WR for the modulation gain </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>MSK_GAIN_WR</name>
	<description>Externally provided modulation gain value </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MSKMOD_CHIPH_REG</name>
	<description>MSK modulator CHIP control upper 16 bit</description>
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000744a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MSK_CHIPH</name>
	
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MSKMOD_CHIPL_REG</name>
	<description>MSK modulator CHIP control lower 16 bit</description>
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000c39b</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MSK_CHIPL</name>
	
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MSKMOD_CTRL1_REG</name>
	<description>MSK modulator control register</description>
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>MSK_BYPASS_PHASE</name>
	<description>Bypass the phase calculation.
When set to '1', the CHIP codes are used directly for modulation</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TX_MOD_FROM_GPIO</name>
	<description>Bypass the DAC modulation generation, and take data from GPIO pins TBD</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>MSK_ALW_EN</name>
	<description>Always enable the clock to the MSK modulator.
'0' = enable equals (ftdf_mode and synth_enable)</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>MSK_TX_SEL</name>
	<description>Select TX_DATA/TX_VALID
0: TX_DATA/TX_VALID from FTDF mac
1: TX_DATA/TX_VALID from RF_MSKMOD_CTRL2_REG</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TX_VALID</name>
	<description>Test value for TX_VALID</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TX_DATA</name>
	<description>Test value for TX_DATA</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_NMD_OFFSET_REG</name>
	<description>Offset values for phase alignment after VCO calibration.</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>NMD_OFFSET_PLL96M</name>
	<description>Signed 8-bit offset value to be added to plldig nmd output when 96MHz pll clock is selected for the digital, so that the initial phase difference between MD_clk and pll_fref_clk is compensated.</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>NMD_OFFSET_XTAL16M</name>
	<description>Signed 8-bit offset value to be added to plldig nmd output when 16MHz xtal clock is selected for the digital, so that the initial phase difference between MD_clk and pll_fref_clk is compensated.</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PULSE_CTRL_REG</name>
	
	<addressOffset>0x00000070</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000099</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_GAIN</name>
	<description>Scaling factor = 16 + FTDF_PULSE_GAIN</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>FTDF_LOWPASS_EN</name>
	<description>Enabling of the lowpass filter in the digital modulation path.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FTDF_PULSE_GATE</name>
	<description>Number of initial output samples that are gated.</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>FTDF_PULSE_SEL</name>
	<description>0: MSK modulation
1: CPM modulation</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
