andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_PULSE_TBL_0_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000012</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_VAL</name>
	<description>Modulation frequency = FTDF_PULSE_VAL/16384 * 16 MHz.
Range (Hz): -1.0e6:+976.5625:+1.0e6-976.5625.</description>
	<access>read-write</access>
	<bitRange>[10:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PULSE_TBL_1_REG</name>
	
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000272</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_VAL</name>
	<description>Modulation frequency = FTDF_PULSE_VAL/16384 * 16 MHz.
Range (Hz): -1.0e6:+976.5625:+1.0e6-976.5625.</description>
	<access>read-write</access>
	<bitRange>[10:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PULSE_TBL_2_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000027c</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_VAL</name>
	<description>Modulation frequency = FTDF_PULSE_VAL/16384 * 16 MHz.
Range (Hz): -1.0e6:+976.5625:+1.0e6-976.5625.</description>
	<access>read-write</access>
	<bitRange>[10:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PULSE_TBL_3_REG</name>
	
	<addressOffset>0x00000066</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000020e</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_VAL</name>
	<description>Modulation frequency = FTDF_PULSE_VAL/16384 * 16 MHz.
Range (Hz): -1.0e6:+976.5625:+1.0e6-976.5625.</description>
	<access>read-write</access>
	<bitRange>[10:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PULSE_TBL_4_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001ed</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_VAL</name>
	<description>Modulation frequency = FTDF_PULSE_VAL/16384 * 16 MHz.
Range (Hz): -1.0e6:+976.5625:+1.0e6-976.5625.</description>
	<access>read-write</access>
	<bitRange>[10:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PULSE_TBL_5_REG</name>
	
	<addressOffset>0x0000006a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001f8</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_VAL</name>
	<description>Modulation frequency = FTDF_PULSE_VAL/16384 * 16 MHz.
Range (Hz): -1.0e6:+976.5625:+1.0e6-976.5625.</description>
	<access>read-write</access>
	<bitRange>[10:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PULSE_TBL_6_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000201</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_VAL</name>
	<description>Modulation frequency = FTDF_PULSE_VAL/16384 * 16 MHz.
Range (Hz): -1.0e6:+976.5625:+1.0e6-976.5625.</description>
	<access>read-write</access>
	<bitRange>[10:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PULSE_TBL_7_REG</name>
	
	<addressOffset>0x0000006e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>FTDF_PULSE_VAL</name>
	<description>Modulation frequency = FTDF_PULSE_VAL/16384 * 16 MHz.
Range (Hz): -1.0e6:+976.5625:+1.0e6-976.5625.</description>
	<access>read-write</access>
	<bitRange>[10:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL1_BLE_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002962</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>PLL_HSI_POL</name>
	<description>High Side Injection polarity
0: LO frequency is lower than the wanted RF frequency
1: LO frequency is higher than the wanted RF frequency </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>CS</name>
	<description>Channel Spacing
0: 1MHz
1: 2MHz </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>SGN</name>
	<description>Sign bit for the channel step
0: positive
1: negative </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>CHANNEL_ZERO</name>
	<description>Channel 0 frequency in MHz </description>
	<access>read-write</access>
	<bitRange>[11:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL1_FTDF_REG</name>
	
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000965</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>PLL_HSI_POL</name>
	<description>High Side Injection polarity
0: LO frequency is lower than the wanted RF frequency
1: LO frequency is higher than the wanted RF frequency </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>CS</name>
	<description>Channel Spacing
0: 2.5MHz
1: 5MHz </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>SGN</name>
	<description>Sign bit for the channel step
0: positive
1: negative </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>CHANNEL_ZERO</name>
	<description>Channel 0 frequency in MHz </description>
	<access>read-write</access>
	<bitRange>[11:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL2_BLE_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000108b</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>BLE_DAC_SEL</name>
	<description>Bit to select if the Gauss-DAC or TX-DAC is used for the BLE mode
'0' - Use Gauss-DAC
'1' - Use TX-DAC
</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>BT_SEL</name>
	<description>0: BT = 0.5; 1: BT = 0.6 </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>EO_PACKET_DIS</name>
	<description>Disable the end of packet detection

0: End of packet detection enabled
1: End of pakcet detection disabled </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TXDATA_INV</name>
	<description>Select polarity of the modulation prior to the pulse shaping
0: Normal operation
1: Invert the modulation signal </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>GAUSS_86</name>
	<description>Select the output resolution in the analog signal path
0: 8 bit resolution for the shaping signal
1: 6 bit resolution for the shaping signal </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>GAUSS_INV</name>
	<description>Select polarity of the analog modulation path
0: Normal operation
1: Invert the signal in the analog signal path </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>GAUSS_DELAY</name>
	<description>Additional delay in analog signal path in RCLK cycles

When using Gauss-DAC 

0x0 - no delay
0x1 - 1 cycle delay
0x2 - 2 cycles delay
0x3 - 3 cycles delay

When using TX-DAC.

0x0 - 1 cycle delay
0x1 - 2 cycles delay

</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>MODINDEX</name>
	<description>Modulation Index selection
0:h = 1/2 (&#206;&#148;f = 250 kHz)
1: Modulation to SDM disabled.
2: h = 17/32 (&#206;&#148;f = 266 kHz)
3: h = 35/64 (&#206;&#148;f = 273 kHz) </description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>SD_ORDER_TX</name>
	<description>Order of the sigma-delta modulator in TX mode </description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>SD_ORDER_RX</name>
	<description>Order of the sigma-delta modulator in RX mode </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
