andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL2_FTDF_REG</name>
	
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000b</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>TXDATA_INV</name>
	<description>Select polarity of the modulation prior to the pulse shaping
0: Normal operation
1: Invert the modulation signal </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>GAUSS_INV</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TXDAC_DELAY</name>
	<description>Additional delay in analog signal path in RCLK cycles when in FTDF mode

0x0 - 1 clock cycle delay
0x1 - 2 clock cycles delay </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>MODINDEX</name>
	<description>
0x1 - Modulation to the SDM disabled, other modindex from pulse shaper.

</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>SD_ORDER_TX</name>
	<description>Order of the sigma-delta modulator in TX mode </description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>SD_ORDER_RX</name>
	<description>Order of the sigma-delta modulator in RX mode </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL3_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ZIF_MODE_EN</name>
	<description>Zero-IF testmode</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>MODVAL_SEL</name>
	<description>0: Normal operation
1: Use the externally provided value for the modulation </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>MODVAL_WR</name>
	<description>Externally provided modulation value in 2s complement
&#206;&#148;f = 16 MHz x MODVAL_WR/16348 </description>
	<access>read-write</access>
	<bitRange>[13:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT2_BLE_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00001480</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CN_CAL_RD</name>
	<description>Result of the modulation gain calibration (Retained) </description>
	<access>read-only</access>
	<bitRange>[13:8]</bitRange>
	
</field><field>
	<name>GAUSS_GAIN_RD</name>
	<description>Modulation gain after KMOD_ALPHA trimming (Not Retained) </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT2_FTDF_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000080</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MSK_GAIN_RD</name>
	<description>Modulation gain after KMOD_ALPHA trimming and adding the offset</description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT3_FTDF_REG</name>
	
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>CN_CAL_FTDF_RD</name>
	<description>Result of the modulation gain calibration (Retained) </description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT_BLE_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000820</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_FREQTRIM_RD</name>
	<description>Result of the VCO calibration (Not Retained) </description>
	<access>read-only</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>GAUSS_GAIN_CAL_RD</name>
	<description>Result of the modulation gain calibration (Retained) </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_RESULT_FTDF_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x0000f07f</resetMask>
	<fields>
	<field>
	<name>MSK_GAIN_CAL_RD</name>
	<description>Result of the modulation gain calibration (Retained) </description>
	<access>read-only</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SYNTH_SPARE_REG</name>
	<description>MSK modulator control register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>SPARE</name>
	<description>spare registers for future use. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TXDAC_TEST_REG</name>
	<description>Register to provide value to TXDAC</description>
	<addressOffset>0x00000048</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>RF_TXDAC_TEST_SEL</name>
	<description>When RF_TXDAC_TEST_SEL = 0, use normal provided value
When RF_TXDAC_TEST_SEL = 1, use the value provided by RF_TXDAC_TEST_WR
</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>RF_TXDAC_TEST_WR</name>
	<description>Register to manually provide a value to the TX-DAC.


</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
