andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_VCOCAL_CTRL_REG</name>
	
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000c3</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>VCOCAL_MD_STATE_DLY_SEL</name>
	<description>Extend the MD counter enable for 1 or 2 clock cycles.
0 (default): Extend by 2 clock cyles
1: Extend 1 clock cycles </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>VCOCAL_PERIOD</name>
	<description>Length of a VCO calibration step
0: 1 us
1: 2 us
2: 3 us
3: 4 us </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>VCO_FREQTRIM_SEL</name>
	<description>0b00: use calibrated value
0b01: use calibrated value, offsetted with -1
0b10: use VCO_FREQTRIM_WR
0b11: use calcap from LUT/phyattr</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>VCO_FREQTRIM_WR</name>
	<description>Externally provided VCO calibration value </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_VCO_CALCAP_BIT14_REG</name>
	
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000d59d</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_CALCAP_BIT14</name>
	<description>LUT entry for bit 14 of the VCO calibration capacitance </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_VCO_CALCAP_BIT15_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_CALCAP_BIT15</name>
	<description>LUT entry for bit 15 of the VCO calibration capacitance </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_VCO_FREQ_EST_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000700</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>VCO_FREQ_EST_UPPER_RD</name>
	<description>MDSTATE_RD[18:16]
(MDSTATE_RD[15:0] shall be read from the RF_CALTRIM_STEP4_REG).</description>
	<access>read-only</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>VCO_FREQ_EST_LEN</name>
	<description>Set the length of enabling of the calibration counter (MD counter) in terms of 8us.
Eg: If it is set to 12, then the calibration caounter will be enabled for 12x8us = 96us</description>
	<access>read-write</access>
	<bitRange>[7:1]</bitRange>
	
</field><field>
	<name>VCO_FREQ_EST_EN</name>
	<description>Enable the usage of calibration counter for frequency estimation.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>QSPIC</name>
	<version>1.0</version>
	<description>QSPIC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x0c000000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>68</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>QSPIC_BURSTBRK_REG</name>
	<description>Read break sequence in Auto mode</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_SEC_HF_DS</name>
	<description>Disable output during the transmission of the second half (QSPIC_BRK_WRD[3:0]). Setting this bit is only useful if QSPIC_BRK_EN =1 and QSPIC_BRK_SZ= 1.
0 - The controller drives the QSPI bus during the transmission of the QSPIC_BRK_WRD[3:0].
1 - The controller leaves the QSPI bus in Hi-Z during the transmission of the QSPIC_BRK_WORD[3:0].</description>
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>QSPIC_BRK_TX_MD</name>
	<description>The mode of the QSPI Bus during the transmission of the burst break sequence.
00 - Single
01 - Dual
10 - Quad
11 - Reserved</description>
	<access>read-write</access>
	<bitRange>[19:18]</bitRange>
	
</field><field>
	<name>QSPIC_BRK_SZ</name>
	<description>The size of Burst Break Sequence
0 - One byte (Send QSPIC_BRK_WRD[15:8])
1 - Two bytes (Send QSPIC_BRK_WRD[15:0])</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>QSPIC_BRK_EN</name>
	<description>Controls the application of a special command (read burst break sequence) that is used in order to force the device to abandon the continuous read mode.
0 - The special command is not applied
1 - The special command is applied

This special command is applied by the controller to the external device under the following conditions:
- the controller is in Auto mode
- the QSPIC_INST_MD = 1
- the previous command that has been applied in the external device was read
- the controller want to apply to the external device a command different than the read.</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>QSPIC_BRK_WRD</name>
	<description>This is the value of a special command (read burst break sequence) that is applied by the controller to the external memory device, in order to force the memory device to abandon the continuous read mode.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_BURSTCMDA_REG</name>
	<description>The way of reading in Auto mode (command register A)</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_DMY_TX_MD</name>
	<description>It describes the mode of the SPI bus during the Dummy bytes phase.
00 - Single SPI
01 - Dual
10 - Quad
11 - Reserved</description>
	<access>read-write</access>
	<bitRange>[31:30]</bitRange>
	
</field><field>
	<name>QSPIC_EXT_TX_MD</name>
	<description>It describes the mode of the SPI bus during the Extra Byte phase.
00 - Single SPI
01 - Dual
10 - Quad
11 - Reserved</description>
	<access>read-write</access>
	<bitRange>[29:28]</bitRange>
	
</field><field>
	<name>QSPIC_ADR_TX_MD</name>
	<description>It describes the mode of the SPI bus during the address phase.
00 - Single SPI
01 - Dual
10 - Quad
11 - Reserved</description>
	<access>read-write</access>
	<bitRange>[27:26]</bitRange>
	
</field><field>
	<name>QSPIC_INST_TX_MD</name>
	<description>It describes the mode of the SPI bus during the instruction phase.
00 - Single SPI
01 - Dual
10 - Quad
11 - Reserved</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>QSPIC_EXT_BYTE</name>
	<description>The value of an extra byte which will be transferred after address (only if QSPIC_EXT_BYTE_EN= 1). Usually this is the Mode Bits in Dual/Quad SPI I/O instructions.</description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>QSPIC_INST_WB</name>
	<description>IInstruction Value for Wrapping Burst. This value is the selected instruction when QSPIC_WRAP_MD is equal to 1 and the access is a wrapping burst of length and size described by the bit fields QSPIC_WRAP_LEN and QSPIC_WRAP_SIZE respectively.</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>QSPIC_INST</name>
	<description>Instruction Value for Incremental Burst or Single read access. This value is the selected instruction at the cases of incremental burst or single read access. Also this value is used when a wrapping burst is not supported (QSPIC_WRAP_MD)</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
