andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_CALSTATE_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CALSTATE</name>
	<description>Value of the calstate state machine </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CAL_CTRL_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_CAL_DIS</name>
	<description>Do not calibrate the VCO during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DC_OFFSET_CAL_DIS</name>
	<description>Do not calibrate the VGA2 Offset during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>IFF_CAL_DIS</name>
	<description>Do not calibrate the IFF center frequency during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>MGAIN_CAL_DIS</name>
	<description>Do not calibrate the VCO and Modulation Gain during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>EO_CAL</name>
	<description>End of calibration trigger.
Reading returns the eo_cal status signal which can be cleared by writing to RF_IRQ_CTRL_REG.EO_CAL_CLEAR </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SO_CAL</name>
	<description>Start of calibration trigger.Writing a 1 starts calibration.1Reading returns the calibration status (1 = busy calibrating). </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CP_CTRL_BLE_REG</name>
	
	<addressOffset>0x00000098</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00007f7f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CP_CUR_BLE_TX</name>
	<description>CP current setting during PLL - Lock in TX mode
1111: 45 &#181;A (fastest, setting 0)
0111: 15 &#181;A (setting 1)
0011: 7.5 &#181;A (setting 2)
0001: 3.75 &#181;A (slowest, setting 3)
Intermediate values are possible (but not recommended). Calculate the effective value with:
bit 0: 3.75 &#181;A
bit 1: 3.75 &#181;A
bit 2: 7.5 &#181;A
bit 3: 30 &#181;A </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>CP_CUR_BLE_RX</name>
	<description>CP current setting during PLL - lock in RX mode
same coding as for CP_CUR_TX </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>CP_CUR_SET_BLE_TX</name>
	<description>Chargepump current setting during PLL settling in TX mode
same coding as for CP_CUR_TX </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>CP_CUR_SET_BLE_RX</name>
	<description>Chargepump current setting during PLL settling in RX mode.
same coding as for CP_CUR_TX</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CP_CTRL_FTDF_REG</name>
	
	<addressOffset>0x0000009a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00007f7f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CP_CUR_FTDF_TX</name>
	<description>CP current setting during PLL - Lock in TX mode
1111: 45 &#181;A (fastest, setting 0)
0111: 15 &#181;A (setting 1)
0011: 7.5 &#181;A (setting 2)
0001: 3.75 &#181;A (slowest, setting 3)
Intermediate values are possible (but not recommended). Calculate the effective value with:
bit 0: 3.75 &#181;A
bit 1: 3.75 &#181;A
bit 2: 7.5 &#181;A
bit 3: 30 &#181;A </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>CP_CUR_FTDF_RX</name>
	<description>CP current setting during PLL - lock in RX mode
same coding as for CP_CUR_TX </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>CP_CUR_SET_FTDF_TX</name>
	<description>Chargepump current setting during PLL settling in TX mode
same coding as for CP_CUR_TX </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>CP_CUR_SET_FTDF_RX</name>
	<description>Chargepump current setting during PLL settling in RX mode.
same coding as for CP_CUR_TX</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DIAGIRQ01_REG</name>
	<description>BLE/RF Diagnostic IRQ Control Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007f7f</resetMask>
	<fields>
	<field>
	<name>DIAGIRQ_EDGE_1</name>
	<description>Same as DIAGIRQ_EDGE_0.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DIAGIRQ_BSEL_1</name>
	<description>Same as DIAGIRQ_BSEL_0.</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>DIAGIRQ_WSEL_1</name>
	<description>Same as DIAGIRQ_WSEL_0.</description>
	<access>read-write</access>
	<bitRange>[10:9]</bitRange>
	
</field><field>
	<name>DIAGIRQ_MASK_1</name>
	<description>Same as DIAGIRQ_MASK_0.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DIAGIRQ_EDGE_0</name>
	<description>Diagnostic IRQ Edge 0
Selects the edge of the selected bit (refer to DIAGIRQ_BSEL_0) that will trigger the assertion of DIAGIRQ_STAT_0.
If '0' then the positive edge is selected, when "1" the negative edge is selected.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DIAGIRQ_BSEL_0</name>
	<description>Diagnostic IRQ Bit Select 0
Selects the bit of the 8-bit bus (as selected by the DIAGIRQ_WSEL_0) that will be used for the IRQ generation.</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>DIAGIRQ_WSEL_0</name>
	<description>Diagnostic IRQ Word Select 0
Selects the 8-bit diagnostic bus that will be used for the IRQ generation.
00: Selects the BLE_DIAG0
01: Selects the BLE_DIAG1
10: Selects the RADIO_DIAG0
11: Selects the RADIO_DIAG1</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>DIAGIRQ_MASK_0</name>
	<description>Diagnostic IRQ Mask 0
When set to "1" a BLE_RF_DIAG_IRQ will be generated on each rise of the DIAGIRQ_STAT_0 bit.
When cleared to "0" no IRQ will be generated.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
