andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_DIAGIRQ23_REG</name>
	<description>BLE/RF Diagnostic IRQ Control Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007f7f</resetMask>
	<fields>
	<field>
	<name>DIAGIRQ_EDGE_3</name>
	<description>Same as DIAGIRQ_EDGE_0.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DIAGIRQ_BSEL_3</name>
	<description>Same as DIAGIRQ_BSEL_0.</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>DIAGIRQ_WSEL_3</name>
	<description>Same as DIAGIRQ_WSEL_0.</description>
	<access>read-write</access>
	<bitRange>[10:9]</bitRange>
	
</field><field>
	<name>DIAGIRQ_MASK_3</name>
	<description>Same as DIAGIRQ_MASK_0.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DIAGIRQ_EDGE_2</name>
	<description>Same as DIAGIRQ_EDGE_0.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DIAGIRQ_BSEL_2</name>
	<description>Same as DIAGIRQ_BSEL_0.</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>DIAGIRQ_WSEL_2</name>
	<description>Same as DIAGIRQ_WSEL_0.</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>DIAGIRQ_MASK_2</name>
	<description>Same as DIAGIRQ_MASK_0.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DIAGIRQ_STAT_REG</name>
	<description>BLE/RF Diagnostic IRQ Status Register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>DIAGIRQ_STAT_3</name>
	<description>Same as DIAGIRQ_STAT_0.</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DIAGIRQ_STAT_2</name>
	<description>Same as DIAGIRQ_STAT_0.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DIAGIRQ_STAT_1</name>
	<description>Same as DIAGIRQ_STAT_0.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DIAGIRQ_STAT_0</name>
	<description>Diagnostic IRQ Status 0
This bit is read only. It is automatically cleared to "0" on each read of the BLE_RF_DIAGIRQ_REG register. It is automatically asserted to "1" on each detection of the selected edge, of the selected bit, of the selected word.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DIV_IQ_RX_REG</name>
	<description>Bias trimming of IQ divider</description>
	<addressOffset>0x000000d4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>DIV2_IQ_TRIM_RX_SPARE</name>
	<description>Function not defined yet</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DIV2_OFFP_TRIM_RX</name>
	<description>Trim value for 2 divider P-Most bias in RX mode</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>DIV2_OFFN_TRIM_RX</name>
	<description>Trim value for 2 divider N-Most bias in RX mode</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DIV_IQ_TX_REG</name>
	<description>Bias trimming of IQ divider</description>
	<addressOffset>0x000000d6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>DIV2_IQ_TRIM_TX_SPARE</name>
	<description>Function not defined yet</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DIV2_OFFP_TRIM_TX</name>
	<description>Trim value for 2 divider P-Most bias in TX mode</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>DIV2_OFFN_TRIM_TX</name>
	<description>Trim value for 2 divider N-Most bias in TX mode</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_CAL_CAP_STAT_REG</name>
	<description>Current CAL_CAP value applied to IF</description>
	<addressOffset>0x000000ea</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_RD</name>
	<description>Reset value is equal to the reset value of RF_IFF_RESULT_REG[IF_CAL_CAP_RD]</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_CC_BLE_SET1_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x000000e2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_WR</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_CC_BLE_SET2_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x000000e4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_WR</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_CC_FTDF_SET1_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x000000e6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_WR</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
