andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_IFF_CC_FTDF_SET2_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_WR</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_CTRL1_REG</name>
	
	<addressOffset>0x00000088</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000f10</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>IFF_COMPLEX_DIS</name>
	<description>Put IF-filter in lowpass configuration </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>IF_SELECT_FSM</name>
	<description>'0': use one of the IFF_CC_BLE/FTDF_SET1/2, depending on FTDF_MODE and IF_SELSET_GT
'1': use the value from the calibration FSM</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>IF_SEL_SET2_GT</name>
	<description>Setting to control when IF_CAL_CAP_BLE/FTDF_SET2 is used.

If AGC &gt; IF_SEL_SET2_GT, SET2 is used.Else, SET1 is used.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>RO_TO_PINS</name>
	<description>'0': normal operation;
'1': Enable reference oscillator. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>IFF_DCOC_DAC_DIS</name>
	<description>Disable the DC offset current DAC </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>IF_MUTE</name>
	<description>'0': normal operation;
'1': Mute IFF by short circuit of VGA1 input.
Note: set TGATE_MIXER_IF to '0' for isolation from the IRM </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>IF_CAL_CAP</name>
	<description>Current value applied to IF_CAL_CAP</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_RESULT_REG</name>
	<description>Not retained</description>
	<addressOffset>0x000000e0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000fc1f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_RD</name>
	<description>IF calibration result capacitance.</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IO_CTRL1_REG</name>
	
	<addressOffset>0x000000aa</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>RFIO_TRIM1_CAP</name>
	<description>Trim the RFIO input capacitance
00: Minimum capacitance
10: Nominal capacitance
1F: Maximal capacitance </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IRQ_CTRL_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>EO_CAL_CLEAR</name>
	<description>Writing any value to this bit clears eo_cal interrupt. </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LF_CAL_CAP_STAT_REG</name>
	<description>Current CAL_CAP value applied to IF</description>
	<addressOffset>0x000000ee</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000030</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>LF_SHORT_R4_RD</name>
	<description>The reset value should be equal to RF_LF_CTRL_REG[LF_SHORT_R4_BLE].</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LF_CAL_CAP_RD</name>
	<description>The reset value should be equal to the reset value of RF_IFF_CC_BLE_SET1_REG.</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LF_CTRL_REG</name>
	
	<addressOffset>0x000000a6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000c0</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>LF_CAL_CAP_WR_FTDF</name>
	<description>External value for loop filter calibration capacitance for FTDF mode.</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	
</field><field>
	<name>LF_SHORT_R4_FTDF</name>
	<description>'0': R4 in place, '1': R4 shorted, C2 and C4 in parallel. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LF_SHORT_R4_BLE</name>
	<description>'0': R4 in place, '1': R4 shorted, C2 and C4 in parallel. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>LF_CAL_CAP_SEL</name>
	<description>0: use IF_CAL_CAP_BLE/FTDF_SET1, depending on mode. LF_CAL_CAP_WR is added as offset.
1: use LF_CAL_CAP_WR directly</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LF_CAL_CAP_WR_BLE</name>
	<description>External value for loop filter calibration capacitance for BLE mode.</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LF_RES_CTRL_BLE_REG</name>
	<description>LF resistor setting in BLE mode</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00007f7f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LF_RES_BLE_TX</name>
	<description>Loopfilter resistor setting during PLL - Lock in TX mode
1xxx: 72 k (fastest, setting 0)
01xx: 120 k (setting 1)
001x: 168 k (setting2)
000x: 240 k (slowest, setting 3) </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>LF_RES_BLE_RX</name>
	<description>Loopfilter resistor setting during PLL - Lock in RX mode
same coding as for LF_RES_TX </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>LF_RES_SET_BLE_TX</name>
	<description>Loopfilter resistor setting during PLL settling in TX mode

same coding as for LF_RES_TX </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>LF_RES_SET_BLE_RX</name>
	<description>Loopfilter resistor setting during PLL settling in RX mode
same coding as for LF_RES_TX </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
