andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_LF_RES_CTRL_FTDF_REG</name>
	<description>LF resistor setting in FTDF mode</description>
	<addressOffset>0x0000009e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00007f7f</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LF_RES_FTDF_TX</name>
	<description>Loopfilter resistor setting during PLL - Lock in TX mode
1xxx: 72 k (fastest, setting 0)
01xx: 120 k (setting 1)
001x: 168 k (setting2)
000x: 240 k (slowest, setting 3) </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>LF_RES_FTDF_RX</name>
	<description>Loopfilter resistor setting during PLL - Lock in RX mode
same coding as for LF_RES_TX </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>LF_RES_SET_FTDF_TX</name>
	<description>Loopfilter resistor setting during PLL settling in TX mode

same coding as for LF_RES_TX </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>LF_RES_SET_FTDF_RX</name>
	<description>Loopfilter resistor setting during PLL settling in RX mode
same coding as for LF_RES_TX </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LNA_CTRL1_REG</name>
	
	<addressOffset>0x000000ac</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000024e</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>LNA_TRIM_CD_HF</name>
	<description>Trim the LNA output capacitance for CN &gt; 19
00: Minimum capacitance
10: Nominal capacitance
1F: Maximal capacitance </description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>LNA_TRIM_CD_LF</name>
	<description>Trim the LNA output capacitance for CN 00: Minimum capacitance
10: Nominal capacitance
1F: Maximal capacitance </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LNA_CTRL2_REG</name>
	
	<addressOffset>0x000000ae</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000226</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>LNA_TRIM_GM_LO</name>
	<description>Trim the LNA bias resistor for optimum transcunductance (gain) in AGC settings 2 and 3
00: Minimum transconductance
10: Nominal transconductance
1F: Maximal transconductance </description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GM_HI</name>
	<description>Trim the LNA bias resistor for optimum transcunductance (gain) in AGC settings 0 and 1
00: Minimum transconductance
10: Nominal transconductance
1F: Maximal transconductance </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LNA_CTRL3_REG</name>
	
	<addressOffset>0x000000b0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000007</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>LNA_TRIM_CGS</name>
	<description>Trim the LNA gate-source capacitance
00: Minimum capacitance
10: Nominal capacitance
1F: Maximal capacitance </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LO_IQ_TRIM_REG</name>
	<description>Trim settings for IQ LO path</description>
	<addressOffset>0x000000d8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_LO_IQ_TRIM</name>
	<description>Trim settings for RX-IQ LO path</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MGC_CTRL_REG</name>
	
	<addressOffset>0x00000092</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>GAUSS_DAC_CTRL</name>
	<description>value 1X , Set the Gauss DAC output to high 'Z </description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>MGC_POLE_SW</name>
	<description>Switch in an aditional pole on the mgc amplifer to have extra filtering of the loopfilter voltage.
'0': no pole (bandwidth limited by the opamp)
'1': switch in pole to reduce amplifier bandwidth</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>MGC_GAIN_SET</name>
	<description>Set the desired gain for the mgc calibration amplifier.
'0': gain= 15x
'1': gain= 10x </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MIXER_CTRL1_BLE_REG</name>
	
	<addressOffset>0x000000a0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000035</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MIX_SPARE_BLE</name>
	<description>Spare registers for mixer control </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>MIX_TRIM_VCM_BLE</name>
	<description>Trim the common mode voltage at the input of the TIA
0: Minimum voltage
8: Nominal voltage
F: Maximal voltage </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>MIX_TRIM_IBIAS_BLE</name>
	<description>Trim the bias current of the TIA
0: Minimum bias current
8: Nominal bias current
F: Maximal bias current </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>MIX_TRIM_GMBIAS_BLE</name>
	<description>Trim the Mixer bias resistor for optimum transcunductance
0: Minimum transconductance
8: Nominal transconductance
F: Maximal transconductance </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MIXER_CTRL1_FTDF_REG</name>
	
