andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_REF_OSC_BLE_REG</name>
	
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000302c</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CNT_CLK</name>
	<description>number of clock pulses corresponding to the value of CNT_RO </description>
	<access>read-write</access>
	<bitRange>[14:6]</bitRange>
	
</field><field>
	<name>CNT_RO</name>
	<description>number of reference oscillator periods that need to be counted </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_REF_OSC_FTDF_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000302c</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CNT_CLK</name>
	<description>number of clock pulses corresponding to the value of CNT_RO </description>
	<access>read-write</access>
	<bitRange>[14:6]</bitRange>
	
</field><field>
	<name>CNT_RO</name>
	<description>number of reference oscillator periods that need to be counted </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SCAN_FEEDBACK_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000ff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CP_CUR</name>
	<description>Cp_cur value during scan. </description>
	<access>read-only</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>LF_RES</name>
	<description>Lf_res value during scan. </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SPARE1_BLE_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_SPARE_REG</name>
	<description>Unused spare bits for BLE mode.</description>
	<access>read-write</access>
	<bitRange>[15:6]</bitRange>
	
</field><field>
	<name>RF_GDAC_CUR_SET</name>
	<description>Set the GaussDAC reference current
</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>RF_TXDAC_CLK_POL_SEL</name>
	<description>Select the polarity of the clock for the TXDAC

0x0 - Use negative edge
0x1 - Use the positive edge

</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RF_VTUNE_TO_ADC_TEST_EN</name>
	<description>Enable the connection of Vtune to the GPADC in BLE mode.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RF_XTAL_PLL_DXTAL16_TEST</name>
	<description>Connect the PLL output of the xtal oscillator to the digital driver of P17 in BLE mode.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RF_XTAL_RFCLK_TEST</name>
	<description>Connect the RFCLK output of the xtal oscillator to the digital driver of P14 in BLE mode.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SPARE1_FTDF_REG</name>
	
	<addressOffset>0x00000082</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_SPARE_REG</name>
	<description>Unused spare bits for FTDF mode.</description>
	<access>read-write</access>
	<bitRange>[15:6]</bitRange>
	
</field><field>
	<name>RF_GDAC_CUR_SET</name>
	
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>RF_TXDAC_CLK_POL_SEL</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RF_VTUNE_TO_ADC_TEST_EN</name>
	<description>Enable the connection of Vtune to the GPADC in FTDF mode.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RF_XTAL_PLL_DXTAL16_TEST</name>
	<description>Connect the PLL output of the xtal oscillator to the digital driver of P17 in FTDF mode.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RF_XTAL_RFCLK_TEST</name>
	<description>Connect the RFCLK output of the xtal oscillator to the digital driver of P14 in FTDF mode.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TDC_CTRL_REG</name>
	<description>TDC settings</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>TDC_CONNECT</name>
	<description>'0': Normal Operation (no measurement possible)
'1': Connect the PFD inputs also to the TDC inputs
</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>REF_CTRL</name>
	<description>Select how calibration is performed.
Phase 1:
'0': Count during 1 RCLK period (expect 60-70 as result)
'1': Count during 2 RCLK period (expect 120-140 as result)
'2': Count during 3 RCLK period (expect 180 -210 as result)
'3': not allowed
Phase 2, base the resolution measurement on:
'0': 1 overlap of fast and slow oscillators (NF=NS+1)
'1': 2 overlaps of fast and slow oscillators (NF=NS+2)
'2': 1 overlap of fast and slow oscillators (NF=NS+1)
'3': Not allowed
</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>CAL_PH_2</name>
	<description>Select calibration option 2
'0': normal operation (pfd measurement mode or cal mode 1)
'1': measure the slow - fast oscillator period (calibration phase 2)
------- Note CAL_PH_1 must be 0 in this setting
</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>CAL_PH_1</name>
	<description>Select calibration option 1
'0': normal operation (pfd measurement or cal mode 2)
'1': measure the fast oscillator period (calibration phase 1)
------- Note: CAL_PH_2 must be 0 in this setting
</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>CTRL_SLOW</name>
	<description>Trim the slow oscillator
'0': Minimum frequency (default)
'F': Maximum frequency
</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>CTRL_FAST</name>
	<description>Trim the fast oscillator
'0': mimimum frequency
'F': maximum frequency

</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
