andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_TXDAC_CAL_CAP_STAT_REG</name>
	<description>Current CAL CAP value for TXDAC</description>
	<addressOffset>0x000000dc</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000030</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>TXDAC_FIXED_CAP_ON_RD</name>
	<description>Read back TXDAC_FIXED_CAP_ON value.
Reset value is, RF_TXDAC_CAL_CAP_STAT_REG[5] = RF_TXDAC_CTRL_REG[6].</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TXDAC_CAL_CAP_RD</name>
	<description>Reset value is:RF_TXDAC_CAL_CAP_STAT_REG[4:0] = RF_IFF_CC_BLE_SET1_REG (since during reset, ftdf_mode is 0.)</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TXDAC_CTRL_REG</name>
	<description>Control settings for the TXDAC</description>
	<addressOffset>0x000000da</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000040</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>TXDAC_CAL_CAP_WR_FTDF</name>
	<description>External provided capacitor value of TXDAC for FTDF mode.</description>
	<access>read-write</access>
	<bitRange>[11:7]</bitRange>
	
</field><field>
	<name>TXDAC_FIXED_CAP_ON</name>
	<description>Connect the fixed cap in the TXDAC reconstruction filter.
Should be on by default. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TXDAC_CAL_CAP_SEL</name>
	<description>0: use IF_CAL_CAP_BLE/FTDF_SET1, depending on mode. TXDAC_CAP_WR is added as offset.
1: use TXDAC_CAP_WR directly</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TXDAC_CAL_CAP_WR_BLE</name>
	<description>External provided capacitor value of TXDAC for BLE mode.</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_BLE_REG</name>
	<description>TX Power setting</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>TX_POWER_SET</name>
	<description>(During BLE mode) Use settings from RF_TX_PWR_LUT_x_REG&lt;11:0&gt; , when zero OR in RX mode the LUT functionality is not used. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_FTDF_REG</name>
	<description>TX Power setting</description>
	<addressOffset>0x000000d0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>TX_POWER_SET</name>
	<description>(During FTDF mode) Use settings from RF_TX_PWR_LUT_x_REG&lt;11:0&gt; , when zero OR in RX mode the LUT functionality is not used. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_1_REG</name>
	<description>TX Power setting 1</description>
	<addressOffset>0x000000c2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000003b</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RFIO_TXRX_DCF_DIS</name>
	<description>Bit to overrule the rfio_txrx DCF signal in order to use the -20dBm setting
'0' = normal functionality
'1' = keep rfio_txrx DCF low in tx mode. (-20dBm mode)
</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=1</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=1</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 1</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_2_REG</name>
	<description>TX Power setting 2</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000037</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RFIO_TXRX_DCF_DIS</name>
	<description>Bit to overrule the rfio_txrx DCF signal in order to use the -20dBm setting
'0' = normal functionality
'1' = keep rfio_txrx DCF low in tx mode. (-20dBm mode)
</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=2</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=2</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 2</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_3_REG</name>
	<description>TX Power setting 3</description>
	<addressOffset>0x000000c6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001f6</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RFIO_TXRX_DCF_DIS</name>
	<description>Bit to overrule the rfio_txrx DCF signal in order to use the -20dBm setting
'0' = normal functionality
'1' = keep rfio_txrx DCF low in tx mode. (-20dBm mode)
</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=3</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=3</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 3</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
