andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_4_REG</name>
	<description>TX Power setting 4</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000036</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RFIO_TXRX_DCF_DIS</name>
	<description>Bit to overrule the rfio_txrx DCF signal in order to use the -20dBm setting
'0' = normal functionality
'1' = keep rfio_txrx DCF low in tx mode. (-20dBm mode)
</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=4</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=4</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 4</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_5_REG</name>
	<description>TX Power setting 5</description>
	<addressOffset>0x000000ca</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RFIO_TXRX_DCF_DIS</name>
	<description>Bit to overrule the rfio_txrx DCF signal in order to use the -20dBm setting
'0' = normal functionality
'1' = keep rfio_txrx DCF low in tx mode. (-20dBm mode)
</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=5</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=5</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 5</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_6_REG</name>
	<description>TX Power setting 6</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RFIO_TXRX_DCF_DIS</name>
	<description>Bit to overrule the rfio_txrx DCF signal in order to use the -20dBm setting
'0' = normal functionality
'1' = keep rfio_txrx DCF low in tx mode. (-20dBm mode)
</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=6</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=6</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 6</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_7_REG</name>
	<description>TX Power setting 7</description>
	<addressOffset>0x000000ce</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>TX_PWR_RFIO_TXRX_DCF_DIS</name>
	<description>Bit to overrule the rfio_txrx DCF signal in order to use the -20dBm setting
'0' = normal functionality
'1' = keep rfio_txrx DCF low in tx mode. (-20dBm mode)
</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_LNA_CTRL3_REG</name>
	<description>Value for RF_LNA_CTRL3_REG&lt;4:0&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=7</description>
	<access>read-write</access>
	<bitRange>[10:6]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_PA_CTRL_REG</name>
	<description>Value for RF_PA_CTRL_REG&lt;14:11&gt; in TX mode when RF_TX_PWR_REG&lt;2:0&gt;=7</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>TX_PWR_RF_IO_CTRL1_REG</name>
	<description>Value for RF_IO_CTRL1_REG&lt;1:0&gt; in TX mode when RF_TX_PWR_REG &lt;2:0&gt; = 7</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_TX_PWR_LUT_RD_REG</name>
	<description>TX Power read back</description>
	<addressOffset>0x000000d2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001ff</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>RF_TX_PWR_LUT_RD</name>
	<description>Output of mux, controlled by TX_POWER_SET
The reset value is equal to the reset value of {radio_enable_24_overruled, rf_lna_ctrl3_reg, rf_pa_ctrl_reg[14:11], rf_io_ctrl1_reg[1:0]}</description>
	<access>read-only</access>
	<bitRange>[11:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_VCOVAR_CTRL_REG</name>
	
	<addressOffset>0x00000094</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000a492</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MOD_VAR_V1</name>
	<description>Bias voltage of the VCO Modulation varactor (high Vmod)
0: low
1: mid
2: nominal
3: high </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>MOD_VAR_V0</name>
	<description>Bias voltage of the VCO Modulation varactor (low Vmod)
0: low
1: mid
2: nominal
3: high </description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>TUNE_VAR_V3</name>
	<description>Bias voltage of the VCO Tuning varactor (high Vtune)
001: low
010: nominal
100: high
others: not allowed</description>
	<access>read-write</access>
	<bitRange>[11:9]</bitRange>
	
</field><field>
	<name>TUNE_VAR_V2</name>
	<description>Bias voltage of the VCO Tuning varactor (high-mid Vtune)
Coding identical to TUNE_VAR_V3 </description>
	<access>read-write</access>
	<bitRange>[8:6]</bitRange>
	
</field><field>
	<name>TUNE_VAR_V1</name>
	<description>Bias voltage of the VCO Tuning varactor (low-mid Vtune)
Coding identical to TUNE_VAR_V3</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>TUNE_VAR_V0</name>
	<description>Bias voltage of the VCO Tuning varactor (low Vtune)
Coding identical to TUNE_VAR_V3</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
