andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_VCO_AMP_CTRL1_REG</name>
	
	<addressOffset>0x000000b2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000005c</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>VCO_AMPL_MODE</name>
	<description>V1a: 0x00
V1b: 0x03
V2a: 0x5C
V2b: 0x5F
</description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_VCO_AMP_CTRL2_REG</name>
	
	<addressOffset>0x000000b4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000202</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VCO_AMPL_SET_RX</name>
	<description>Set the desired amplitude of the VCO in RX mode. The amplitudes values, from lower to higher amplitude, for the 4 modes are:
V1a and V1b modes:
0x01,0x02,0x03,0x04,0x05,0x06,0x07
V2a and V2b modes:
0x10,0x20,0x30,0x40,0x50,0x60,0x01,0x02,0x03,0x04,0x05,0x06,0x07
</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>VCO_AMPL_SET_TX</name>
	<description>Set the desired amplitude of the VCO in TX mode. The amplitudes values, from lower to higher amplitude, for the 4 modes are:
V1a and V1b modes:
0x01,0x02,0x03,0x04,0x05,0x06,0x07
V2a and V2b modes:
0x10,0x20,0x30,0x40,0x50,0x60,0x01,0x02,0x03,0x04,0x05,0x06,0x07
</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RFCU_POWER</name>
	<version>1.0</version>
	<description>RFCU_POWER registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002200</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>398</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>RF_ALWAYS_EN1_REG</name>
	
	<addressOffset>0x00000180</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ALW_EN_PA_EN</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>ALW_EN_PA_RAMP_EN</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>ALW_EN_LNA_LDO_ZERO</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>ALW_EN_CP_BIAS_EN</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>ALW_EN_VCO_BIAS_EN</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>ALW_EN_CP_SWITCH_EN</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>ALW_EN_PA_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>ALW_EN_PFD_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ALW_EN_MD_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ALW_EN_VCO_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>ALW_EN_IFFADC_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>ALW_EN_IFF_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>ALW_EN_MIX_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ALW_EN_LNA_CGM_EN</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ALW_EN_LNA_CORE_EN</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ALW_EN_LNA_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ALWAYS_EN2_REG</name>
	
	<addressOffset>0x00000182</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ALW_EN_GAUSS_BIAS_SH</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>ALW_EN_IFFMIX_BIAS_SH_OPEN</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>ALW_EN_VCO_BIAS_SH_OPEN</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>ALW_EN_CP_BIAS_SH_OPEN</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>ALW_EN_DIV2_EN</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>ALW_EN_RXIQ_EN</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>ALW_EN_LOBUF_PA_EN</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>ALW_EN_RFIO_TXRX</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ALW_EN_GAUSS_EN</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ALW_EN_PDF_EN</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>ALW_EN_CP_EN</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>ALW_EN_LOBUF_MD_EN</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>ALW_EN_VCO_EN</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ALW_EN_ADC_EN</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ALW_EN_IFF_EN</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ALW_EN_MIX_EN</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ALWAYS_EN3_REG</name>
	
	<addressOffset>0x00000184</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ALW_EN_SPARE3_EN</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>ALW_EN_SPARE2_EN</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>ALW_EN_TXDAC_EN</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>ALW_EN_TR_PWRM_OFF_EN</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>ALW_EN_ADC_CLK_EN</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>ALW_EN_LDO_RADIO_EN</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>ALW_EN_RFIO_BIAS_SH</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>ALW_EN_RFIO_BIAS_EN</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ALW_EN_LDO_RFIO_EN</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ALW_EN_TDC_EN</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>ALW_EN_CAL_EN</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>ALW_EN_LDO_ZERO_EN</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>ALW_EN_DEM_EN</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ALW_EN_PLLCLOSED_EN</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ALW_EN_PLL_DIG_EN</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ALW_EN_MIX_BIAS_SH</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
