andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG10_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cp_switch_en_dcf_tx</name>
	<description>DCF timer for cp_switch_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>cp_switch_en_dcf_rx</name>
	<description>DCF timer for cp_switch_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG11_REG</name>
	
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000054</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_bias_en_dcf_tx</name>
	<description>DCF timer for vco_bias_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>vco_bias_en_dcf_rx</name>
	<description>DCF timer for vco_bias_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG12_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000071</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cp_bias_en_dcf_tx</name>
	<description>DCF timer for cp_bias_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>cp_bias_en_dcf_rx</name>
	<description>DCF timer for cp_bias_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG13_REG</name>
	
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lna_ldo_zero_dcf_tx</name>
	<description>DCF timer for lna_ldo_zero in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>lna_ldo_zero_dcf_rx</name>
	<description>DCF timer for lna_ldo_zero in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG14_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000180</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pa_ramp_en_dcf_tx</name>
	<description>DCF timer for pa_ramp_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>pa_ramp_en_dcf_rx</name>
	<description>DCF timer for pa_ramp_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG15_REG</name>
	
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001e0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pa_en_dcf_tx</name>
	<description>DCF timer for pa_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>pa_en_dcf_rx</name>
	<description>DCF timer for pa_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG16_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>mix_en_dcf_tx</name>
	<description>DCF timer for mix_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>mix_en_dcf_rx</name>
	<description>DCF timer for mix_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG17_REG</name>
	
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iff_en_dcf_tx</name>
	<description>DCF timer for iff_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>iff_en_dcf_rx</name>
	<description>DCF timer for iff_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG18_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>adc_en_dcf_tx</name>
	<description>DCF timer for adc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>adc_en_dcf_rx</name>
	<description>DCF timer for adc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG19_REG</name>
	
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000054</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_en_dcf_tx</name>
	<description>DCF timer for adc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>vco_en_dcf_rx</name>
	<description>DCF timer for adc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG1_REG</name>
	
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000009</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lna_core_en_dcf_tx</name>
	<description>DCF timer for lna_core_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>lna_core_en_dcf_rx</name>
	<description>DCF timer for lna_core_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
