andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG20_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000071</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_md_en_dcf_tx</name>
	<description>DCF timer for lobuf_md_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>lobuf_md_en_dcf_rx</name>
	<description>DCF timer for lobuf_md_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG21_REG</name>
	
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000071</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cp_en_dcf_tx</name>
	<description>DCF timer for cp_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>cp_en_dcf_rx</name>
	<description>DCF timer for cp_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG22_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000071</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pfd_en_dcf_tx</name>
	<description>DCF timer for pfd_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>pfd_en_dcf_rx</name>
	<description>DCF timer for pfd_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG23_BLE_REG</name>
	
	<addressOffset>0x0000002e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000060</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>gauss_en_ble_dcf_tx</name>
	<description>DCF timer for gauss_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>gauss_en_ble_dcf_rx</name>
	<description>DCF timer for gauss_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG23_FTDF_REG</name>
	
	<addressOffset>0x000000ae</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>gauss_en_ftdf_dcf_tx</name>
	<description>DCF timer for gauss_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>gauss_en_ftdf_dcf_rx</name>
	<description>DCF timer for gauss_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG24_BLE_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>rfio_txrx_ble_dcf_tx</name>
	<description>DCF timer for rfio_txrx in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>rfio_txrx_ble_dcf_rx</name>
	<description>DCF timer for rfio_txrx in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG24_FTDF_REG</name>
	
	<addressOffset>0x000000b0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>rfio_txrx_ftdf_dcf_tx</name>
	<description>DCF timer for rfio_txrx in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>rfio_txrx_ftdf_dcf_rx</name>
	<description>DCF timer for rfio_txrx in tx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG25_REG</name>
	
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000060</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_pa_en_dcf_tx</name>
	<description>DCF timer for lobuf_pa_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>lobuf_pa_en_dcf_rx</name>
	<description>DCF timer for lobuf_pa_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG26_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_rxiq_en_dcf_tx</name>
	<description>DCF timer for lobuf_rxiq_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>lobuf_rxiq_en_dcf_rx</name>
	<description>DCF timer for lobuf_rxiq_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG27_REG</name>
	
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000071</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>div2_en_dcf_tx</name>
	<description>DCF timer for div2_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>div2_en_dcf_rx</name>
	<description>DCF timer for div2_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG28_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000b2</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cp_bias_sh_open_dcf_tx</name>
	<description>DCF timer for cp_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>cp_bias_sh_open_dcf_rx</name>
	<description>DCF timer for cp_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
