andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG29_REG</name>
	
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000b2</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_bias_sh_open_dcf_tx</name>
	<description>DCF timer for vco_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>vco_bias_sh_open_dcf_rx</name>
	<description>DCF timer for vco_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG2_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000009</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lna_cgm_en_dcf_tx</name>
	<description>DCF timer for lna_cgm_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>lna_cgm_en_dcf_rx</name>
	<description>DCF timer for lna_cgm_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG30_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iffmix_bias_sh_open_dcf_tx</name>
	<description>DCF timer for iffmix_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>iffmix_bias_sh_open_dcf_rx</name>
	<description>DCF timer for iffmix_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG31_BLE_REG</name>
	
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>gauss_bias_sh_ble_dcf_tx</name>
	<description>DCF timer for gauss_bias_sh in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>gauss_bias_sh_ble_dcf_rx</name>
	<description>DCF timer for gauss_bias_sh in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG31_FTDF_REG</name>
	
	<addressOffset>0x000000be</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>gauss_bias_sh_ftdf_dcf_tx</name>
	<description>DCF timer for gauss_bias_sh in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>gauss_bias_sh_ftdf_dcf_rx</name>
	<description>DCF timer for gauss_bias_sh in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG32_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>mix_bias_sh_dcf_tx</name>
	<description>DCF timer for pa_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>mix_bias_sh_dcf_rx</name>
	<description>DCF timer for pa_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG33_REG</name>
	
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000071</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pll_dig_en_dcf_tx</name>
	<description>DCF timer for plldig_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>pll_dig_en_dcf_rx</name>
	<description>DCF timer for pll_dig_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG34_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000f3</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pllclosed_en_dcf_tx</name>
	<description>DCF timer for pllclosed_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>pllclosed_en_dcf_rx</name>
	<description>DCF timer for pllclosed_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG35_BLE_REG</name>
	
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>dem_en_ble_dcf_tx</name>
	<description>DCF timer for dem_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_en_ble_dcf_rx</name>
	<description>DCF timer for dem_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG35_FTDF_REG</name>
	
	<addressOffset>0x000000c6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>dem_en_ftdf_dcf_tx</name>
	<description>DCF timer for dem_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_en_ftdf_dcf_rx</name>
	<description>DCF timer for dem_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG36_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000021</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ldo_zero_en_dcf_tx</name>
	<description>DCF timer for ldo_zero_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ldo_zero_en_dcf_rx</name>
	<description>DCF timer for ldo_zero_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
