andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG37_BLE_REG</name>
	
	<addressOffset>0x0000004a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001ce</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cal_en_ble_dcf_tx</name>
	<description>DCF timer for cal_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>cal_en_ble_dcf_rx</name>
	<description>DCF timer for cal_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG37_FTDF_REG</name>
	
	<addressOffset>0x000000ca</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001ce</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cal_en_ftdf_dcf_tx</name>
	<description>DCF timer for cal_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>cal_en_ftdf_dcf_rx</name>
	<description>DCF timer for cal_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG38_BLE_REG</name>
	
	<addressOffset>0x0000004c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>tdc_en_ble_dcf_tx</name>
	<description>DCF timer for tdc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>tdc_en_ble_dcf_rx</name>
	<description>DCF timer for tdc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG38_FTDF_REG</name>
	
	<addressOffset>0x000000cc</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>tdc_en_ftdf_dcf_tx</name>
	<description>DCF timer for tdc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>tdc_en_ftdf_dcf_rx</name>
	<description>DCF timer for tdc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG39_REG</name>
	
	<addressOffset>0x0000004e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ldo_rfio_en_dcf_tx</name>
	<description>DCF timer for ldo_rfio_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ldo_rfio_en_dcf_rx</name>
	<description>DCF timer for ldo_rfio_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG3_REG</name>
	
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>mix_ldo_en_dcf_tx</name>
	<description>DCF timer for mix_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>mix_ldo_en_dcf_rx</name>
	<description>DCF timer for mix_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG40_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000140</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>rfio_bias_en_dcf_tx</name>
	<description>DCF timer for rfio_bias_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>rfio_bias_en_dcf_rx</name>
	<description>DCF timer for rfio_bias_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG41_REG</name>
	
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000160</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>rfio_bias_sh_dcf_tx</name>
	<description>DCF timer for rfio_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>rfio_bias_sh_dcf_rx</name>
	<description>DCF timer for rfio_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG42_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000002d6</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ldo_radio_en_dcf_tx</name>
	<description>DCF timer for ldo_radio_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ldo_radio_en_dcf_rx</name>
	<description>DCF timer for ldo_radio_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG43_REG</name>
	
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>adc_clk_en_dcf_tx</name>
	<description>DCF timer for adc_clk_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>adc_clk_en_dcf_rx</name>
	<description>DCF timer for adc_clk_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG44_BLE_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>tr_pwm_off_en_ble_dcf_tx</name>
	<description>DCF timer for tr_pwm_off_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>tr_pwm_off_en_ble_dcf_rx</name>
	<description>DCF timer for tr_pwm_off_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
