andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG44_FTDF_REG</name>
	
	<addressOffset>0x000000d8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>tr_pwm_off_en_ftdf_dcf_tx</name>
	<description>DCF timer for tr_pwm_off_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>tr_pwm_off_en_ftdf_dcf_rx</name>
	<description>DCF timer for tr_pwm_off_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG45_BLE_REG</name>
	
	<addressOffset>0x0000005a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>txdac_en_ble_dcf_tx</name>
	<description>DCF timer for txdac_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>txdac_en_ble_dcf_rx</name>
	<description>DCF timer for txdac_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG45_FTDF_REG</name>
	
	<addressOffset>0x000000da</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000060</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>txdac_en_ftdf_dcf_tx</name>
	<description>DCF timer for txdac_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>txdac_en_ftdf_dcf_rx</name>
	<description>DCF timer for txdac_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG46_BLE_REG</name>
	
	<addressOffset>0x0000005c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>spare2_en_ble_dcf_tx</name>
	<description>DCF timer for spare2_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_dcparcal_en_ble_dcf_rx</name>
	<description>DCF timer for DC partial Calibration enable in rx mode. It is OR'd with the relevant register bit that enables the partial calibration</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG46_FTDF_REG</name>
	
	<addressOffset>0x000000dc</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>spare2_en_ftdf_dcf_tx</name>
	<description>DCF timer for spare2_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_dcparcal_en_ftdf_dcf_rx</name>
	<description>DCF timer for DC partial Calibration enable in rx mode. It is OR'd with the relevant register bit that enables the partial calibration
</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG47_BLE_REG</name>
	
	<addressOffset>0x0000005e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>spare3_en_ble_dcf_tx</name>
	<description>DCF timer for spare3_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_agcunfreeze_en_ble_dcf_rx</name>
	<description>DCF timer for unfreezing the AGC in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG47_FTDF_REG</name>
	
	<addressOffset>0x000000de</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>spare3_en_ftdf_dcf_tx</name>
	<description>DCF timer for spare3_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_agcunfreeze_en_ftdf_dcf_rx</name>
	<description>DCF timer for unfreezing the AGC in rx mode </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG48_BLE_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>spare4_en_ble_dcf_tx</name>
	<description>DCF timer for spare4_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_sigdetect_en_ble_dcf_rx</name>
	<description>DCF timer for enabling the signal_detect in RX mode </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG48_FTDF_REG</name>
	
	<addressOffset>0x000000e0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>spare4_en_ftdf_dcf_tx</name>
	<description>DCF timer for spare4_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_sigdetect_en_ftdf_dcf_rx</name>
	<description>DCF timer for enabling the signal_detect in rx mode </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG49_BLE_REG</name>
	
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>dem_ftdf_en_ble_dcf_tx</name>
	<description>DCF timer for dem_ftdf_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_ftdf_en_ble_dcf_rx</name>
	<description>DCF timer for dem_ftdf_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
