andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG49_FTDF_REG</name>
	
	<addressOffset>0x000000e2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>dem_ftdf_en_ftdf_dcf_tx</name>
	<description>DCF timer for dem_ftdf_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>dem_ftdf_en_ftdf_dcf_rx</name>
	<description>DCF timer for dem_ftdf_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG4_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iff_ldo_en_dcf_tx</name>
	<description>DCF timer for iff_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>iff_ldo_en_dcf_rx</name>
	<description>DCF timer for iff_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG5_REG</name>
	
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iffadc_ldo_en_dcf_tx</name>
	<description>DCF timer for iffadc_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>iffadc_ldo_en_dcf_rx</name>
	<description>DCF timer for iffadc_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG6_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_ldo_en_dcf_tx</name>
	<description>DCF timer for vco_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>vco_ldo_en_dcf_rx</name>
	<description>DCF timer for vco_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG7_REG</name>
	
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>md_ldo_en_dcf_tx</name>
	<description>DCF timer for md_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>md_ldo_en_dcf_rx</name>
	<description>DCF timer for md_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG8_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pfd_ldo_en_dcf_tx</name>
	<description>DCF timer for pfd_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>pfd_ldo_en_dcf_rx</name>
	<description>DCF timer for pfd_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG9_REG</name>
	
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pa_ldo_en_dcf_tx</name>
	<description>DCF timer for pfd_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>pa_ldo_en_dcf_rx</name>
	<description>DCF timer for pfd_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PORT_EN_BLE_REG</name>
	
	<addressOffset>0x00000188</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RF_PORT4_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_31_REG</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>RF_PORT4_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_31_REG</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>RF_PORT3_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_30_REG</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RF_PORT3_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_30_REG</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RF_PORT2_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_29_REG</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>RF_PORT2_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_29_REG</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RF_PORT1_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_28_REG</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RF_PORT1_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_28_REG</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RF_PORT0_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_27_REG</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RF_PORT0_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_27_REG</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
