andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RF_PORT_EN_FTDF_REG</name>
	
	<addressOffset>0x0000018a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RF_PORT4_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_31_REG</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>RF_PORT4_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_31_REG</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>RF_PORT3_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_30_REG</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RF_PORT3_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_30_REG</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RF_PORT2_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_29_REG</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>RF_PORT2_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_29_REG</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RF_PORT1_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_28_REG</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RF_PORT1_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_28_REG</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RF_PORT0_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_27_REG</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RF_PORT0_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_27_REG</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PORT_POL_REG</name>
	
	<addressOffset>0x0000018c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>RF_PORT4_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RF_PORT3_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RF_PORT2_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RF_PORT1_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RF_PORT0_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RFPT</name>
	<version>1.0</version>
	<description>RFPT registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003600</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>16</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>RFPT_ADDRH_REG</name>
	<description>AHB master start address (High part)</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFPT_ADDRH</name>
	<description>It is the base address that is used by the AHB master interface of the controller ( the birs 17:16]). Defines the AHB address from where the controller will start to stores data.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RFPT_ADDRL_REG</name>
	<description>AHB master start address (Low part)</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFPT_ADDRL</name>
	<description>It is the base address that is used by the AHB master interface of the controller (the bits [15:2]). Defines the AHB address from where the controller will start to stores data.</description>
	<access>read-write</access>
	<bitRange>[15:2]</bitRange>
	
</field></fields>
</register><register>
	<name>RFPT_CRV_ADDRH_REG</name>
	<description>AHB master current address (High part)</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFPT_CRV_ADDRH</name>
	<description>It is the AHB address that will be used by the controller in the next memory access (the bits [17:16]).</description>
	<access>read-only</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RFPT_CRV_ADDRL_REG</name>
	<description>AHB master current address (Low part)</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFPT_CRV_ADDRL</name>
	<description>It is the AHB address that will be used by the controller in the next memory access (the bits [15:2]). </description>
	<access>read-only</access>
	<bitRange>[15:2]</bitRange>
	
</field></fields>
</register><register>
	<name>RFPT_CRV_LEN_REG</name>
	<description>The remaining data to be transferred</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFPT_CRV_LEN</name>
	<description>Indicates the number of words (minus 1) that remain to be transfered. It is actually the current value of the RFPT_LEN_REG.</description>
	<access>read-only</access>
	<bitRange>[14:0]</bitRange>
	
