andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>RFPT_CTRL_REG</name>
	<description>Control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFPT_BREQ_FORCE</name>
	<description>Write this bit with 1, when the required throughput for the transferring of the captured data is close to the capacity of the system bus/memory. The controller will be aggressive in the usage of the bus. The availability of the bus will be affected for the remaining masters. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>RFPT_CIRC_EN</name>
	<description>Write with 1 to enable the circular mode.In circular mode the controller continuously writes data in to the memory until to be disabled by the software. The data are transferred in the circular buffer in the memory, which is defined by the RFPT_ADDRx_REG and RFPT_LEN_REG. The disabling of the controller is realized by writing the RFPT_PACK_EN with 0.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RFPT_PACK_ADC_TYPE</name>
	<description>Selects the way with which the RFADC I and Q data will be concatenated in order to create the 32 bits data words that are moved to the memory.
0 - {RFADC_I(n+1), RFADC_I(n), RFADC_Q (n+1), RFADC_Q(n)}.
1 - {RFADC_I(n+1), RFADC_Q (n+1), RFADC_I(n) ,RFADC_Q(n)}.
The n represents time moment.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RFPT_PACK_SEL</name>
	<description>Selects the source of data that will be captured.
0 - Will capture the output of the two RFADC.
1 - Will capture the output of the Phase Detector.
2 - Will capture data from the Testbus.
3 - Reserved</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>RFPT_PACK_EN</name>
	<description>Starts the capturing of the data from the selected source (RFPT_PACK_SEL).
0 - There is no capturing of data. The packer of data is idle.
1 - The controller captures data. The packing of the data in words, is in progress.
Should be written with 1 in order to start the acquisition of data.
If the controller is not in circular mode (RFPT_CIRC_EN = 0) and after capturing a predefined number of words (RFPT_LEN), this bit will be auto cleared.
In circular mode (RFPT_CIRC_EN = 1) the RFPT_PACK_EN remains 1 until to be cleared by the software.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RFPT_LEN_REG</name>
	<description>Data length register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFPT_LEN</name>
	<description>The number of words (minus one) that should be transferred.
When the selected source of data is the two ADC (RFPT_PACK_SEL==0), will capture 2*(RFPT_LEN+ 1) samples from each ADC. If the selected source is the phase detector (RFPT_PACK_SEL==1), will capture 4*(RFPT_LEN+ 1) samples. Otherwise, will capture RFPT_LEN+1 samples from the Testbus.</description>
	<access>read-write</access>
	<bitRange>[14:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RFPT_STAT_REG</name>
	<description>Status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFPT_OFLOW_STK</name>
	<description>Indicates that during the transfer of the data, at least one overflow has detected to the fifo.
0 - The transfer completed without overflows.
1 - At least one overflow occured in the fifo.
Write 1 to clear this bit. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RFPT_ACTIVE</name>
	<description>Indicates the state of the controller.
0 - The controller is idle.
1 - The controller is active. The capturing process and/or the dma activity is in progress.
The controller will activated (RFPT_ACTIVE == 1), when RFPT_PACK_EN will be written with 1. Will return to inactive state, after the end of the capturing process (RFPT_PACK_EN==0) and the transfer of all of the data to the memory. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SPI</name>
	<version>1.0</version>
	<description>SPI registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001200</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>10</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>SPI_CLEAR_INT_REG</name>
	<description>SPI clear interrupt register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SPI_CLEAR_INT</name>
	<description>Writing any value to this register will clear the SPI_CTRL_REG[SPI_INT_BIT]
Reading returns 0. </description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SPI_CTRL_REG</name>
	<description>SPI control register 0</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SPI_EN_CTRL</name>
	<description>0 = SPI_EN pin disabled in slave mode. Pin SPI_EN is don't care.
1 = SPI_EN pin enabled in slave mode. </description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>SPI_MINT</name>
	<description>0 = Disable SPI_INT_BIT to ICU
1 = Enable SPI_INT_BIT to ICU.
Note that the SPI_INT interrupt is shared with AD_INT interrupt </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>SPI_INT_BIT</name>
	<description>0 = RX Register or FIFO is empty.
1 = SPI interrupt. Data has been transmitted and receivedMust be reset by SW by writing to SPI_CLEAR_INT_REG. </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>SPI_DI</name>
	<description>Returns the actual value of pin SPI_DIN (delayed with two internal SPI clock cycles) </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>SPI_TXH</name>
	<description>0 = TX-FIFO is not full, data can be written.
1 = TX-FIFO is full, data can not be written. </description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>SPI_FORCE_DO</name>
	<description>0 = normal operation
1 = Force SPIDO output level to value of SPI_DO. </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SPI_RST</name>
	<description>0 = normal operation
1 = Reset SPI. Same function as SPI_ON except that internal clock remain active. </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SPI_WORD</name>
	<description>00 = 8 bits mode, only SPI_RX_TX_REG0 used
01 = 16 bit mode, only SPI_RX_TX_REG0 used
10 = 32 bits mode, SPI_RX_TX_REG0 &amp; SPI_RX_TX_REG1 used
11 = 9 bits mode. Only valid in master mode. </description>
	<access>read-write</access>
	<bitRange>[8:7]</bitRange>
	
</field><field>
	<name>SPI_SMN</name>
	<description>Master/slave mode
0 = Master,
1 = Slave(SPI1 only) </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SPI_DO</name>
	<description>Pin SPI_DO output level when SPI is idle or when SPI_FORCE_DO=1 </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SPI_CLK</name>
	<description>Select SPI_CLK clock output frequency in master mode:
00 = SPI_CLK / 8
01 = SPI_CLK / 4
10 = SPI_CLK / 2
11 = SPI_CLK / 14 </description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>SPI_POL</name>
	<description>Select SPI_CLK polarity.
0 = SPI_CLK is initially low.
1 = SPI_CLK is initially high. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SPI_PHA</name>
	<description>Select SPI_CLK phase. See functional timing diagrams in SPI chapter</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SPI_ON</name>
	<description>0 = SPI Module switched off (power saving). Everything is reset except SPI_CTRL_REG0 and SPI_CTRL_REG1. When this bit is cleared the SPI will remain active in master mode until the shift register and holding register are both empty.
1 = SPI Module switched on. Should only be set after all control bits have their desired values. So two writes are needed! </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
