andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>SPI2_CTRL_REG1</name>
	<description>SPI control register 1</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SPI_9BIT_VAL</name>
	<description>Determines the value of the first bit in 9 bits SPI mode. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SPI_BUSY</name>
	<description>0 = The SPI is not busy with a transfer. This means that either no TX-data is available or that the transfers have been suspended due to a full RX-FIFO. The SPIx_CTRL_REG0[SPI_INT_BIT] can be used to distinguish between these situations.
1 = The SPI is busy with a transfer. </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SPI_PRIORITY</name>
	<description>0 = The SPI has low priority, the DMA request signals are reset after the corresponding acknowledge.
1 = The SPI has high priority, DMA request signals remain
active until the FIFOS are filled/emptied, so the DMA holds the AHB bus. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SPI_FIFO_MODE</name>
	<description>0: TX-FIFO and RX-FIFO used (Bidirectional mode).
1: RX-FIFO used (Read Only Mode) TX-FIFO single depth, no flow control
2: TX-FIFO used (Write Only Mode), RX-FIFO single depth, no flow control
3: No FIFOs used (backwards compatible mode) </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SPI2_RX_TX_REG0</name>
	<description>SPI RX/TX register0</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SPI_DATA0</name>
	<description>Write: SPI_TX_REG0 output register 0 (TX-FIFO)
Read: SPI_RX_REG0 input register 0 (RX-FIFO)
In 8 or 9 bits mode bits 15 to 8 are not used, they contain old data. </description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SPI2_RX_TX_REG1</name>
	<description>SPI RX/TX register1</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SPI_DATA1</name>
	<description>Write: SPI_TX_REG1 output register 1 (MSB's of TX-FIFO)
Read: SPI_RX_REG1 input register 1 (MSB's of RX-FIFO)
In 8 or 9 or 16 bits mode bits this register is not used. </description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TIMER1</name>
	<version>1.0</version>
	<description>TIMER1 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000200</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>36</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CAPTIM_CAPTURE_GPIO1_REG</name>
	<description>Capture Timer value for event on GPIO1</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_CAPTURE_GPIO1</name>
	<description>Gives the Capture time for event on GPIO1</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_CAPTURE_GPIO2_REG</name>
	<description>Capture Timer value for event on GPIO2</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_CAPTURE_GPIO2</name>
	<description>Gives the Capture time for event on GPIO2</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_CAPTURE_HIGH_GPIO1_REG</name>
	<description>Capture Timer high value for event on GPIO01</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_CAPTURE_HIGH_GPIO1</name>
	<description>Gives the Capture high time for event on GPIO1</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_CAPTURE_HIGH_GPIO2_REG</name>
	<description>Capture Timer high value for event on GPIO02</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_CAPTURE_HIGH_GPIO2</name>
	<description>Gives the Capture high time for event on GPIO2</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_CTRL_REG</name>
	<description>Capture Timer control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_SYS_CLK_EN</name>
	<description>'1' Capture Timer uses the system clock
'0' Capture Timer uses the 32KHz clock</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>CAPTIM_FREE_RUN_MODE_EN</name>
	<description>Valid when timer counts up, if it is '1' timer does not zero when reaches to reload value. it becomes zero only when it reaches the max value.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>CAPTIM_IRQ_EN</name>
	<description>'1' Capture timer IRQ is unmasked, '0' masked</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>CAPTIM_IN2_EVENT_FALL_EN</name>
	<description>'1' input1 event type is falling edge, '0' rising edge</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>CAPTIM_IN1_EVENT_FALL_EN</name>
	<description>'1' input2 event type is falling edge, '0' rising edge</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>CAPTIM_COUNT_DOWN_EN</name>
	<description>'1' timer counts down, '0' count up</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CAPTIM_ONESHOT_MODE_EN</name>
	<description>'1' OneShot mode enabled, '0' Capture/Timer mode enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>CAPTIM_EN</name>
	<description>'1' Capture Timer enabled, else disabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
