andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>CAPTIM_GPIO1_CONF_REG</name>
	<description>Capture Timer gpio1 selection</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>CAPTIM_GPIO1_CONF</name>
	<description>Select one of the 37 GPIOs as IN1, Valid value 0-37. 1 for P00 .. 37 for P47. 0 Disable input</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_GPIO2_CONF_REG</name>
	<description>Capture Timer gpio2 selection</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>CAPTIM_GPIO2_CONF</name>
	<description>Select one of the 37 GPIOs as IN2, Valid value 0-37. 1 for P00 .. 37 for P47. 0 Disable input</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_PRESCALER_REG</name>
	<description>Capture Timer prescaler value</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_PRESCALER</name>
	<description>Defines the timer count frequncy. CLOCK frequency / (CAPTIM_PRESCARLER+1)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_PRESCALER_VAL_REG</name>
	<description>Capture Timer interrupt status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_PRESCALER_VAL</name>
	<description>Gives the current prescaler value</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_PWM_DC_REG</name>
	<description>Capture Timer pwm dc register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_PWM_DC</name>
	<description>Defines the PWM duty cycle. CAPTIM_PWM_DC / ( CAPTIM_PWM_FREQ+1)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_PWM_FREQ_REG</name>
	<description>Capture Timer pwm frequency register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_PWM_FREQ</name>
	<description>Defines the PWM frequency. Timer clock frequency / (CAPTIM_PWM_FREQ+1)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_RELOAD_HIGH_REG</name>
	<description>Capture Timer reload high value and Delay in shot mode</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_RELOAD_HIGH</name>
	<description>Reload high value or max high value in timer mode, Delay phase duration in oneshot mode. Actual delay is the register value plus synchronization time (3 clock cycles)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_RELOAD_REG</name>
	<description>Capture Timer reload value and Delay in shot mode</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_RELOAD</name>
	<description>Reload or max value in timer mode, Delay phase duration in oneshot mode. Actual delay is the register value plus synchronization time (3 clock cycles)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_SHOTWIDTH_HIGH_REG</name>
	<description>Capture Timer Shot high duration in shot mode</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_SHOTWIDTH_HIGH</name>
	<description>Shot phase high duration in oneshot mode</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_SHOTWIDTH_REG</name>
	<description>Capture Timer Shot duration in shot mode</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CAPTIM_SHOTWIDTH</name>
	<description>Shot phase duration in oneshot mode</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CAPTIM_STATUS_REG</name>
	<description>Capture Timer status register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>CAPTIM_ONESHOT_PHASE</name>
	<description>0 : Wait for event, 1 : Delay phase, 2 : Start Shot, 3 : Shot phase</description>
	<access>read-only</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>CAPTIM_IN2_STATE</name>
	<description>Gives the logic level of the IN1</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>CAPTIM_IN1_STATE</name>
	<description>Gives the logic level of the IN2</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
