andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>USB_UX20CDR_REG</name>
	<description>Transceiver 2.0 Configuration and Diagnostics Register(for test purpose only)</description>
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RPU_TEST7</name>
	<description>Test bit </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RPU_TEST_SW2</name>
	<description>0: Closes SW2 switch to reduced pull-up resistor connected to the USB_Dp and USB_Dm.
1: Opens SW2 switch resistor connected to the USB_Dp and USB_Dm (independent of the VBus state).</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RPU_TEST_SW1</name>
	<description>0: Enable the pull-up resistor on USB_Dp (SW1 closed)
1: Disable the pull-up resistor on USB_Dp (SW1 open) (Independent of the VBus state).</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>RPU_TEST_EN</name>
	<description>Pull-Up Resistor Test Enable
0: Normal operation
1: Enables the test features controlled by RPU_TEST_SW1, RPU_TEST_SW1DM and RPU_TEST_SW2</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RPU_TEST_SW1DM</name>
	<description>0: Enable the pull-up resistor on USB_Dm (SW1DM closed)
1: Disable the pull-up resistor on USB_Dm (SW1DM open) (Independent of the VBus state).</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RPU_RCDELAY</name>
	<description>Test bit, must be kept 0 </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RPU_SSPROTEN</name>
	<description>Test bit, must be kept 0 </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_XCVDIAG_REG</name>
	<description>Transceiver diagnostic Register (for test purpose only)</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_VPIN</name>
	<description>With Bit0 = 1 this bit shows the level of the USB_Dp receive data from transceiver; i.e. D+ &lt;= VSE. </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>USB_VMIN</name>
	<description>With Bit0 = 1 this bit shows the level USB_Dm receive data from transceiver; i.e. D- &lt;= VSE. </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_RCV</name>
	<description>With Bit0 = 1 this bit shows the differential level of the receive comparator. </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>USB_XCV_TXEN</name>
	<description>With Bit0 = 1, this bit enables test Bits 2,1. Must be kept to '0' for normal operation </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>USB_XCV_TXn</name>
	<description>With Bit3,0 = 1, this bit sets USB_Dm to a high level, independent of LSMODE selection </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>USB_XCV_TXp</name>
	<description>With Bit3,0 = 1, this bit sets USB_Dp to a high level, independent of LSMODE selection </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>USB_XCV_TEST</name>
	<description>Enable USB_XCVDIAG_REG
0: Normal operation, test bits disabled
1: Enable test bits 7,6,5,3,2,1</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>WAKEUP</name>
	<version>1.0</version>
	<description>WAKEUP registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000100</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>52</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>WKUP_CLEAR_0_REG</name>
	<description>Clear event register for P0 and P1</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>WKUP_CLEAR_P1</name>
	<description>Clear latched value of the GPIOs P1 when corresponding bit is 1</description>
	<access>write-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>WKUP_CLEAR_P0</name>
	<description>Clear latched value of the GPIOs P0 when corresponding bit is 1</description>
	<access>write-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_CLEAR_1_REG</name>
	<description>Clear event register for P2</description>
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>WKUP_CLEAR_P2</name>
	<description>Clear latched value of the GPIOs P2 when corresponding bit is 1</description>
	<access>write-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_CLEAR_2_REG</name>
	<description>Clear event register for P3 and P4</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>WKUP_CLEAR_P4</name>
	<description>Clear latched value of the GPIOs P4 when corresponding bit is 1</description>
	<access>write-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>WKUP_CLEAR_P3</name>
	<description>Clear latched value of the GPIOs P3 when corresponding bit is 1</description>
	<access>write-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_CTRL_REG</name>
	<description>Control register for the wakeup counter</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>WKUP_ENABLE_IRQ</name>
	<description>0: no interrupt will be enabled
1: if you have an event an IRQ will be generated </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>WKUP_SFT_KEYHIT</name>
	<description>0 = no effect
1 = emulate key hit. First make this bit 0 before any new key hit can be sensed. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>WKUP_DEB_VALUE</name>
	<description>Wakeup debounce time. If set to 0, no debouncing will be done.
Debounce time: N*1 ms. N =1..63</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
