andrew-ongh/fresh_SDK/config/embsys/Dialog_Semiconductor/DA14683-00.xml
</field></fields>
</register><register>
	<name>WKUP_POL_P0_REG</name>
	<description>select the sesitivity polarity for each P0 input</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>WKUP_POL_P0</name>
	<description>0: enabled input P0x will give an event if that input goes high
1: enabled input P0x will give an event if that input goes low</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_POL_P1_REG</name>
	<description>select the sesitivity polarity for each P1 input</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>WKUP_POL_P1</name>
	<description>0: enabled input P1x will give an event if that input goes high
1: enabled input P1x will give an event if that input goes low</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_POL_P2_REG</name>
	<description>select the sesitivity polarity for each P2 input</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>WKUP_POL_P2</name>
	<description>0: enabled input P2x will give an event if that input goes high
1: enabled input P2x will give an event if that input goes low</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_POL_P3_REG</name>
	<description>select the sesitivity polarity for each P3 input</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>WKUP_POL_P3</name>
	<description>0: enabled input P3x will give an event if that input goes high
1: enabled input P3x will give an event if that input goes low</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_POL_P4_REG</name>
	<description>select the sesitivity polarity for each P3 input</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>WKUP_POL_P4</name>
	<description>0: enabled input P4x will give an event if that input goes high
1: enabled input P4x will give an event if that input goes low</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_RESET_IRQ_REG</name>
	<description>Reset wakeup interrupt</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>WKUP_IRQ_RST</name>
	<description>writing any value to this register will reset the interrupt. reading always returns 0. </description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SELECT_P0_REG</name>
	<description>select which inputs from P0 port can trigger wkup counter</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>WKUP_SELECT_P0</name>
	<description>0: input P0x is not enabled for wakeup event
1: input P0x is enabled for wakeup event</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SELECT_P1_REG</name>
	<description>select which inputs from P1 port can trigger wkup counter</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>WKUP_SELECT_P1</name>
	<description>0: input P1x is not enabled for wakeup event
1: input P1x is enabled for wakeup event </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SELECT_P2_REG</name>
	<description>select which inputs from P2 port can trigger wkup counter</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>WKUP_SELECT_P2</name>
	<description>0: input P2x is not enabled for wakeup event
1: input P2x is enabled for wakeup event </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SELECT_P3_REG</name>
	<description>select which inputs from P3 port can trigger wkup counter</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>WKUP_SELECT_P3</name>
	<description>0: input P3x is not enabled for wakeup event
1: input P3x is enabled for wakeup event </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SELECT_P4_REG</name>
	<description>select which inputs from P3 port can trigger wkup counter</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>WKUP_SELECT_P4</name>
	<description>0: input P4x is not enabled for wakeup event
1: input P4x is enabled for wakeup event </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
